{"Volunteer Mentor - Boys & Girls Clubs of Calgary": "Our mission is to provide a safe, supportive place where children and youth can experience new opportunities, overcome barriers, build positive relationships and develop confidence and skills for life.\n\nOur vision is that all children and youth discover and achieve their dreams and are healthy, successful and active participants in society.\n\nBoys and Girls Clubs of Calgary (BGCC) offers programs and activities at 25 locations across the city, enriching the lives of more than 43,000 children, youth and their families each year. Their mission is to provide a safe, supportive place where children and youth can experience new opportunities, overcome barriers, build positive relationships and develop confidence and skills for life. With Calgary’s ever-growing population, the need for accessible programs for children and youth will increase. Boys and Girls Clubs of Calgary works to meet these needs by strategically increasing funding for programs in areas of highest need. BGCC strives to be recognized, respected and supported as the premier organization serving children, youth and their families in Calgary’s highest need communities.\nSeniority Level\nAssociate\nIndustry\nNon-profit Organization Management Individual & Family Services\nEmployment Type\nVolunteer\nJob Functions\nOther", "Volunteer Mentor - SOMALI CANADIAN WOMEN AND CHILDREN ASSOCIATION": "SOMALI CANADIAN WOMEN AND CHILDREN ASSOCIATION — MANDATE\nSomali Canadian Women and Children Association (SCWCA) was formed in 2010 to assist and provide support to women and children in need. We recognize, respond to, and focus on the specific concerns and needs of immigrant and refugee women and their families. SCWCA’s uniqueness is based on having a gender-related mandate, which has provided best practices in developing customized female-focused initiatives. These initiatives often include children, family, and community well being as important outcomes of our engagement as we know that our clients live and work within interconnected social systems.\n\nSCWCA Mentoring Program\n\nIn School Mentoring program provides students who could benefit from extra support, academic, emotional, and social support with experienced adult mentor. Our goal is to provide programs that youth can benefit and to become connected their school and the community.\nIn School program delivers a weekly visit of 3 hours a week during the school time.\n\nOur Goals Are Following\nTo provide additional role model in the life of the children\nTo develop enhanced attitude about their school involvements\nTo build self-confidence\nIncrease positive problem-solving and coping skills.\nPromote the importance of staying in schools and healthy relationships with their family and peers.\nEnhance Social skills\nEncourage leadership skills and independent thinking to make health chooses while having fun.\nAcademic support at the school or off the school and providing ongoing support\nBuilding healthy relationships between school admin, parents and the students\nInvite parents to participate the parents-teacher meetings\nTo provide translation for Somali and Arabic when necessary\nSports programs\nTo provide one on one counseling\nConnecting to students and their families to recreation facilities\nTo connect legal assistance both students and their parents\nParenting workshops\nSelf-discipline and respect for self and others\nShould you have any concern or question, please feel free to reach me at main office line (780) 756-1175 or email to info@edmontonsomali.com of Somali Canadian Women & Children Association.\nSeniority Level\nAssociate\nIndustry\nNon-profit Organization Management Individual & Family Services\nEmployment Type\nVolunteer\nJob Functions\nOther", "Commercial Insurance Producer": "The Opportunity:\nWe are looking for an established insurance professional with a level 2 license and a wealth commercial experience to join our client’s team as their next Commercial Insurance Producer. As a senior member of the team you will be looked to as a mentor by the more junior producers. In the long run there is an equity opportunity for the right candidate. Experience in Transportation, Oil and Gas, and Construction would all be valuable.\n\nThe Employer:\nOur client is a savvy Edmonton based firm that provides innovative insurance solutions to a variety of commercial customers. Their customer care has earned them the reputation as a top performing insurance firm. They pride themselves on creating a work environment where you can both achieve success and enjoy yourself along the way.\n\nAbout You:\nYou have worked hard to get where you are. You have had success but you know that there is little to no room for upward growth in your current situation. This opportunity affords you the chance to keep experiencing the same success you’ve become accustomed to with the added security of knowing that your company will seriously consider you for partnership opportunities.\n\nQualifications:\nLevel 2 Insurance License\n5 years of commercial insurance account experience required\nProficient in Microsoft Office: Word, Excel, and Outlook\nMember of or currently working towards the C.I.P. or CAIB designation\nExperience with insurance broker management systems\nEffective organizational, time and client management skills\nStrong verbal and written communication skills", "Little Burgundy Cashier (Part-Time)": "OB OBJECTIVE\n\nSupports the management team by performing customer service activities at the cash counter.\n\nSTATUS\n\nReports directly to the Store Manager and the Assistant Manager and works in close collaboration with other resource departments. The cashier represents the image of the company and is an integral part of the store team.\n\nKey Job Functions\n\nProvide prompt and professional service to customers, assist in the store administration and keep the cash area neat and orderly.\n\nDUTIES PERFORMED\nOperates the POS cash register efficiently.\nEffectuates store transactions.\nPerforms administrative tasks efficiently.\nVerifies merchandise to avoid mismatches (mixes).\nWraps and handles the merchandise with care.\nResponds to telephone calls in a professional manner.\nKeeps cash area neat and orderly at all times.\nSuggests items that meet customers’ needs (gift cards, shoe care products, accessories, etc.).\nSupports the store management in developing our customer base by thanking, re-assuring and re-inviting our customers back to the store.\nOffers exceptional after-sales service in terms of repairing, exchanging or refunding merchandise to our customers.\nAssists the store management in various backstore functions.\n\n\nQualifications (minimum Qualifications Required To Perform Tasks)\nRelated work experience: preferably, six months of operating a cash register in a high-volume retail store ($1.5M)\nGeneral work experience or equivalent formal education: high school\nOther qualifications: customer service oriented, excellent communication skills, effective organizational skills, strong mathematical aptitude, interpersonal skills, and willing to work retail hours.\nSeniority Level\nEntry level\nIndustry\nApparel & Fashion Retail Luxury Goods & Jewelry\nEmployment Type\nPart-time\nJob Functions\nSales Business Development", "Process Engineer": "Bunge (www.bunge.com, NYSE: BG) is a world leader in sourcing, processing and supplying oil seed and grain products and ingredients. Founded in 1818, Bunge's expansive network feeds and fuels a growing world, creating sustainable products and opportunities for more than 70,000 farmers and the consumers they serve in over 60 countries. The company is headquartered in New York and has 31,000 employees worldwide who stand behind more than 360 port terminals, oilseed processing plants, grain silos, and food and ingredient production and packaging facilities around the world.\n\nProvides process engineering support to assigned facility to improve efficiencies, troubleshoot operation issues, and aid in capital project design. This position will follow engineering principles and the Bunge Core Values in providing operations support to meet business needs required to keep the assigned facility competitive. P rovide process engineering and management support to Maintenance and Reliability Manager, Crush Supervisors, Plant Manager, and others as required. Work on special projects as assigned by the Maintenance and Reliability Manager and Plant Manager. Pursue and implement technological advancement that will ensure maximum efficiencies at the Fort Saskatchewan location. Drive productivity improvements throughout the facility.\n\nEssential Duties\nSafety: Develop, promote and enforce safety in the workplace by actively demanding employees and contractors to work safely by setting and personally demonstrating safe work habits.\nManage the Process Safety Management program and ensure compliance with regulations and Bunge policies.\nIntense, laser sharp focus to drive efficiencies by reducing costs without compromising safety.\nWorking with the facility to plan and develop projects for productivity improvement related to Productivity, Quality, Safety, and Environment (PQSE) gap closure.\nWork with the facility to prioritize and optimize ‘Key Performance Indicators” (KPI)\nEvaluate Lean Sigma opportunities and coordinate and assist with implementation.\nImplement process optimization.\nProvide general technical assistance to operations staff concerning the following: dry material handling, air flows, heat exchange, electricity and power, programmable logistical controllers (PLC), steam generation/use and liquid movement/storage.\nCollaborate with facility management to define technical needs and CapEx requirements, recommend CapEx projects, evaluate CapEx proposals for technical viability, and assist with development of the project presentations.\nAssist plant management with projects, drawing reviews, equipment specifications, operational narrative preparations, employee training, commissioning a start-up.\nIdentify, promote, and coordinate implementation of best practices across the facility and assist with problem-solving and troubleshooting operational problems.\nAssist facility with vendor assessments, OEM equipment evaluations, and assessments of contractors and consulting engineers.\nCoordinate with local plant management to ensure that projects are in compliance with Federal and State environmental regulations.\nDemonstrate cost conscious and quality conscious decision making.\nInterface effectively with other departments such as commercial, safety, accounting, legal, environmental, engineering, QA/QC, and procurement to assist with optimal execution of business needs.\nAssist with review of production data routinely to ensure accuracy and to analyze for continuous improvements throughout the facility.\nSupport Regional Continuous improvement efforts\nQualifications\nBachelor's degree in mechanical, civil, agricultural, electrical, or chemical engineering or equivalent work experience required.\n3+ years of experience, in plant operations, maintenance and safety is required.\nProficiency with applicable computer software packages including AutoCad, Microsoft Word, Excel and Project.\nKnowledge of design codes and government regulations affecting the industry including NFPA 36, NFPA 61, OSHA and EPA is preferred.\nDemonstrates mechanical aptitude and interest with strong problem solving skills.\nDemonstrates organizational and planning capabilities.\nStrong verbal and written communication skills.\nCollaborative team player.\nBunge is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, transgender status, national origin, citizenship, age, disability or military or veteran status, or any other legally protected status. Bunge is an Equal Opportunity Employer. Minorities/Women/Veterans/Disabled", "Senior Consultant, Restructuring | Corporate Finance & Restructuring": "Posted by\nSam Dumash\nRecruiting specialist with Big 4 expertise in full life-cycle recruiting, staffing and market analysis.\nAbout The Role\n\nIn FTI Consulting's Corporate Finance & Restructuring segment we focus on our clients' strategic, operational, financial and capital needs by addressing the full spectrum of financial and transactional challenges faced by corporations, boards, private equity sponsors, creditor constituencies and other stakeholders.\n\nWhat You'll Do\nResponsible for day to day activities of project including interaction with other team members, professionals from other firms involved in the engagement and client personnel. May include supervision of client personnel.\nApply business, accounting, finance and diagnostic skills to various client situations and practice disciplines.\nPrepare complex financial projections and worksheets to model business processes and/or actual or hypothetical transactions.\nPrepare draft written reports for third parties, as necessary, on the project scope, findings and/or results of activities.\n\nHow You'll Grow\n\nThis is an excellent opportunity for a person with proven, hands-on corporate finance experience who wants to provide analytical services to debtors, creditors and other stakeholders of companies experiencing unfavorable situations arising from liquidity problems.\n\nBasic Qualifications/Qualifications & Experience\nBachelor's Degree in Accounting, Economics, or Finance.\n3 years in Public Accounting, Consulting, or other Professional Services environment.\nProficient use and analysis of computer models and development of dynamic spreadsheet applications.\nFamiliarity with Internet-based financial research resources for corporate information, SEC filings, competitive data, etc.\nAbility to travel up to 80%.\n\nOur Benefits\n\nApart from the well-structured career path and excellent team environment, our employees enjoy a variety of perks and benefits. Our benefits include, but are not limited to:\nCompetitive salary and bonus plans\nGenerous paid holidays, time off and parental leave\nFull package of benefits plans\nCompany matched 401K\nAnnual paid volunteer hours\nCorporate matching for charitable donations\nPotential for flexible working arrangements\nFree snacks and drinks\nUpscale offices close to public transportation\nPet insurance\n\n\nAbout FTI Consulting\n\nWhat makes us unique? With more than 5,000 employees located in offices in every corner of the globe, we are the firm our clients call when their most important issues are at stake. Regardless of what level you are, you will have the opportunity to work alongside and learn from top experts in your field on high-profile engagements that impact history. Our culture is collaborative, and we value diversity, recognition, development and making a difference in our communities.\n\nFTI Consulting is publicly traded on the New York Stock Exchange and has been recognized as a Best Firm to Work For by Consulting magazine and one of America's Best Management Consulting Firms by Forbes . For more information, visit www.fticonsulting.com and connect with us on Twitter ( @FTIConsulting ), Facebook and LinkedIn .\n\nFTI Consulting is an equal opportunity employer and does not discriminate on the basis of race, color, national origin, ancestry, citizenship status, protected veteran status, religion, physical or mental disability, marital status, sex, sexual orientation, gender identity or expression, age, or any other basis protected by law, ordinance, or regulation.\n\nIndustry\nInformation Technology & Services Staffing & Recruiting Management Consulting\nEmployment Type\nFull-time\nJob Functions\nFinance Sales", "Customer Service Representative": "Has your paper napkin business plan turned into a billion-dollar reality? Ours has, and our employees have helped us get to where we are today; and as we continue to scale towards being the incomparable leader in our industry, we are looking for a Customer Service Representative to help write the next chapter with us.\n\nWhat started as a sketch on a napkin is now our world-class software platform that combines cutting-edge technology with outstanding client service and premier wealth management capabilities. Shareworks by Morgan Stanley is designed to simplify the complexities of equity plan management, while helping employees realize the full potential of their benefits.\n\nIf you’re sitting there scratching your head while reading this and wondering how you could possibly be part of “simplifying the complexities of equity compensation”, keep reading to the bottom and you’ll find out!\n\nWe currently have a permanent opportunity for: Customer Service Representatives\n\nLocated in downtown Calgary, this role is the face of our Company to our customers. Our agents interact daily with a wide variety of our clients, building and maintaining strong relationships with corporate participants. We have always been successful in building trust and respect with our customers through dedicated relationship management, supported by delivering our promise of \"Everyday Excellence\".\n\nWe are looking for enthusiastic, outgoing individuals who share our passion for customer service excellence and have a deep desire to learn through a combination of training and hands-on experience. Whether or not you have experience with equity compensation plan administration, if this sounds like an exciting challenge and your kind of work environment, we would love to hear from you!\n\nResponsibilities\nHandling inbound and outbound calls to stock option and share purchase plan participants focused on transactions\nAddressing customer needs and challenges while keeping other team members updated with ongoing client requests and requirements\nAnswering questions by using Shareworks™ and other online tools\nStock Market Trading - Order execution, Change Former Order (CFO) and related questions\nHandling complaints from participants, ensuring all situations are closed off or escalated appropriately\nKeeping operational results in mind by seeking to achieve daily benchmarks for call volume\nFollowing established rules that support compliance and audit purposes\nComfortable enforcing or escalating issues on a case by case basis\nEnsure customer satisfaction by completion of activities - all situations closed off and follow up on any unresolved issues\n\n\nQualifications\nDegree or diploma in Business, Commerce, Finance or similar area of focus would be preferred but is not mandatory\nFluency in oral and written English is a requirement; fluency in other languages is considered an asset\nProven success with communication and customer service in a variety of service mediums including direct contact via phone, fax and email\nUnderstanding of markets and trading would be a definite asset, but is not mandatory\nFlexible availability to accommodate dynamic business needs, Monday-Friday between 6:00am-6:00pm MT\nDemonstrated ability to learn new tools, software and technologies quickly\nStrong analytical, attention-to-detail, and problem solving skills\nComfortable in a fast-paced and evolving environment which includes ongoing learning and training opportunities\n\n\nPlease Note\n\nSuccessful applicants MUST be available for a 2-week training period at regular full-time hours starting February 1, 2020 in Calgary, AB. No time off will be permitted during the training period. After the training period, working hours will scheduled between the hours of 6am to 6pm MT.\n\nOkay, If You Kept Reading Until Now But You’re Still Wondering How You Can Help “simplify The Complexities Of Equity Compensation”, This Analogy May Help\n\nLuke Skywalker works for Deathstar Inc. and as part of the benefits program he receives stocks annually from the Company. Thankfully, Deathstar Inc. uses Shareworks™ so Luke can log in to see how many stocks he has received to date, when they are vesting, and even sell those stocks when the price is right. Meanwhile, Princess Leia in finance uses Shareworks™ to manage what the Company is offering out to all the employees. If you’re still confused, don’t worry, we’ll provide training to make you an expert!\n\nWhile we thank all applicants for their interest, please note that only those individuals selected for an interview will be contacted.\n\n#vizi#\nSeniority Level\nAssociate\nIndustry\nComputer Software Financial Services\nEmployment Type\nFull-time\nJob Functions\nCustomer Service Information Technology", "Vice-President, Academics & Research": "Ensuring best practices are employed in the development, enhancement, updating and delivery of programming;\nSupporting formative evaluation efforts of Deans and Departments;\nDeveloping, implementing and maintaining a Program Review process;\nCreating and implementing a Master Academic Plan;\nProviding leadership of academic policy development and final approval at Academic Council;\nMaintaining regular contact with Deans and Academic Directors and support efforts to deliver quality instruction; and\nEngaging with the Senior Leadership Team, Deans and Chairs’ Councils, Academic Council and other academic committees as relevant.\nAn abundance of forest reserves to responsibly meet the needs of a sustainable forest products industry.\nWorld-class agriculture production supported by exceptional farmland.\nAn abundance of land suitable for both industrial and residential development.\nAn abundance of clean air and water.\nUnmatched scenery and culturally diverse communities with limitless opportunities for leisure and recreation.\nRegional strength created from policies such as no provincial sales tax and low municipal tax.\nA thriving and diverse arts community\nAn exceptional quality of life with access to the best amenities, health services and community programs making the Grande Prairie Region an ideal place to raise a family.\nSeniority Level\nExecutive\nIndustry\nFood Production Banking Financial Services\nEmployment Type\nFull-time\nJob Functions\nEducation Training", "Product Development Technician": "", "Account Manager": "Your new company \nOur client is a global leader in the electrical distribution sector. With over 60 years of experience, your new company has a stronghold as one of the worlds leading wholesale electrical distributors. Our client prides themselves on being innovative, dynamic and passionate about industrial automation products and services, such as energy management & electrical products made available for residential and commercial contractors.\n\nYour new role \nAs the Account Manager, you will work closely with the branches in central Canada to grow the E-Commerce side of the business. You will have the autonomy to make your schedule to best suit building strong relationships with the branches while identifying opportunities for your mutual clients to grow the E-Commerce business within these branches and their clients. Having strong relationship skills you will easily make a top-line revenue contribution to your branches and your clients by offering innovative and dynamic solutions for their distribution needs by offering an E-Commerce solution.\n\nWhat you'll need to succeed \nYou will have an engaging and enthusiastic personality and love collaborating to solve problems with your clients. You will be tech-savvy and have 3-5+ years of experience in a B2B/ Account Manager role. You will have a proven track record of building strong relationships while having a passion to solve problems by offering a solution based service.\n\nWhat you'll get in return \nYou will receive a generous base salary + a 30% annual bonus along with 3 weeks vacation, a car allowance + mileage and a robust benefits package. This role provides autonomy along with the support to help you succeed and achieve personal and company objectives.\n\nWhat you need to do now\nIf you're interested in this role, click 'apply now' to forward an up-to-date copy of your CV, or call us now.\nIf this job isn't quite right for you but you are looking for a new position, please contact us for a confidential discussion on your career.\nSeniority Level\nMid-Senior level\nIndustry\nElectrical & Electronic Manufacturing Industrial Automation Telecommunications\nEmployment Type\nFull-time\nJob Functions\nSales Business Development Customer Service", "Scheduling Care Coordinator - Overnights": "Scheduling Care Coordinator - Overnights (4 days on/4 days off Rotation)\n\nCBI Health Group, one of the largest network of integrated community health services in Canada. We offer rehabilitation, home health, neurodevelopment and workplace health services across the country.\n\nIf making a difference in the lives of others is a priority for you as a professional, and you enjoy working alongside engaged front-line staff to ensure client satisfaction, CBI Health Group has an opportunity offering competitive compensation as well as the chance to meet your career goals.\n\nAs a Care Coordinator within our Calgary Office, on ensuring a positive patient and family experience by effectively scheduling direct care providers in the community to meet the requirements of patient care plans. You’ll be part of a team of Care Coordinators working diligently to provide as much consistency of care as possible while meeting the scheduling requirements of both patients and care providers. Frequently problem-solving, you’ll be the central point of contact for patients and families, care providers and referral sources. Effective care coordination is an important element of service delivery; as a result, you must be driven to help others in a compassionate and caring way while balancing the pressures to deliver on scheduling requirements.\n\nHours Of Work\nOvernights 12:00am-8:00am\n4 days on & 4 days off set rotation\nRotation includes working weekends (Saturday and Sundays)\nPositions is working from the office, located at 200-2912 Memorial Drive SE, Calgary\nAs a Care Coordinator, You Will\nUse scheduling software effectively to fulfill patients’ care plans\nProvide field staff with accurate schedules on a weekly basis\nEnsure care providers are scheduled effectively and efficiently\nCommunicate effectively with care providers to ensure schedules are carried out\nCommunicate with patients and families when schedule challenges arise, and problem-solve effectively\nMaintain accurate records of care provider availability\nMaintain continuity of care whenever possible\nTake into consideration the individual needs of patients (and families), and of care providers, when making decisions\nMaintain accessibility by phone for patients, care providers, referral sources and other stakeholders\nActively pursue positive relationships with care providers and patients\nFollow up appropriately on missed visits\nLiaise with Care Supervisors to share patient and care provider feedback\nResolve or escalate, as required, client concerns/issues\nEnsure dated notes are timely and clear, and contain appropriate and required information\nEnsure accurate, timely documentation and/or phone calls, both external and internal\nRespond to faxes and emails in a timely manner\nPrepare daily performance and tracking reports in a timely manner\nEnter all critical and relevant information into the system for appropriate follow-up and documentation\nEscalate appropriate concerns or risks for review and/or follow-up.\nTo take on the role of Care Coordinator, you must:\nHave customer service experience\nHave computer skills\nDemonstrate excellent telephone etiquette\nBe able to remain calm in stressful situations\nBe able to empathize with the complexity and difficulty of each client or field staff situation\nBe a detail-oriented, adaptable and customer-focused team player\nCombine strong interpersonal skills with analytical problem-solving abilities\nBe self-directed, goal-oriented and able to manage time and priorities\nPossess medical knowledge or a medical background, and supervisory skills will be considered assets\nAbout CBI Health Group\n\nCBI Health Group is Canada’s largest provider of integrated community healthcare. For over 40 years, we have remained totally committed to improving the health and enriching the lives of Canadians.\n\nWhat sets us apart is our ability to work as a unified network dedicated to the ongoing learning that allows us to foster best practices, improve access to care and create better results for our patients. We organize our teams and services to ensure the right professionals and caregivers provide the right service, at the right time, in the right place.\n\nIn over 250 facilities, our services are provided by a dedicated team of more than 11,000 administrators, support staff and caregivers that include physiotherapists, occupational therapists, registered massage therapists, kinesiologists, chiropractors, speech-language pathologists, psychologists, physicians, nurses, dietitians and behaviour therapists.\n\nThe CBI group of companies includes CBI Health Centres, CBI Home Health, We Care Home Health Services, Monarch House, CBI Workplace Solutions, and CBI Assessment Services. Our expanding transitional and residential community care network now numbers more than 60 homes nationwide.\n\nAt CBI, our people really care and believe that by working together, we can aim higher and make great things happen every day.\n\nFacebook: facebook.com/cbihealthgroup | Twitter: twitter.com/cbihealthgroup | www.cbi.ca\n\nCBI Health Group is committed to accommodating people with disabilities as part of our hiring process. If you have special requirements, please advise Human Resources during the recruitment and selection process.\nSeniority Level\nEntry level\nIndustry\nInformation Technology & Services Non-profit Organization Management Staffing & Recruiting\nEmployment Type\nFull-time\nJob Functions\nOther", "Volunteer Board Member - KARA Family Resource Centre": "Board of Directors Volunteer Opportunity\n\nOUR MISSION\nPromoting healthy development of children by empowering families.\n\nOUR GOALS\nTo provide a safe environment and programming that enhances self-esteem and independence through education, role modeling, and hands-on learning opportunities.\n\nROLE PROFILE\nAs a member of the board of directors for KARA Family Resource Centre, you are an advocate for a dynamic grassroots organization in the Edmonton community. You will work collaboratively with fellow board members, community partners and KARA Family Resource Centre staff to promote KARA Family Resource Centre’s mission & goals and the programs and services that are offered.\n\nCOMMITMENT\n2 years term, 2+4 hours/month.\n\nRESPONSIBILITIES: KEY TASKS/ACTIVITIES\nAttend monthly board meetings & annual general meetings.\nAttend fundraising events that are held by KARA Family Resource Centre.\nAssist committee chairs and members as needed.\nWork collaboratively with fellow board members & partners in the community.\nBe knowledgeable about KARA Family Resource Centre’s policies, programs & services.\nAct as a spokesperson & community liaison for KARA Family Resource Centre when required.\nPromote KARA Family Resource Centre positively within our community.\nActively seek opportunities to partner and build strategic alliances/partnerships.\n\n\nBenefits To Volunteering\nShare your expertise and skills as a leader.\nMeet new people.\nLearn new skills.\nGain new insights and experience.\nContribute to the well being of your community.\n\n\nPreferred Skills & Qualities\nHave prior board experience (preferred, but not required).\nPossess strong leadership skills.\nPossess strong communications skills.\nPossess strong networking skills.\nStrategic, long-term planner.\nHave experience in one or more of the following areas: marketing, communications, social work, planning special events.\n\nTRAINING\nYou will be trained by fellow board members.\nYou will have the opportunity to attend training sessions that are offered for board members by various organizations in Edmonton.\n\n\nRequirements\nChild Intervention Record Check.\nEdmonton Police Services Information Check.\nResume\nApplication form to be filled out when an interview is set.\n\nContact Information\n\nBadriea Taha -Volunteer & Special Events Coordinator\n\nPhone:780-478-5396 Direct Line:587-525-7430 Fax:780-478-1979\n\nEmail: badriea@kara-frc.ca\n\nFor more information visit: http://www.kara-frc.ca.\nIndustry\nNon-profit Organization Management\nEmployment Type\nVolunteer\nJob Functions\nManagement Consulting Strategy/Planning", "Quality Engineer 2": "Title: Quality Assurance Engineer II (Backend)\nLocation: Calgary, AB\n\nTrimble Oil and Gas Services\n\nThe Oil and Gas Business Unit of Trimble Transportation exists to make the roads safer, greener and better for the Energy market. Our employees bring this to life through imagination, teamwork and a true passion to disrupt the status quo and drive the future of the industry. By using innovative thinking and technology, we create software solutions that protect workers on-site and the public at large We share a relentless ambition to find new ways to improve a company’s bottom line while making the world a greener place. Join some of the most brilliant minds in the Oil and Gas field, working together, to make a difference for our customers and the communities we serve.\n\nResponsibilities\nResponsible for all aspects of testing from identifying scope and scenarios to executing end-to-end testing\nWork with the project team to prioritize Quality Assurance tasks required for the release of a project\nHelp drive backlog grooming and flesh out acceptance criteria\nDemonstrate an understanding of high-level project objectives\nWrite new test cases in accordance with QA test case standards\nAssist in troubleshooting escalations and informing the team of possible impact/priority\nRun functional, regression and user acceptance tests on multiple products and/or platforms\nComfortable with setting up hardware, wiring at the bench, lab or vehicle\nHelp design and maintain lab fixtures and test harnesses\nChampion creative solutions within the QA team\n\nRequired Skill\n3+ years of Quality Assurance experience\nUniversity or Technical college education or equivalent\nProficient at grasping the “big picture” and understanding customers’ needs\nDefect management tools (preferably JIRA)\nPlanning, writing and executing test cases\nTest Case Management tools (preferably qTest)\nAPI Testing\n\nPreferred Skill\nAbility to design and run complex SQL queries\nScripting languages such as Python or Javascript\nPrevious experience in the Oil & Gas or Transportation industry\nExperience working in an Agile/Scrum team\nWillingness and ability to learn new tools and skills and apply them\nAttention to detail and results-oriented\nAbility to listen effectively, understand a situation and respond with clarity and professionalism\nBe a team player!\n\nTrimble Inc. is proud to be an Equal Opportunity and Affirmative Action Employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, national origin, marital status, disability, sexual orientation, status as a covered veteran in accordance with applicable federal, state and local laws, or any other protected factor. EOE/M/F/V/D\n#engineering\nIndustry\nElectrical & Electronic Manufacturing\nEmployment Type\nFull-time\nJob Functions\nEngineering", "Regulatory Analyst, Market Oversight": "Our organization:\n  The Alberta Securities Commission is the industry-funded regulator responsible for administering the province's securities laws. It is entrusted with fostering a fair and efficient capital market in Alberta and with protecting investors. As a member of the Canadian Securities Administrators, the ASC works to improve, coordinate and harmonize the regulation of Canada's capital markets.\n  The Market Regulation division oversees the equity and derivative marketplaces, registrants (dealers, advisers, and investment fund managers), and industry self-regulatory organizations. With a dynamic team of investment and financial professionals, we are involved in leading-edge projects aimed at balancing effective regulation with our stakeholders’ need for innovation and efficient capital markets.\n  The opportunity:\n  We are looking to add to our team an industry professional who wants to make a lasting impact on Alberta’s capital market by proactively identifying and analyzing risks and developing regulatory solutions to address them. This individual will form part of a team of market oversight professionals who oversee entities subject to regulation in Alberta, work closely with other regulators across Canada, and communicate ideas and recommendations directly to ASC executive management.\n  Key responsibilities include:\n  ·         Conducting oversight and compliance activities for equities and derivatives exchanges and other marketplaces subject to regulation in Alberta.\n·         Performing oversight reviews of regulated entities, including: conducting annual risk assessments; planning and executing on-site examinations; reviewing subsequent findings with the entities’ senior management; and preparing reports of, and presenting findings to, ASC executive management.\n·         Assessing the impact of existing and emerging risks in the capital market on regulated exchanges and other marketplaces and developing oversight programs to mitigate those risks.\n·         Analyzing and making recommendations on proposed amendments to rules and policies of regulated exchanges and other marketplaces.\n·         Reporting on the results of oversight activities to ASC executive management.\n·         Representing the ASC on CSA committees, advancing its views and objectives on oversight matters in respect of regulated entities.\n·         Participating in various short- and long-term projects in support of divisional, operational and strategic initiatives.\n  The ideal candidate will possess:\n  ·         A minimum of five years of experience in roles of increasing responsibility conducting audits and examinations, preferably in public practice.\n·         A university degree in business, finance, economics or a related discipline and a CPA, CA designation.\n·         Exceptional research and analytical skills, incorporating attention to detail, and the ability to think critically and creatively.\n·         Strong communication and presentation skills, with the ability to tailor messages to their audiences, both verbally and in writing.\n·         Strong interpersonal skills with the ability to interact with personnel at various levels of an organization.\n·         The proven ability to meet tight deadlines and manage multiple priorities in a changing environment.\n·         Experience with business process reviews, internal controls testing and IT general controls would be an asset.\n·         An understanding of Alberta’s capital markets, including Alberta and North American power, gas and/or crude markets would be an asset.\n·         A working knowledge of Alberta’s capital markets with exposure to regulation, compliance and marketplace and exchange operations would be preferred.\n  To apply please contact: \n\nDanielle Heartz\nRecruitment Consultant\n4034528733 x106\ndheartz@horizonrecruitment.com", "Représentant - Mise en marché commerciale, Fort McMurray": "JTI-Macdonald est l’une des plus anciennes entreprises du Canada ses origines remontent à 1858. Elle est une filiale d’un chef de file mondial dans l’industrie des produits du tabac. À titre de membre du Groupe de sociétés Japan Tobacco, nous détenons des marques de renommée mondiale, dont la deuxième marque de cigarettes au monde. Nous fabriquons également des produits du tabac à chauffer et travaillons dans l’une des industries les plus exigeantes du marché actuel des biens de consommation courante.\n\nNotre entreprise, dont le siège social est situé à Genève, en Suisse, est présente dans plus de 120 pays et emploie plus de 40 000 personnes dans le monde. Nous avons récemment reçu le titre Top Employer à l’échelle mondiale pour la quatrième année consécutive, en plus d’occuper le premier rang des Top Employers en Europe, en Asie et en Amérique du Nord, le deuxième en Afrique et le troisième au Moyen-Orient. Ces récompenses soulignent la reconnaissance de notre stratégie exceptionnelle de gestion des talents, de notre culture dynamique et de notre engagement envers l’apprentissage et le perfectionnement.\n\nLes facteurs qui nous distinguent sont les suivants notre passion pour les gens, notre culture d’intégrité et de respect, nos exigences élevées en matière de rendement, et notre volonté d’amélioration continue dans toutes nos activités. Ces attributs créent une vaste gamme de possibilités d’avancement à l’échelle mondiale. Pour en savoir plus, visitez le site www.jti.com.\n\nVisée du poste\n\nLe représentant - Ventes joue un rôle de premier plan dans le développement de la part de marché et du volume de JTI-Macdonald dans son territoire, en exécutant des programmes commerciaux, en optimisant la répartition des produits, ainsi qu'en assurant une qualité et une fraîcheur optimales des produits, la distribution des marques de base et les niveaux des stocks, sans oublier la collecte précise et en temps opportun des données concernant les magasins. Il est également responsable du respect de la convention de vente au détail et des sommes allouées dans le budget pour les frais de gestion.\n\nResponsabilités\nOptimiser la distribution des produits, les niveaux des stocks de produits, l'attribution de l'espace, ainsi que l'établissement de prix justes et concurrentiels dans les points de vente au détail, en gros et libre-service de son territoire prédéfini.\nAssurer la bonne gestion de son territoire en ce qui a trait aux rapports de données, aux budgets des programmes commerciaux, au compte de dépenses hebdomadaires, à l’inventaire de véhicules, aux outils et à l’entretien des véhicules d’entreprise.\nNégocier des contrats indépendants de vente au détail, ainsi que maintenir et surveiller la conformité pour les comptes clés ciblés qui répondent aux critères établis par la direction régionale, tout en respectant le budget alloué et en gardant à jour les renseignements sur le compte.\nMettre en place les programmes relatifs à la vente au détail et lancer les produits de la manière indiquée, afin d’optimiser les résultats et le rendement du capital investi, tout en respectant les sommes qui leur ont été allouées dans le budget et en veillant à une exécution rapide et efficace.\nApprendre à nos clients la manière de vendre les produits de JTI-MC au public grâce à la communication appropriée des attributs de la marque et à l'utilisation d'outils d'aide à la commercialisation élaborés par le groupe Ventes et Marketing, et mettre en œuvre tous les projets liés à la vente au détail qui lui sont attribués par le directeur de district - Ventes.\nVérifier la conformité de toutes les ententes de chaînes régionales et nationales qui s’appliquent à son territoire, et établir des rapports à cet égard.\nS'entretenir régulièrement avec les clients de vente au détail et de gros au sujet des tendances de leur entreprise et de l'industrie dans son ensemble, et assurer la communication des activités concurrentielles de façon efficace et en temps opportun.\nProjeter une image professionnelle, établir et maintenir de bonnes relations d’affaires avec tous les clients, conformément aux directives de la Politique d’entreprise et du code de conduite de JTI.\n\nQualifications Et Expérience\nFormation postsecondaire.\nAptitudes exceptionnelles à la communication.\nVolonté de participer au processus de prise de décisions avec les dirigeants régionaux.\nAptitudes marquées pour la négociation.\nPermis de conduire valide (une voiture de fonction – véhicule de l'entreprise – sera fournie).\nCapacité de travailler efficacement et d'offrir un bon rendement avec peu de supervision.\nConnaissances en planification financière et en gestion du temps.\n\nHabiletés, compétences & langues\nExcellente connaissance pratique des produits Microsoft Office.\nExpérience de vente requise\n\nComplément d’information\n\nJTI-Macdonald s’engage à assurer l’équité en matière d’emploi. Des mesures d’adaptation sont offertes durant le processus de recrutement, sur demande, aux candidats souffrant d’un handicap.\n\nNous acceptons les références internes, conformément à la politique.\n\nNous remercions tous les candidats de leur intérêt, mais nous communiquerons uniquement avec les candidats retenus pour une entrevue.\nSeniority Level\nEntry level\nIndustry\nConsumer Goods Food & Beverages Tobacco\nEmployment Type\nFull-time\nJob Functions\nSales Business Development", "Senior Manager, PMO": "Description\n\nXylem |ˈzīləm|\n\nThe tissue in plants that brings water upward from the roots;\na leading global water technology company.\n\nWe’re a global team unified in a common purpose: creating advanced technology solutions to the world’s water challenges. Developing new technologies that will improve the way water is used, conserved, and re-used in the future is central to our work. Our products and services move, treat, analyze, monitor and return water to the environment, in public utility, industrial, residential and commercial building services settings. Xylem also provides a leading portfolio of smart metering, network technologies and advanced analytics solutions for water, electric and gas utilities. In more than 150 countries, we have strong, long-standing relationships with customers who know us for our powerful combination of leading product brands and applications expertise with a strong focus on developing comprehensive, sustainable solutions. For more information, please visit us at www.xylem.com\n\nIf you are excited and passionate about helping us solve water, we want to hear from you!\n\nEnergy resources are crucial to the economy and individual communities. PureHM provides solutions for regulated inspections of the pipelines that deliver these energy products. Using these solutions, we give pipeline companies confidence that they are delivering their products as safely and efficiently as possible. Using our best-in-class technologies, we provide operators with the actionable information needed to identify problem areas, reduce unnecessary pipeline repairs, and prolong asset life. Ultimately, we help you ensure that energy pipelines are fit for service.\n\nWe give pipeline operators confidence that they are delivering energy safely by offering the highest quality service and inspection data to make integrity decisions.\n\nEssential Duties/Principal Responsibilities\n\nCoaching, Training, Management, and Mentoring Centric\nCoach the project managers in the practices of good project management based upon the individual project manager assignments and needs.\nDevelop and seek senior management guidance and approval for a continuous training program for the project managers within PureHM.\nSeek contractors to provide training for the PureHM project management community. Tracking vendor performance through the management and administration of workshop feedback.\nDevelop and maintain positive and collaborative relationships with stakeholders across all business lines at PureHM.\nDevelop, in collaboration with the project managers, a balanced scorecard to report on Key Project Management Performance Indicators (KPMPIs) and implement monthly reporting on these indicators in support of good project management practices at PureHM.\nManagement the performance of the project management team including coaching, performance evaluation, coaching recommendations, training recommendations, and discipline as required.\nMentor any individuals interested in project management role opportunities on behalf of the senior management team at PureHM.\nReporting Centric\nLead the identification, development, and implementation of Key Project Performance Indicators (KPPIs). This can include the development of KPPI dashboard reporting in support of the senior management team.\nReport regularly to senior management on KPPIs in support of good operational business management.\nLead the identification, development, and implementation of Key Project Management Performance Indicators (KPMPIs).\nReport regularly to senior management on KPMPIs in support of good project management within the organization.\n\nProject Controls Centric\nLead the identification of project controls reporting in accordance with the KPPIs and KPMPIs established by the PMO\nSupport the project controls lead in ensuring reporting timelines and quality is met\nEnsure consistent approaches to the development of corporate performance metrics that are compliant to GAAP as well as PureHM accounting policies\nSupport the project controls lead in good performance management of the project controls team\n\nProcess Centric\nLead the organization in the identification of process improvement or process reengineering opportunities including the development and improvement of those new business processes.\nCollaborate with senior management in the decision-making process concerning process changes including the identification of budget and human resources impacts.\nAs directed, map and document any new or revised business processes.\nImplement the new business processes following the principles of change management including appropriate communications and support in the implementation of any new or revised processes.\n\nTools, Templates, and Techniques Centric\nLead the organization in the continuous improvement of any and all tools and templates used in the management of projects at PureHM.\nIdentify any tools gaps and present any options for improvement to the senior management team for consideration.\nBased upon senior management approval, negotiate for the development or improvement of tools used in the management of projects. This can include, but is not limited to;\nThe identification of potential tools,\nManaging vendor presentations,\nNegotiating for appropriate costs of software and costs of customization\nManaging vendor contracts for development, customization, and implementation\nEnsuring staff are appropriately training in the use of any newly developed or customized tools\nResearch best practices in project management techniques and identify them for consideration by the senior management team.\nBased upon approval, inform, train, and implement new project management techniques within the project management team.\nDevelop and supervise the project management team including project assignment and performance management.\n\nMinimum Qualifications: Education, Experience, Skills, Abilities, License/Certification:\nExperience in the development of, or as part of a mature Project Management Office (PMO) would be viewed as an asset\nBusiness process development and business process improvement experience\nExperience with training development and delivery and training contractor management would be considered an asset\nPeople oriented with an ability to establish a high degree of credibility with all stakeholders to the PMO\nStrong leadership, relationship development and management, and collaboration skills\nStrong written and verbal communications skills\nProven team-building skills and critical thinking skills\nUndergraduate degree in Engineering, Commerce, Economics or Business is mandatory\nMinimum of ten years of documented project management experience in a related industry or marketplace\nPMP™ preferred, but not necessary. It is expected that the individual will achieve PMP certification within 1 year of hiring into this position\nMinimum 5 years’ experience in the management of teams and the administration of their performance management\nExperience in the development of budgets and forecasts, KPI-like reporting, and the development of performance metrics\nExperience in the implementation and management of change in a high-performance environment\n\nTravel Requirements\nUp to 25% travel time required\nSeniority Level\nMid-Senior level\nIndustry\nUtilities Electrical & Electronic Manufacturing Mechanical Or Industrial Engineering\nEmployment Type\nFull-time\nJob Functions\nProject Management Information Technology", "Senior Instrumentation and Controls Engineer": "Posted by\nRondall Brasher\nTalent Acquisition Advisor at EXP\nJob Description\n\nAt EXP, we know that great experiences start with the right people. We believe that work should be challenging, and the challenge should be fun. We also believe that exponential possibilities are more likely to occur with a respectful, satisfying and empowering company. We value and respect our employees - their experience and expertise as well as their energy, passion and diversity - and their innovative approach to work and to life.\n\nYour Challenge\nTranslate design sketches, layouts, and notes into finished CAD construction drawings.\nPrepare drawings, diagrams and sketches of special items for use by drafting personnel.\nReview and check detailed drawings and layouts.\nWrite I&E design project scope of work.\nComplete walk downs and estimates for projects.\nPerform all other duties as assigned.\n\n\nThe Skills And Knowledge You Bring\n15-20 years of I&C and Electrical Design experience with the refining and/or petrochemical industry.\nStrong understanding of instrumentation and electrical controls.\nGood to Strong AutoCAD Skills & SPI\nExperienced with Microsoft Office software, Adobe software\nExperience in Delta V (M-Series / S-Series). Traditional I/O, Remote I/O and Charms\nExperienced with design drawings: P&IDs, Plan Drawings, Installation Details, I&C & Electrical Specific Drawings: Loops, One Lines/Three Lines, Wiring Diagrams; Schematics, conduit and cable tray layouts, pressure, temperature, flow, density, and other instrumentation, instrument loops, PLC and DCS.\nAble and experienced with walking down proposed installations in industrial facilities. (Both new and retro-fit)\nExperience with I/O detail wiring and termination\nExperience specifying instruments and creating instrument data sheets\nOutdoor design experience, able to wear required PPE and drive safely to job-site for field measurement, verification and as-built of drawings\nStrong language skills (written and oral)\nPossess strong computer skills, especially in Excel and Word\nPossess excellent organizational and time management skills\nAbility to thrive in a team working environment\nStrong interpersonal skills\n\n\nAbout Us\n\nWhat EXP Can Offer\n\nWith a mission to understand, innovate, partner and deliver, EXP provides engineering, architecture, design and consulting services to the world’s built and natural environments.\n\nOur heritage dates back to 1906, when the earliest of EXP’s predecessor companies started its engineering infrastructure practice. Today, over 3,000 creative EXP professionals across North America provide the passion and expertise needed to deliver successful projects around the world.\n\nOur promise is to offer you a challenging career in a positive and dynamic work environment, and it is a promise we take seriously.\n\nJoin a dynamic team at EXP that provides you with innovative projects, the capacity to develop your career, a full range of benefits, flexible working hours, and much more! When you explore what EXP has to offer, you’ll find exponential possibilities.\n\nFor more information, visit www.exp.com .\nOrganization\n\nEXP is proud to be an Equal Opportunity Employer who fully and actively supports equal access for all people regardless of Race, Color, Religion, Gender, Age, National Origin, Veteran Status, Disability, Genetic Information or Testing, Family and Medical Leave, Sexual Orientation and Gender Identity or Expression.\n\nShould you need any special accommodations, please feel free to contact us at hrsupport@exp.com and we will arrange for the most suitable accommodations based on your needs.\n\nFor all applicants within the United States, EXP ensures nondiscrimination in all programs and activities in accordance with Title VI of the Civil Rights Act of 1964.\n\nSeniority Level\nAssociate\nIndustry\nArchitecture & Planning Civil Engineering Oil & Energy\nEmployment Type\nFull-time\nJob Functions\nEngineering Information Technology", "BioWare: Technical Director": "At BioWare, our mission is to create worlds of adventure, conflict, and companionship that inspire you to become the hero of your story. Our teams drive innovation using cutting-edge tech and tools such as the Frostbite engine and collaborate with thousands of world-class developers across EA’s network of studios. We are passionate about games and their potential as a creative medium to reach and inspire people through emotion, artistry, and engaging storytelling. If you share this passion, this is an amazing opportunity to help shape the next generation of gaming.\n\nWhat The Franchise Technical Director Will Do At BioWare\n\nYou will be the most senior engineering lead on the next major title in one of BioWare’s most prestigious franchises, and a contributing leader to BioWare studio strategy. You will partner with the other disciplines to build the technology and the programming team to deliver amazing player experiences.\n\nWho You Are\n\nYou have shipped multiple video game titles and have a thorough understanding of game development through all phases. You are a highly collaborative leader who can build a technical vision, as well as build and inspire the programming team to achieve it. You want to help us deliver industry-leading games.\n\nResponsibilities\nCollaborate creatively with all disciplines to deliver technology fulfilling the creative vision.\nRecruit and develop the best programming talent in the industry.\nPartner with leaders across BW and EA to leverage and improve common technical strategy.\n\nRequirements\nExperience developing, debugging and optimizing AAA multiplayer games on PC or console.\nHands-on experience with multiple game domains (e.g. AI, Rendering, Tools, Online, Animation…)\n5+ years of professional multi-platform C++ experience and a solid understanding of software design principles.\nBachelor's degree in Computer Science, or equivalent training and professional experience.\nWhat’s in it for you? Glad you asked!\n\nWe are proud of the great perks we offer like comprehensive health and benefit packages, tuition reimbursement, pension with company match and, of course, free video games. And since we realize it takes world-class people to make world-class games, we offer competitive compensation packages and a culture that thrives on creativity and individuality. Health, Dental, Financial offered (ESPP and RRSP matching); Bonus and relocation assistance also offered.\n\nMore about our location: http://careers.ea.com/our-locations/edmonton\nIndustry\nComputer Games Information Technology & Services Computer Software\nEmployment Type\nFull-time\nJob Functions\nInformation Technology", "Pipeline Construction Manager": "Posted by\nRyan Couston\nEngineering, Architecture & Design | Calgary, Vancouver & Seattle\npartner staffing is the “go to recruiter” for difficult, important, and time sensitive positions in Western Canada. We work with proactive clients who understand the importance of having exceptional staff.\nPartner Staffing is currently working to find a talented Construction Manager with direct field experience with large pipeline construction projects. Since the role is remote, you can be located in either British Columbia or Alberta.\nOur client is an international construction company that works on large projects throughout North America.\n  The Opportunity:\nIn the execution of this role, you will be the technical resource for the construction team onsite along a pipeline spread, making sure the work complies with all construction standards, codes, specs and disciplines. This is a new role that will be working on a large, multi-year long, high profile project.\n\nKey Responsibilities:\nResponsible for project budget and scheduling\nSupervise construction operations\nDevelop solutions to unforeseen construction issues\nMaintain safety standards throughout pipeline construction\nLiaise with all clients, subcontractors, stakeholders and other 3rd parties\nManage construction crew, performing reviews and training as needed\n\nMUST HAVES\n15+ years experience in construction management\nExposure to new pipeline construction projects with diameters greater than 36”\nEngineering Degree is an asset\nStrong computer skills\nHistory of building, maintaining and motivating teams\nConstruction document literacy\nAbility to be on-site full time\n  partner staffing is Bringing Talent to Business. With an experienced and dedicated recruitment team, we open doors to opportunities that you may not otherwise know about. We are specialists in the field of providing high quality individuals to Admin, Accounting, Engineering, IT, and Health Care departments. We look forward to hearing from you and discussing how we might be able to promote your career!\nWe are always interested in your referrals and appreciate your business. Please apply directly on our website under the ‘Current Postings’ tab. While all resumes will be considered only those that meet all the criteria will be contacted.\nSeniority Level\nMid-Senior level\nIndustry\nOil & Energy Construction Mechanical Or Industrial Engineering\nEmployment Type\nFull-time\nJob Functions\nProject Management Consulting Management", "Project Coordinator": "Position Overview\nThe Project Coordinator will provide administrative and engineering support on construction projects. Performing duties such as, tracking schedules, productivity reports, and following up on health and safety concerns. This position is based in Calgary, Alberta supporting Aecon's Civil West - Transportation Division.\n\nKey Responsibilities\nAssists in planning, scheduling and executing construction activities including supervision of crews and equipment\nFollow up and assist with implementing corrective action for safety environment, quality, and productivity related issues\nCoordinates delivery of construction materials ensuring timeliness and accuracy of purchase orders\nMaintains plans, specifications, cost/materials estimate, and subcontracts\nEnsures project cost requirements are met and coding procedures are followed\nAssists the Project Superintendent to develop and maintain relationships with owners, consultants and subcontractors.\nProvides technical assistance to Field Superintendents\nAssist in planning, scheduling, and executing construction activities\nProcesses time sheets for payroll and cost control purposes\nPrepare short interval control sheets\nMaintains job diaries, site photos and proper claims documentation\nMay be required to assist in supervision of work crews, contractors, sub-contractors, quality personnel, and surveyors, etc.\nProvide technical assistance, investigation and follow up for Project Managers\nSuch other duties and responsibilities as assigned by his/her Supervisor\n\nRequired Knowledge & Skills\nEngineering Degree or Technical Diploma / or equivalent training and experience\n3 to 5 years’ experience in construction\nExperience with asphalt paving, bridges, and under ground\nCapable of reading and understanding construction drawings and documents\nAdvanced Computer skills in MS Office (Outlook, Excel, Word, PowerPoint, etc.)\nThorough knowledge of the applicable OH&S legislation\nExceptional ability to multitask in a dynamic and fast-paced environment\nStrong interpersonal, leadership and communication skills\nStrong work ethic and positive team attitude\nAttention to detail and a high degree of accuracy\nValid driver’s license\nAbility to work the project schedule which may include overtime, weekends and/or night shift\n\nEmployment Status Permanent\n\nCompensation & Benefits Overview\n\nAecon offers the opportunity to work on challenging, high profile projects and provides competitive compensation and benefits.\n\nEquity Statement\nAecon is an equal opportunity employer.\n\nAccessibility\nAecon accommodates. Upon request, Aecon accommodates candidates with disabilities throughout the hiring process.\nSeniority Level\nEntry level\nIndustry\nConstruction Oil & Energy Financial Services\nEmployment Type\nFull-time\nJob Functions\nOther", "Full Stack Developer, AppDevices": "Posted by\nElyse Gentry\nSenior Recruiter at AppDirect\nAbout The Team\n\nAppDirect is the leading cloud service marketplace company dedicated to revolutionizing the way businesses run. We offer a cloud service marketplace and management platform that enables companies to distribute digital services. The global network of AppDirect-powered marketplaces allows businesses to find, buy, and manage the best applications the cloud has to offer.\n\nWith our award-winning platform, service providers can launch a state-of-the-art online application store within a matter of weeks, while developers can integrate once and make their software available across multiple marketplaces worldwide. Our products offer more advanced features and tools than any other competitive solution, putting AppDirect at the forefront of the rapidly evolving market for cloud services delivery.\n\nThe AppDirect Devices Team is a nimble, adaptive and independent engineering development team that is continuously improving our core products, building integrations, and developing new products.\n\nHow you’ll make an impact and what you’ll do:\n\nAs a Full Stack Engineer, you will help build and architect the AppDirect platform. The right person is comfortable with complex requirements and breaking them down into manageable tasks, diving into stories and requirements driven by product managers, and being able to deliver quality on both backend and frontend applications. Your background should include experience with project management on a technical team, building data-heavy UI with real-time updates, work on REST API standards, and delivery of on-time projects. Your work should demonstrate care, attention to detail, independent decision-making, and high-level strategic thinking.\n\nYour Responsibilities Here Will Include\n\n\nWorking up and down the stack\nDesign and enhance features on all pieces of the platform\nCollaborative working with multiple teams of engineers\nApplying standards, process, and architectural improvements\nApply high standards for performance, efficiency, testing, and scaling\n\n\nWhat You’ll Need\n2+ years of working experience with Javascript, HTML, CSS, NodeJS, and comfort taking on the challenges of building a complex application that utilizes microservices extensively.\nExperience working in small but growing engineering teams and are ready to make an immediate impact on the performance and stability of the platform.\nExperience and comfort in collaborative working.\nDemonstrated community engagement is a plus.\nDetail-oriented and analytical approach to software engineering, and are not afraid to make architectural decisions.\nExperience with REACT, or similar, Redux. GoLang, and Python are a plus.\n\nAppDirect is the only end-to-end commerce platform for selling, distributing, and managing cloud-based products and services to succeed in the digital economy. The AppDirect ecosystem connects channels, developers, and customers through its platform to simplify the digital supply chain by enabling the onboarding and sale of products with third-party services, for any channel, on any device, with support. Powering millions of cloud subscriptions worldwide, AppDirect helps organizations, including Jaguar Land Rover, Comcast, ADP, and Deutsche Telekom connect their customers to the solutions they need to reach their full potential in the digital economy.\n\nWe believe that the unique contributions of all AppDirectors is the driver of our success. To make sure our culture continues to incorporate everyone's perspectives and experience, we never discriminate on the basis of race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status.\n\nAt AppDirect we take privacy very seriously. For more information about our use and handling of personal data from job applicants, please read our Candidate Privacy Policy. For more information of our general privacy practices, please see AppDirect Privacy Notice: link: https://www.appdirect.com/about/privacy-notice\n\nSeniority Level\nEntry level\nIndustry\nInternet\nEmployment Type\nFull-time\nJob Functions\nEngineering Information Technology", "Receptionist(Casual)": "Find meaningful work with seniors\n\nEnjoy working on a high-performance team while making a difference in the lives of independent seniors.\n\nChoose to work at one of our many communities across Calgary.\n\nBenefit from flexible hours, healthcare coverage and a pension plan.\n\nSilvera employees create positive impact every day. Together, we serve people who make their home with us, including in our supportive living communities, which provide meals, housekeeping and Active Aging programs.\n\nOur workforce is diverse, and there are opportunities in dining, housekeeping, maintenance and administration. We celebrate each other through training, recognition and opportunities for growth. We offer flexible full-time, part-time and casual hours.\n\nSilvera. More than 55 years of non-profit service to Calgarians. Home to more than 1,450 residents. Live your best life with us by building a meaningful career.\n\nWe currently have casual opportunities for Receptionist across our communities in Calgary. Reporting to the Administrative Coordinator, the Receptionist is responsible to ensure the efficient day-to-day operation of the reception area, and support the work of management and other staff. Serves as an ambassador for Silvera and our seniors by providing excellence in administrative support. Full time hours available for the duration of the state of emergency. Great for College and University Students.\n\nResponsibilities\nServes residents, visitors, and families, by greeting, welcoming, and directing them appropriately in a professional and friendly manner.\nProvides support to the Administrative Coordinator and completing the accounting for residents as per Silvera Process, Procedure, and Policy, including associated paperwork and follow-up.\nEnter maintenance requests or repairs into Info Tracker, Responds to all emergency situations including associated follow-up paperwork, Provide tours to visitors and potential residents , Answer, screen, and forward any incoming phone calls while providing basic accurate information with a professional and courteous manner, Receives and sort daily mail including deliveries from couriers and prepares the mailbag.\nMaintains security of the community by following procedures and controlling access to the building. (monitor security camera’s, visitor logbook) and Perform other clerical tasks such as filing, photocopying, collating, faxing, etc. Communicates all resident issues and concerns to the Administrative Coordinator or Community Manager.\nWorks to support Silvera’s service vision and goals; assuring consistent quality in administration duties across Silvera communities.\nSupport management in ensuring all Supportive Living Accommodation Licensing Act standards related are adhered to.\nPrepares and sends outgoing faxes, mail, and courier parcels, Forwards voice-mail from the general mailbox to the appropriate staff member. To assist Community Management in the Outbreak Response Program by ensuring compliance with Silvera’s Outbreak Guidelines and the Alberta Health Services Outbreak protocols.\nParticipates and promotes the Health and Safety Program and attends other committees as requested. Perform other tasks as assigned\nQualifications\nCompletion of Grade 12 Diploma or a GED.\nA minimum of two (2) years’ receptionist or administration experience.\nProficient with Microsoft Office products (Excel, Outlook & PowerPoint)\nExcellent customer service skills and the ability to relate to seniors. Strong communication skills – both written and oral.\nThe ability to work independently with minimal supervision. Must possess a flexible, willing and positive attitude and be a team player.\nNeeds to be well organized and able to meet deadlines.\nFor further information on us, please visit our website: www.silvera.ca.\nWe thank all applicants; however, only those selected for an interview will be contacted.\n\nDue to the current high volume of applications, we will not be accepting phone calls about individual applications.\n\nAll pre-screen questions must be answered completed for an application to be processed.\n\nAll offers made are contingent upon a successful criminal record check.\nSeniority Level\nEntry level\nIndustry\nNon-profit Organization Management Government Administration Hospital & Health Care\nEmployment Type\nFull-time\nJob Functions\nAdministrative", "Material Handler": "During these challenging times, Federated Co-operatives Limited is working to serve our local co-ops, customers, and communities. We are committed to supporting our local co-ops and the communities they serve. Working together to provide essential services to communities across Western Canada, we are hiring Material Handlers on a casual basis at our Distribution Centre in Edmonton, Alberta.\n\nWho We Are\n\nAs a co-operative, we do business differently. We believe in working together to serve Western Canadians, delivering profits back to our communities and investing in sustainable growth. Our work is guided by our values of integrity, excellence and responsibility and driven by our vision of building sustainable communities together. To learn more about who we are, visit www.fcl.crs.\n\nWhat You’ll Do\nYou will fill, check and pack orders for shipment.\nAssist in handling incoming merchandise.\nAssist in housekeeping of merchandise.\nOther duties as assigned.\n\nWhy it matters\n\nWe help local Co-ops serve their communities by providing support and leadership to food, pharmacy, liquor and convenience stores, and by delivering quality products and exemplary customer service.\n\nWho You Are\n\nYou are looking for a career in Supply Chain and\nMust be in good health and physically fit.\nYou have a High school education (or equivalent).\nYou may be required to work shifts.\nYou’re honest and trustworthy, are results oriented and strive to be the best in what you do.\nYou believe in collaboration, building relationships and value the perspectives of others.\n\nOur Team Members receive competitive salaries, short-term incentives, a comprehensive benefits package and an employer-contributed pension plan. We encourage our Team Members to take advantage of learning opportunities, to grow and develop, and to foster a culture of teamwork and innovation.\n\nFCL embraces diversity and inclusion and we’re working to create a workplace that is as diverse as the communities we serve. We support and provide an environment that allows every person to bring their whole self to work.\n\nWe take the health and well-being of our team members and customers very seriously. We continue to take steps across all areas of our business and locations to keep our team members and customers safe and healthy.\n\nIf this opportunity speaks to you, we invite you to apply by April 15, 2020.\n\nWe thank all candidates for their interest, however only those selected to continue in the recruitment process will be contacted.\n\nPlease note you may be required to undergo a background and substance test in accordance with FCL policies.\nSeniority Level\nEntry level\nIndustry\nFood & Beverages Food Production Retail\nEmployment Type\nFull-time\nJob Functions\nManagement Manufacturing", "": ""}