{"Payroll and Benefits Specialist": "THE ORGANIZATION \n\nThe Flowr Corporation is a Toronto-headquartered cannabis company with operations in Canada, Europe, and Australia. Our Canadian operating campus, located in Kelowna, BC, includes a purpose-built, GMP-designed indoor cultivation facility; an outdoor and greenhouse cultivation site; and a state-of-the-art R&D facility that is currently under construction. From this campus, we produce recreational and medicinal products. Internationally, we intend to service the global medical cannabis market through our subsidiary Holigen, which has a license for cannabis cultivation in Portugal and will operate GMP-designed manufacturing facilities in Portugal and Australia.\n\nOur purpose is to Cultivate Better: People, Plants, Products. To this end, we aim to support improving outcomes through responsible cannabis use and, as established experts in cannabis cultivation, strive to be the brand of choice for consumers and patients seeking the highest-quality craftsmanship and product consistency across a portfolio of differentiated cannabis products. All of this can only be achieved through the hard work of our growing, passionate team, who share the core values of being Pioneers, Champions, and Students, in all that we do. Visit www.flowr.ca for more information. \n\nPOSITION SUMMARY\n\nFlowr is seeking an experienced Payroll and Benefits Specialist who will be responsible for the payroll function, benefits administration and other total compensation related functions for the organization across Canada. Reporting into our Director, People and Culture, the Payroll Specialist will partner closely with our controller, as well as our People and Culture team in order to ensure that all pay and benefits related matters are executed on time, in the most efficient and cost effective manner possible. The ideal candidate will have demonstrated the ability to lead the development of the payroll strategy with key internal and external stakeholders to ensure optimal efficiency and effectiveness. This role will be based in Kelowna, BC. \n\nCORE JOB DUTIES\n\n• Manage full-cycle payroll processing for 250-350 employees for a multi-province Canadian payroll (Hourly and Salaried) to ensure employees are paid accurately and timely.\n• Under direction from the People team, assist in creating and maintaining Flowr’s compensation framework, including a job evaluation system with appropriate levels, salary bands, pay equity and total rewards details.\n• Oversee and administer the benefits process, including benefits open enrollment, onboarding and related activities and communications. \n• Provide timely response to inquiries from managers, employees, government agencies and other third-party agencies.\n• Be responsible for ensuring all internal audit processes and procedures are in place to support payroll and data integrity. \n• Ensure consistency of practices and compliance with strategy, policies, standards and regulatory requirements.\n• Lead, organize, and be the point of contact for the implementation project of Flowr’s HR/payroll system - Ceridian Dayforce. Identify best practice opportunities, process gaps and system-enablement improvements. \n• Effectively utilize project management skills and cross-functional collaboration to lead projects and provide recommendations and reports to the People and Culture team and senior leadership as required.\n• Support the People and Culture team in headcount management.\n• Participate in various compensation surveys; providing appropriate compensation and wage information; stay current with industry trends and best practice through market research. \n• Other reasonable duties as may be required from time to time as directed by People and Culture team and the Finance team. \n\nJOB SKILLS & REQUIREMENTS \n\n• Payroll Compliance Certification (PCP) is required \n• Five or more years of progressive payroll experience in a multi-province payroll environment (particularly experience with Ontario and British Columbia) \n• In-depth knowledge of Canadian payroll legislation, Employment Standards, Taxation rules and year-end reporting processes, experience in British Columbia and Ontario payroll legislative requirements is essential.\n• Previous system conversion experience or other experience in leading significant payroll process changes is an asset. In-depth knowledge of Ceridian Dayforce preferred. \n• Strong attention to detail and proven ability to take initiative, make independent decisions, exercise sound judgment, develop creative solutions and meet deadlines.\n• Ability to maintain composure and handle multiple conflicting priorities in a fast-paced environment.\n• Excellent verbal and outstanding written communication skills, including excellent presentation, facilitation, influence, and listening skills, with strong expertise in communicating scientific information.\n• An individual with high integrity, creativity, and a roll-up your sleeves work ethic.\n\nTHE OPPORTUNITY \n\nThis is an exciting opportunity to join a promising industry with lots of room for career growth and advancement. Work alongside a skilled, professional and passionate team that genuinely intends to make a mark in this rapidly growing industry. This role has breadth offering the candidate great experience in a fast-paced environment.   \n\n\n\n\nThe Company is a committed equal opportunity employer. Flowr’s recruitment strategy is designed to attract the best person for each position, to ensure equality of opportunity for all applicants, and to promote our corporate vision and culture. When considering applicants for positions within our Company, only job-related criteria such as ability, merit and responsibility are used to evaluate applicants. Flowr prohibits discrimination or harassment on the basis of any characteristics protected by applicable law.\n\nThe Company is committed to treating all people in a way that allows them to maintain their dignity and independence. The Company believes in integration and equal opportunity. The Company is committed to meeting the needs of persons with disabilities in a timely manner and will do so by identifying barriers to accessibility, removing barriers to accessibility and meeting accessibility standards in accordance with applicable law.\nSeniority Level\nMid-Senior level\nIndustry\nPharmaceuticals\nEmployment Type\nFull-time\nJob Functions\nFinance Human Resources", "Merchandiser, Okanagan": "Job Description\n\nWe are currently recruiting for a passionate, dedicated and hardworking individual to fill our part-time Merchandiser position in Kelowna, BC.\n\nDaily Duties Include, But Are Not Limited To\n\nThe role of a Merchandiser is to provide sales support to the territory Sales Representative and ensure store level merchandising excellence in order to expand sales of Arterra Wines Canada premium wine portfolio from both a volume and market share perspective.\nBuild and merchandise impactful product displays, features, and racks in retail accounts\nWork with store partners to ensure proper rotation of back stock to retail floor, displays and shelf\nEnsure monthly sales are passed on by retailers and tagged at shelf and display\nApply shelf talkers, necktags and related value-added items to inventory at shelf and on display\nApply, maintain and replace impactful branded point of sale materials in partner stores. This includes backer cards, shelf talkers, case cards, posters, price cards, fridge clings etc.\nEnsure Arterra products are appropriately shelved, and maintain this positioning on an ongoing basis\nMaintain overall product and display appearance: dust-free, correctly priced on shelf and in cooler.\nTake photos of displays, competitor’s displays, competitors on packs, new products etc.\nMaintain consistent communication with the sales representative regarding changes in buyer preferences, out of stock inventory concerns/situations encountered, market intelligence and daily call summary\nComplete other special projects as required, including but not limited to trade events, trade shows, consumer tastings, seminars, maintenance of storage unit, staff training and store set ups.\nJob Requirements:\nBeverage Alcohol Industry experience and product knowledge an asset.\nWSET or ISG Certification an asset.\nExcellent communication, interpersonal and organizational skills.\nResults oriented, self-motivated, driven and disciplined.\nThe ability to work independently with minimal supervision\nProof of valid Driver’s License will be required.\nProvide your own vehicle with the proper insurance and driving record within DMV policy guidelines\nMust reside within, or in close proximity to the general area of the sales territory.\nMust be able to lift cases weighing up to 45 pounds on an ongoing, daily basis\nHow to Apply:\nTo apply please email your cover letter and resume to Jim Stansfield, Field Sales Manager at (jim.stansfield@arterracanada.com) or\n\nVisit our webpage and submit your online application. www.arterracanada.com/careers\nNumber of Openings: 1\nWe are committed to establishing a qualified workforce that reflects the diverse population it serves and we encourage applications from all qualified individuals. We are also committed to preventing and removing barriers to employment for people with disabilities, and we invite you to inform us should you have any accessibility or accommodation needs.", "Vocational Rehab Consultant": "Are you interested in being part of a team that helps people injured at work return to work safely? We're looking for knowledgeable, compassionate, and dedicated vocational rehabilitation professionals to work as key members of our case management team.\n\nWe have two-year temporary opportunities available in our Richmond and Kelowna offices. Please specify in your cover letter which locations(s) you prefer. Apply now for positions scheduled to start in June, 2020. We'll be reviewing applications weekly.\n\nYou'll assess the impact of workers' injuries on their employment potential and quality of life, and determine what vocational rehabilitation benefits they're entitled to. You'll also provide vocational counseling and create vocational rehabilitation and return-to-work plans.\n\nWe're Looking For People Who Can\nAssess employment barriers and provide vocational counseling to develop suitable return-to-work and vocational rehabilitation plans that may include work assessments, formal on-the-job training, job search and self-employment support, and job development activities\nUse sound judgment to weigh evidence, interpret policy, and apply discretion to determine eligibility and entitlement to vocational rehabilitation programs and services\nApply organizational and decision-making skills to manage a complex, high-volume caseload\nEstablish and maintain collaborative, professional relationships with various stakeholders, including injured workers, employers, and community health care providers\nAccurately manage rehabilitation expenditures\nMediate and negotiate effectively to help achieve positive outcomes\nThis position requires regular and punctual attendance.\nMeet one of our current vocational rehabilitation consultants to learn more about this job.\n\nYour Experience And Educational Background\nA bachelor's degree in a related discipline such as disability studies, vocational counseling, rehabilitation counseling, social work, physiotherapy, psychology, occupational therapy, or kinesiology\nFour years of directly related experience in vocational rehabilitation counseling, career or employment counseling, vocational evaluation, vocational rehabilitation planning, employability assessment, or rehabilitation management\nA relevant professional designation is preferred. This includes Certified Vocational Rehabilitation Professional (CVRP), Registered Rehabilitation Professional (RRP), Certified Rehabilitation Counsellor/Canadian Certified Rehabilitation Counsellor (CRC/CCRC), and Canadian Certified Vocational Evaluator (CCVE)\nAn understanding of disability management and return-to-work principles and practices and vocational or psycho-vocational tests in the context of vocational rehabilitation\nExperience working in a computerized work environment with common computer applications, such as Microsoft Word\nA valid driver's license and the ability to travel throughout the province and stay overnight is required\nWe'll consider an equivalent combination of education and experience.\n\nYour resume does not need to be limited to two pages and should provide details of all your work responsibilities for each position you've held. Please include the month and year you started and left each position and whether the position was full or part-time.\n\nYou must submit your application by 4:30pm on the closing date of the competition.\n\nIf you require an accommodation in the assessment process, please email the HR Testing Accommodation (SM) at the time you submit your application.\nWho are we?\nAt WorkSafeBC, we're dedicated to promoting safe and healthy workplaces across British Columbia. We partner with workers and employers to save lives and prevent injury, disease, and disability. When work-related injuries and diseases occur, we provide compensation, and support injured workers in their recovery, rehabilitation, and safe return to work. We also work diligently to sustain our workers compensation system for today and future generations. We're honoured to serve the 2.4 million workers and 245,000 registered employers in our province.\n\nWe recognize that our ability to make a difference relies on building a team with a rich variety of skills, knowledge, backgrounds, abilities, and experiences, and which reflects the diversity of the people we serve. We are committed to fostering a welcoming, inclusive, and supportive work culture where everyone can contribute as their best, authentic self. We encourage all qualified applicants to apply.\nWhat's it like to work at WorkSafeBC?\nIt's challenging, stimulating and hugely rewarding. Our positions offer tremendous diversity and excellent opportunities for professional growth. Every day, the work we do impacts people and changes lives. What we do is important and so are the people we do it for.\n\nOur Benefits\n\nBeing part of WorkSafeBC means being part of a strong, committed team. Along with a competitive salary starting at $78,447, your total compensation package includes vacation, optional leave arrangements, health care and dental benefits, and contributions toward your retirement pension. As a member of our team, you'll have access to services and benefits that can help you get the most out of work — and life. Learn more about what we offer .\n\nIf you're the successful applicant, we'll be making a conditional offer contingent upon your clearing a criminal record check under the Criminal Records Review Act . At the time of offer, you'll need to provide consent for a criminal record check. Once we receive clearance, we'll confirm your offer of employment.\n\nThis position is restricted to those legally entitled to work in Canada.\n\nThank you, in advance, for applying.", "Service Manager": "Position Profile:\nThe Kelowna Service Manager is responsible for managing the business of Roofing services, installation, maintenance and repair. In this role, they will serve clients of commercial properties, industrial, and institutional facilities.\n\nResponsibilities include:\nManage customer’s accounts, including invoicing and aged accounts receivables\nDevelop and maintain relationships with customers\nIncrease sales volume by meeting the specific needs of our customers\nReview quotes and tenders for maintenance to look for further sales opportunities; review repairs and mechanical upgrades as well as tenders for new roofs and roof replacements, as required\nReview roof reports with photos, roof CAD drawings, and quotes to look for further sales opportunities and then present them to the client in clear and concise language\nConduct bi-weekly staff meetings\nReview service financials\nProduce an annual budget for sales and overheads which predicts staff and equipment acquisitions\nResponsible for all department staff including, hiring, terminating, goal setting, and performance reviews\nAttend conventions and conferences as required\n\nSkills/Qualifications Include:\nSales-driven and customer service oriented\nExperience in a management role within a construction environment\nSkilled at solution selling and tailoring Flynn’s products and services to meet our client’s unique and specific requirements\nStrong management, delegation, planning, sales, and leadership skills\nExcellent communication and organizational skills\nAble to use MS Office Suite (Word, Excel, PowerPoint, Outlook)\nComfortable with heights and climbing a ladder\nPreference given to those with experience in the commercial roofing industry\n\nAdditional Information:\nWe are also highly active and committed to creating an environment which is accessible to all of our customers, employees and applicants. Reasonable accommodations in the hiring process will be provided to people with disabilities upon request.\n\nFlynn Group of Companies is an affiliated contractor with the Helmets to Hardhats Program.\n\nFor more information about starting your career with Flynn please visit www.flynncompanies.com", "Educator": "who we are\n\nYoga is our first love, and we also make technical product for running, training and pretty much every other way you like to sweat. You can find our stores all around the world, from Vancouver to Dubai, and places in between. Our vision is to create transformational experiences for people to live happy, healthy, fun lives and our mission is to elevate the world through the power of practice.\n\nwho you are\n\nYou are the foundation of our success as an organization. You are an expert in creating world-class guest experience in our retail stores. You deliver this experience by connecting with our guests, sharing top-quality product education, and speaking authentically about our community and culture.\n\nYou share exemplary product knowledge in every guest interaction, through education on special features, benefits, fabric properties, usage and care instructions in a way that is relevant to each unique guest, and you collect design feedback to continually elevate lululemon product design. You leverage product resources to elevate technical product knowledge, and you share your knowledge with other members of the team to elevate the level of technical education on the floor every day.\n\na Day In The Life\nYou create relationships with every guest to create excitement and fun about our culture, product and community, and you go above and beyond to exceed their expectations\nYou are knowledgeable and up to date on company communication, priorities, roll-outs and any additional information required by the Store Manager; you educate on guest-facing initiatives on the retail floor\nYou receive and process stock, involving: unpacking, counting, tagging as required, folding, sizing and placing on the floor, with overflow stock in back room and stored areas\nYou unpack boxes for inventory as required (boxes can weigh 5 - 30 lbs)\nYou are responsible for inventory management including receiving, processing, restocking + destocking, and visual merchandising\nYou assist in preparing the store for the day including: replenishing garment styles and other merchandise by color, size, and quantity requirements; folding, sizing, merchandising and changing mannequins as needed to maximize sell-through\nYou answer store phones and respond to voicemails and store email account as needed\nYou ensure items from fit rooms are cleaned, organized and returned to appropriate area\nYou prepare garments for hemming including pinning, completing necessary documentation (guest/store hemming slip); and educating regarding timelines for completion as well as preparing garments for guest pickup and/or shipping\nYou arrange shipping from store to guests, stores and warehouse as needed\nYou assist in closing the store for the day including: sizing, cleaning, collecting and removing trash and recycling and other duties as needed\nYou utilize Point of Sale system to accurately and efficiently process guest transactions; payments, refunds/exchanges and gift cards\nYou use hand held mobile devices to access and order product for our guests from our distribution and ecommerce channels\nYou are aware of company safety policies and procedures and you work in partnership with your team to ensure a safe workplace\nYou educate on your local community programs including local studios, instructors and events\nYou demonstrate exemplary community education in every guest interaction and you explain the “why” behind events/experiences and enroll guests in attending them\nYou facilitate relationships with sweat influencers in your store’s community by enrolling relevant guests in our Sweat Collective program and gathering product feedback\nYou know all current ambassadors by name and expertise and you facilitate the introduction of ambassadors to the team and other leaders in the community\nUnder the direction of the Store Manager/Assistant Manager/Key Leader, you perform/complete other additional projects, duties, and assignments as required and/or by request\n\nMust Haves\nYou have a passion for customer service and delivering an exceptional experience for guests\nYou integrate fun and joy as a way of being and working (aka you don't take yourself too seriously)\nYou acknowledge the presence of choice in every moment and take personal responsibility for your life\nYou possess an entrepreneurial spirit and continuously innovate to achieve great results.\nYou communicate with honesty and kindness, and create the space for others to do the same\nYou lead with courage, knowing the possibility of greatness is bigger than the fear of failure\nYou foster connection by putting people first and building trusting relationships\n\nQualifications\nAll employees’ availability must reflect the needs of the business, which may change from time to time. The Store Manager determines the availability needs, and this schedule could include a combination of shift times, including mornings, evenings, and weekends\nlululemon reserves the right to make amendments to the schedule and/ or availability requirements from time to time and at its sole discretion\nAll employees are expected to be available to work “Black Friday” (the day after US Thanksgiving) and from the second week of December (the start of the second week in period 11) until the end of the holiday season, to be defined each year based in part on the time period guests are permitted to return holiday merchandise, on an annual basis\nApplicants are a minimum of 18 years of age\nHigh school diploma or GED preferred\n\nThe Finer Print\nWho your leader is: Store Manager, Assistant Manager(s) + Key Leaders\nWhere you spend your time: Retail floor\nHours expectation:\nPart time: up to 19 hours\nFull time: 20-40 hours\nStatus: Non-Exempt\n\n\nNOTE: Only those applicants under consideration will be contacted. Please accept our utmost appreciation for your interest. lululemon is an Equal Employment Opportunity employer. Employment decisions are based on merit and business needs, and not on race, color, creed, age, sex, gender, sexual orientation, national origin, religion, marital status, medical condition, physical or mental disability, military service, pregnancy, childbirth and related medical conditions or any other classification protected by federal, state or provincial and local laws and ordinances. Reasonable accommodation is available for qualified individuals with disabilities, upon request. This Equal Employment Opportunity policy applies to all practices relating to recruitment and hiring, compensation, benefits, discipline, transfer, termination and all other terms and conditions of employment. While management is primarily responsible for seeing that lululemon equal employment opportunity policies are implemented, you share in the responsibility for assuring that, by your personal actions, the policies are effective.\n\nPrimary Location\n\nCAN-British Columbia-Kelowna\n\nJob\n\nStore Operations\n\nUnposting Date\n\nOngoing", "Technical Service Representative I": "Xerox (NYSE: XRX) makes every day work better.  We are a workplace technology company, building and integrating software and hardware for enterprises large and small.  As customers seek to manage information across digital and physical platforms, Xerox delivers a seamless, secure and sustainable experience. Whether inventing the copier, the ethernet, the laser printer or more, Xerox has long defined the modern work experience. Learn more at www.xerox.com and explore our commitment to diversity and inclusion!\nXerox Service Technician Location: Territory Coverage Kamloops - Kelowna, BC\nThe incumbent is accountable for the diagnosis and repair of Xerox photocopiers and multifunctional devices. Xerox will train the individual and will develop the necessary product knowledge, troubleshooting, customer and territory management skills through formal classroom training at a Xerox facility. The products to be supported are a mix of color, black and white and other products installed in the territory.\nRESPONSIBILITIES \n- Assume responsibility for coverage to an assigned territory\n\n- Correct service problems within the assigned product mix\n\n- Complete the required reports and records accurately and in a timely manner\n\n- Plan and install mandatory and optional retrofits\n\n- Communicate effectively with customers and Xerox employees\n\n- Attend and satisfactorily complete required Xerox training programs\n\n- Demonstrate proper care and maintenance of Xerox property\n\n- Represent Xerox to customers in a professional manner\n\n- Work and communicate effectively in a large work-group.\n \n\n- The position is full time with benefits. Xerox will provide vehicle, laptop, cell phone and all tools needed.\n\n- Xerox will provide all necessary training.\n\n- Must have Valid Class 5 drivers license and clean drivers abstract\n\n- Must be able to pass a criminal background check\n\n \n\n ", "Part Time Merchandiser - Kelowna": "Auto req ID: 204675BR\n\nJob Description\n\nPEPSICO BEVERAGES CANADA\n\nAccount Merchandiser\n\nThe Role\n\nYou are passionate about improving the consumer buying experience through the execution of flawless merchandising standards. This includes rotating and re-stocking products into shelves, racks, and displays. PepsiCo merchandisers are detail oriented, customer-focused and self-driven to create enticing marketing displays that drive brand awareness of our current promotions.\nHours: 25-40 hours a week\nShifts: Wednesday - Sunday from around early mornings to afternoon\nThe Company\nPepsiCo Canada is recognized as one of Canada’s top 100 employers. PepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. Our product portfolio includes 22 world-famous, billion-dollar brands; from Gatorade to Quaker, Tropicana to Lay’s and more. We make hundreds of enjoyable foods and beverages that are loved throughout the world.\n\nAt PepsiCo Canada, we are always centered on the consumer, developing exciting brand campaigns and continuously driving product innovations. Our people are our greatest asset! By supporting their ability to work effectively together and providing them with the tools they need to succeed, we are ensuring that PepsiCo Canada is the company you want to work for!\n\nWhat You’ll Be Doing\nMerchandising Pepsi products into store shelving, racks, coolers and displays by transporting product from the store’s stock room to different points of purchase using manual or powered equipment\nMaintaining back room stock in neat and orderly condition\nSupporting execution of store promotions by ensuring all shelves are filled and promotional materials are maximized throughout the account\nFollowing FIFO procedures and rotating out expired products to ensure freshness of Pepsi products\nWorking collaboratively with the Account Sales Representatives and Delivery teams to provide top quality servicing of all Pepsi accounts\n\nQualifications/Requirements\n\nWho’s a good fit for the team:\nYou have your high school diploma (or equivalent)\nYou hold a valid Class 5 license and have access to your own vehicle\nIf you have prior merchandising or customer service experience, that’s an is an asset\nPrevious grocery store experience is also an asset\nYou must be able to repeatedly lift up to 50 lbs unassisted and push or pull up to 200 lbs using a palette jack\nYou must enjoy working independently and be self-driven in an autonomous work environment\nYou have excellent time management skills and can organize and prioritize your day well\n\nWhat You Can Expect From Us\nCompetitive compensation\nA flexible working environment that promotes a healthy work-life balance\nA dynamic and inclusive culture that promotes you to bring your whole-self to work\nA supportive team that will encourage your professional growth and development\nAn opportunity to be meaningful and impactful within your work\n\nSuccessful applicants will be required to pass a background check which includes a criminal record check, a reference check, a general employment verification, and confirmation of high school (or equivalent credential) completion.\n\n#PBH\n\n#GD-PBC\n\nJob Type: Part-Time"}