{"Cloud Developer - Canada": "Cloud Developer\n\nCanada | Remote | Work from Home\n\nWhy you?\n\nAre you a Canadian based Cloud Engineer or Full Stack Software Developer who can provide consulting services to Pythian’s global clients including planning, designing and implementing new solutions using the latest Cloud and Big Data technologies? Do you want to work on large scale custom consulting projects? Do you want to work remotely to implement and help develop cutting edge solutions, create data pipelines which will migrate data from customers on-prem systems and load it into a cloud hosted Enterprise Data Platform ? If you have a passion for big data and solving complex problems then this could be the job for you!\n\nWhat will you be doing?\nWorking with our Cloud Architects to design and develop end to end Cloud based solutions with heavy focus on application and data, all with good understanding of underlying cloud infrastructure\nBe part of a team of globally dispersed Cloud Consultants, supporting other members of the team in overcoming challenges, removing roadblocks and developing options and solutions\nWorking on complex and varied Cloud Data focused projects such as migrating business-critical applications to the cloud, re-platforming or re-architecting difficult data and analytics use cases; Migrate existing data warehouses from on-premise data center or from one cloud provider to another. As an example of our migration approach, read about our Teradata to Google Cloud Platform migration service.\nHelp our customers to grow from a data warehouse into a true cloud-native data platform with full multi-source data ingestion and integration.\nBuild or move analytic workloads to the cloud for better scalability and efficiency.\nTranslating complex functional and technical requirements into detailed designs.\nWriting high-performance, reliable and maintainable code.\nAutomate, create reusable accelerators to help get the job done quicker and better\nPerform data processing requirements analysis and data flow integrations with external systems.\nSecuring components of clients’ Data platforms.\nDiagnostics and troubleshooting of operational issues. Perform Health-checks and configuration reviews.\nAssisting client developers and advising on efficient data access and manipulations.\n\nWhat do we need from you?\nWhile we realise you might not have everything on the list to be the successful candidate for the Cloud Consultant job you will likely have at least 5 years experience in similar roles. The position requires specialized knowledge and experience in performing the following:\nBe fluent in a couple of object oriented language, preferably Java and Python, familiarity with Scala and Go would be a plus.\nExperience building end to end software on Google Cloud Platform (GCP), Amazon Web Services (AWS) or Microsoft Azure.\nGood knowledge of popular database and data warehouse technologies & concepts from Google, Amazon or Microsoft (Cloud & Conventional RDBMS), such as BigQuery, Redshift, Microsoft Azure SQL Data Warehouse, Snowflake etc.\nExperience with GCP Dataflow, AWS Glue, Azure DataFactory or any equivalent would be great\nExperience in data modeling, data design and persistence (e.g. warehousing, data marts, data lakes).\nGeneral knowledge of modern data-center and cloud infrastructure including server hardware, networking and storage.\n\nWhat do you get in return?\nCompetitive total rewards package\nFlexible work environment: Why commute? Work remotely from your home, there’s no daily travel requirement to an office!\nOutstanding people: Collaborate with the industry’s top minds.\nSubstantial training allowance: Hone your skills or learn new ones; participate in professional development days, attend conferences, become certified, whatever you like!\nAmazing time off: Start with a minimum 3 weeks paid time off, 7 sick days, and 2 professional development days!\nOffice Allowance: A device of your choosing and personalise your work environment!\nFun, fun, fun: Blog during work hours ; take a day off and volunteer for your favorite charity.\n\nWhy Pythian?\n\nPythian excels at helping businesses use their data and cloud to transform how they compete and win in this ever-changing environment by delivering advanced on-prem, hybrid, cloud and multi-cloud solutions to solve the toughest data challenges faster and better than anyone else. Founded and headquartered in Ottawa, Canada in 1997, Pythian now has more than 300 employees located around the globe with over 350 clients spanning industries from SaaS; media; gaming; financial services; e-commerce and more. Pythian is known for its technology-enabled data expertise covering everything from ETL to ML. We pride ourselves on our ability to deliver innovative solutions that meet the specific data goals of each client and have built meaningful partnerships with major cloud vendors AWS, Google and Microsoft. The powerful combination of our extensive expertise in data and cloud and our ability to keep on top of the latest bleeding edge technologies make us the perfect partner to help mid and large-sized businesses transform to stay ahead in today’s rapidly changing digital economy. If you are a Cloud Consultant; live in the United States or Canada; love your data and want to love your career then join us!\n\nIntrigued to see what a job is like at Pythian or check us out @Pythian and #pythianlife . Follow @PythianJobs on Twitter and @loveyourdata on Instagram!\n\nNot the right job for you? Check out what other great jobs Pythian has open around the world! Pythian Careers\n\nDisclaimer\n\nFor this job an equivalent combination of education and experience, which results in demonstrated ability to apply skills will also be considered.\n\nPythian is an equal opportunity employer and welcomes applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\nThe successful applicant will need to fulfill the requirements necessary to obtain a background check.\n\nApplicants must be legally authorized to work in their country of residence permanently– Pythian will not relocate, sponsor, or file petitions of any kind on behalf of a foreign worker to gain a work visa, become a permanent resident based on a permanent job offer, or to otherwise obtain authorization to work.\n\nNo recruitment agencies\nSeniority Level\nEntry level\nIndustry\nInformation Technology & Services\nEmployment Type\nFull-time\nJob Functions\nOther", "Senior Software Engineer": "Filtering the negative to make room for the positive.\n\nAt Two Hat, our mission is to help social networks build safe and healthy online communities by removing negative interactions to make room for positive human connections. We believe that everyone should be free to share online without fear of harassment or abuse.\n\nProcessing nearly 30 billion interactions a month, Two Hat enables clients across a variety of social networks and gaming companies to deliver positive user experiences by detecting and filtering harmful content in real time, before it reaches the community. More than just a filter, we provide an all-in-one content moderation solution, with data analysis, content escalations, flexible workflows, auto-moderated user reports, and more. Clients benefit from our scalable, autonomous, and transparent solution, as well as our team of industry experts who consult on best practices and industry standards. As a leading provider of content moderation best practices, we believe we can restore the original purpose of the internet - to empower positive human connection and facilitate healthy social online interactions. \n\nRemoving illegal content is a shared responsibility. To that end, we work with international governments and law enforcement in helping to prevent the targeting of children through the internet, and train AI to detect new child exploitation material.\n\nWho you are\n\nWe are looking for a complex problem solver with a delivery mindset to join our team as a Software Engineer. In this role, you’ll build out and scale our products as well as drive continuous improvements to our flagship automated moderation product CommunitySift and its ability to process data at a massive scale. \n\nWhat’s in it for you? \n\nPurpose and impact. We’ve said it a few times, but what we do matters. We are building solutions that make a difference. This is your chance to be part of an organization adding true value and meaning to the world.\n\nCutting edge technology. You want to work with deep learning loops; collaborate with Data Scientists to build fast AI that encompasses natural language processing; build our classifiers, both algorithmic or machine learning. You want to:\nExecute on Agile SaaS-based tool development. You will develop and iterate new features and functionality for our web and mobile products.\nLead architectural discussions. You will identify architecture and infrastructure problems - and solutions.\nCollaborate. You will be a key member of the product development team; assisting with operations and information security.\nPlan and advise. You will execute on tactics that support the technology vision for the product and the organization as a whole.\n\nGrowth and challenges. You want to bring your knowledge, expertise and lessons learned to influence and help build out our architecture and processes. You want to move between our three engineering teams, features, maintenance and platform, gaining exposure to all of our products and working on complex client projects. You want to be part of a well-supported and close-knit team with the freedom to work remotely. You want to share your thoughts on how to solve challenges beyond what anyone else out there is taking on in AI, ML and NLP.\n\nWhat you bring\n\nTechnical expertise. You have experience in a cloud development environment building high availability SaaS applications that serve 100,000+ requests every second. You have hands-on expertise with object-oriented programming; knowledge of Python, Javascript, C/C++, JIRA, Git/Github are all beneficial. You have a strong understanding of best practices for Security.\nA passion for Agile. You thrive in a fast-paced and Agile Kanban environment. You can:\nWork with Product Managers to translate user stories into actionable tasks.\nCollaborate with the engineering team to scope tasks and provide estimates.\nDevelop solutions to meet acceptance criteria.\nA growth mindset. You think big and keep up to date on emerging trends and industry best practices. You are open to feedback and on a personal mission to pursue new learnings at every opportunity.  \nA delivery focus. You have a proven track record managing competing priorities while maintaining an ability to execute on time, beyond expectations.\nAn innovative team approach. You are a team player with a positive attitude punctuated by high energy, initiative and perseverance. You can effectively build working relationships, be accountable and coordinate resources with cross-functional teams.\n\nJoin us\n\nOur CEO and Founder is a visionary who believes in a better internet for everyone- and it’s a vision each one of us stands behind. Sure, it’s a lofty goal; and maybe it sounds impossible…but we don’t think it is. Our technology is capable of more now than when we started, but unsafe users are growing increasingly deceptive. We continue to step up our game and meet those challenges at every turn. \n\nRight now, we are growing and we aren’t slowing down anytime soon. We are looking for brilliant, innovative and deeply conscientious people to join our team and be part of our mission. This is a place where:\nWe have an evolving startup culture of fiercely dedicated and collaborative individuals.\nA tech giant praised us for tackling - and solving - a highly complex chat feature.\nWe coordinate and run an “Amazing Race” event celebrating our six year anniversary.\nSpot rewards are handed out by the CEO.\nWe host a “Mug Club” which is our version of a Ted Talk presented by anyone with a bright idea.\nPink Shirt Day means something to us on a deeper level.\nWe participate in local acts of good, both big and small, to bring a little joy to our community.\n\nIf you are driven to make the world a better place; you share our growth mindset; and you have built your talent on a foundation of hard work and creative thinking, join us.\n\nTwo Hat welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\nDue to COVID-19 please expect changes to our standard recruitment process. In all instances, the safety of our employees and our candidates is of our utmost concern so we will be conducting interviews virtually and online. We will keep you informed on these changes and ensure that you are prepared in advance with the necessary instructions to conduct the next steps in the recruitment process.", "Rendering Software Engineer": "Oooh is a team of 20 who have built some of the biggest global phenomenons in video and video games and have come together with a moonshot mission. Backed by an incredible group of Silicon Valley and LA VC’s, founders, product and technology leaders and entertainment moguls—all of whom feel personally connected to our purpose—we’ve been quietly building a smarter and healthier next-gen digital platform focused on younger audiences. And, one that’s way more fun. That’s about all we can say here :)  \n\nWe’re now looking for a Rendering Software Engineer to join our team! Working either from our Los Angeles, or Kelowna, British Columbia Canada offices you’ll be the first engineer dedicated to video graphics and rendering.  \n\nYou will have a passion for pushing the leading edge of video technology and a sensibility for making your implementations accessible to casual users. This role needs someone who is brings domain expertise from the video or gaming world, and ideally having worked at platforms with significant real-time video rendering products like Snapchat, TikTok, Instagram or AR-companies leveraging similar types of technologies. Without relative past experience, you may not be a great fit for this first dedicated video graphics engineering position.\n\nRESPONSIBILITIES\nDevelop innovative user experiences based on advanced computer graphics, video processing, computer vision and/or AR technologies\nLearn and acquire new techniques quickly based on project requirements\nWork closely with other teams to explore and prototype new product features\n\nEXPERIENCE\nBA/BS, MS in Computer Science or a related field\n4+ years experience in similar role\nExperience in video and image processing related applications on mobile phones\nStrong CS fundamentals (algorithms and data structures) and problem-solving skills\n\nPREFERRED QUALIFICATIONS\nStrong C/C++/C# skills and mobile platform development experiences (iOS or Android)\nExperience with graphics rendering APIs such as OpenGL ES / Metal / Vulkan\nExperience in designing, prototyping, and programming with real-time 3D engines such as Unity or Unreal\nExperience in shader programming\nExperience Profiling and Performance Optimizations\n\n*BONUS*\nHave worked on Snapchat or Instagram ‘Stories’ or TikTok’s video products, including filters/lenses and other real-time and post-processing video features\nFull-stack video software engineering experience\nExperience working with Computer Vision libraries such as OpenCV\nExperience with any of the following: Mapping and tracking algorithms, Camera optics, Image sensor technology, Image filtering techniques, Image analysis and segmentation, or IMUs\nExperience with augmented reality application development\nExperience using machine learning frameworks such as Tensorflow\n\nENVIRONMENT\nSmall team moving fast. All of the ownership with none of the BS.\n\nPERKS\nPremier Medical, Vision, Dental and Disability insurance\nUnlimited PTO\nMaternity and Paternity Leave\nOther typical startup life benefits - that you have a say in - as we grow", "Senior Software Engineer (Engine)": "Oooh is a team of 23, and growing fast, who have built some of the biggest global phenomenons in video and video games and have come together with a moonshot mission. Backed by an incredible group of Silicon Valley and LA VC’s, founders, product and technology leaders and entertainment moguls—all of whom feel personally connected to our purpose—we’ve been quietly building a smarter and healthier next-gen digital platform focused on younger audiences. And, one that’s more fun. That’s about all we can say here :)  \n We’re now looking for a Senior Software Engineer to join our platform team! Working either from our Los Angeles, or Kelowna, British Columbia Canada offices you’ll be working directly supporting new features and the games engine.\n You will have a passion for pushing the leading edge of game engine technology, low level code, and optimizations on mobile platforms. This role needs someone who brings domain expertise from the video or gaming world, and ideally having worked at platforms such as Unity or Unreal. \n RESPONSIBILITIES\nDevelop innovative user experiences based on advanced computer graphics, video processing, computer vision and/or AR technologies\nLearn and acquire new techniques quickly based on project requirements\nWork closely with other teams to explore and prototype new product features\n EXPERIENCE\nBA/BS, MS in Computer Science or a related field\n5+ years experience in similar role\nExperience supporting game engines,  low-level optimizations, profiling, and mobile platforms. \nExperience with graphics rendering APIs such as OpenGL ES / Metal / Vulkan and shader programming.\nStrong CS fundamentals (algorithms and data structures) and problem-solving skills\n PREFERRED QUALIFICATIONS\nStrong C/C++/C#/C-Objective skills and mobile platform development experiences (iOS or Android)\nExperience in designing, prototyping, and programming with real-time 3D engines such as Unity or Unreal\n  ENVIRONMENT\nSmall team moving fast. All of the ownership with none of the BS.\n PERKS\nCompany Stock Options\nPremier Medical, Vision, Dental and Disability insurance\nUnlimited PTO\nMaternity and Paternity Leave\nOther typical startup life benefits - that you have a say in as we grow", "Web Developer": "Job requirements\n\nLanguages\n\nEnglish\n\nEducation\n\nSecondary (high) school graduation certificate\n\nExperience\n\n1 year to less than 2 years\nSpecific SkillsConsult with clients to develop and document Website requirements; Lead and co-ordinate multidisciplinary teams to develop Website graphics, content, capacity and interactivity; Source, select and organize information for inclusion and design the appearance, layout and flow of the Website; Create and optimize content for Website using a variety of graphics, database, animation and other software; Plan, design, write, modify, integrate and test Web-site related code; Conduct tests and perform security and quality controls\nOperating Systems and SoftwareAndroidBusiness Equipment and Computer ApplicationsXcode; Sublime Text; EclipseApplicationsAdobe Acrobat Reader; Adobe Photoshop; Flash; Corel Draw; Adobe Premiere ProProgramming LanguagesXML; VRML; MySQL; Java; JavaScript; JSP; HTML; COM / COM+ / DCOM / MTS / ActiveX; C++; ASP; Basic; Perl; Objective-C; Python; Ruby; Scala; Angular.js; Gulp; Microsoft Dynamics AX (x++); Tool Command Language (TCL); Windows Presentation Foundation (WPF); Shell scriptWork Conditions and Physical CapabilitiesFast-paced environment; Work under pressure; Repetitive tasks; Attention to detail; Sitting; Tight deadlinesComputer and Technology KnowledgeUnix; Spreadsheet; Oracle; MS Windows; Linux; Internet; Database software; MAC; JavaOS; Networking software; Extranet; Intranet; Servers; File management software; Security software; Presentation software; Mail server software; Image editing software; Project management software; Programming software; HTML editing software; Web service design; Programming languages; Software development; Data analysis software; MS Office; SharePoint; Desktop applications; Multimedia software; Computer-aided design (CAD); .NETPersonal SuitabilityTeam player; Excellent oral communication; Excellent written communication; Client focus; Judgement; Organized", "Junior Software Developer in Canada": "If you want to work with an exceptional group of people, in a great location, with numerous benefits and a terrific corporate culture—your are on the right page.\n\nAcro Media is looking for a Junior Software Developer to develop Drupal 8 and Commerce builds. Someone who can code like it’s their native tongue but still talk to our crew comfortably and sometimes even the odd client.\n\nWe consider ourselves a laid-back bunch but driven to do well for our customers. We’re looking for low egos and high skills. You can be young and inexperienced or a savvy veteran, what we’re really looking for is your ability to code, which may be finely honed skill or raw talent at this point.\n\nWe aren't looking to stick you in a corner with headphones on and call you “the IT department”. Developers own this joint; we get it. If you’re desperate to break free from that office life where you co-workers have never even heard of Minecraft, and want to come on board to build kick-ass commerce sites, corporate gems, and the occasional game, keep reading.\n\nAs the successful candidate, here are some things you’ll be responsible for:\n\nProducing high quality work adhering to Acro Media standards and following the Acro Media production process\n\nImplementing updates & revisions to web sites\n\nContributing code back to the Drupal community, testing and responding to issues, maintaining modules.\n\nWorking independently on multiple smaller tasks or larger builds with shifting priorities and tight deadlines\n\nAdhering to and providing accurate estimates for the amount of time required to repair a defect, a build, or to add additional functionality to an existing application\n\nProviding efficient solutions in a timely manner for work requests, issues, and defects\n\nCommunicating well with Account Managers, Supervisors, and Clients in regards to work requests, problems and defects\n\nActing as both a peer/mentor to other Developers as well as be comfortable asking for help from team members\n\nThe Successful Applicant Will Have\n\nAbility to find and fix problems in code, this might not be your code and your only hint might be a cryptic complaint from a client.\n\nA good mix of web development skills, you should be able to build out site template and then code all the gears and pulleys behind the scenes as well, we try not to have people who do all HTML/CSS and people who do all backend coding, we like people who can multi-class. You’re not going to work on the same thing for 8 months. If you only have experience on embedded systems or just design sexy layouts, maybe try to brush up on your weaker areas, we are open minded though so don’t let this scare you away.\n\nOur designers use Photoshop, so when you’re building out the templates, it’s good to know how to navigate around this application. Basic knowledge of how layers work, and the use of some the more important tools that are required for taking apart the design and deriving all the images for web-use is a plus.\n\nWe're Open To Good Programmers Who Know Other Languages And Technologies And Are Willingto Learn, But Below Is a List Of a Bunch Of Stuff We Normally Work With\n\nHas some coding work to send us\n\nPHP\n\nSQL\n\nCSS3/HTML5\n\nJavascript/jQuery\n\nXML\n\nBonus: C++/Objective C/C#/C\n\nIf you know other languages don’t forget to mention them. If you are a badass Lisp hacker type, mention that.\n\nComfortable working in a Linux shell to do day-to-day tasks. Hopefully, you have installed Linux on something at least once, even if it was just your Xbox, phone...or vacuum etc. (For real, though, you can get Linux installed on a Roomba)\n\nSome understanding of Linux hosting if at all possible. Have you configured your own server? Did you setup a web server for your house or friends, even if no one else really cared?\n\nPrior experience with a source control system (ex, SVN, Git, GitHub, etc.)\n\nFormal education or prior experience is NOT required, we just want to know that you can code, so you’ll have to have some work you can show us.\n\nAll offers of employment with Acro Media Inc are contingent upon the candidate having successfully completed a criminal background check.\n\nHere are some things we pride ourselves on being able to offer our staff:\n\nFlex start times & Earned days off:Do you prefer to start at 8:00? or 9:00? We'll work with you. Want every second Friday off? Well we've got a program for that too!\n\nPaid Overtime for all roles...including salary positions: What? What?! Yep you heard right. We pay for all approvedOT...not that we want everyone working so hard,but with the natural ebb and flow of our industry sometimes it's needed to blast out the OT in order to keep our heads above water. We findthis little pay chequenugget is a nice reward for the over timerz.\n\nSlappies: Tougher to explain but once a month we get together and have a little ceremony, some food, a few brews - no altars or corporate chants involved.\n\nFun day: We aim to have fun every day; however, every year for a day we cram a bunch of fun on ourselves. Weee!\n\nSPARC Events: Sometimes we have an in-house breakfast, team building events, (less corny than it sounds), competitions, or just a plain little reward for no reason. It's a little spark in our usually normal days. Warning, we make you wear costumes. Often.\n\nCulture: We're a certain type of people. We're all a little different and unique in our own way but we seem to work well together. No one’s perfect and we embrace that. We take our work seriously, but we don't take ourselves too seriously. Check out our site to get to know us!", "Software Developer / Programmer (Exciting opportunity: Intelligent people and great variety)": "Not your everyday software developer position. Challenging and fast moving, yet friendly and supportive: a career you will look forward to every day. Work with intelligent people in an exciting environment where every month is different.\n\nPositions Available\n\nMultiple positions ranging from intermediate up to team lead level (based on skill, regardless of the amount of experience or education), opening up immediately and throughout the year.\nAdditional positions for specialists (for example, Android programmers, front-end developers, etc). Tell us your strengths and we’ll go from there.\nOther Positions: We are also hiring for other positions (software tester, business analyst, project manager, graphic designer, and UX designer). You may apply for multiple positions separately. If you know someone in any of these areas, please do them a quick and friendly favour by letting them know about this posting.\nOffice Location: This position will be in a new expanded office location. Precise coordinates of the new location, have not been announced yet.\n\nPosition Overview\n\nFull time and permanent.\nFast moving in terms of variety of work and expectations.\nFlexible hours (for example: choose to start your day between 6am and 10am, work late some days and shorter on others).\nGain valuable career experience in the newest highlevel technologies (C#, .NET 5, Java, MVC7, WCF, web services, SOA, Swift/Objective-C, Xamarin, F#).\nGain experience with many advanced software engineering tools and techniques (code generation, object relational mappers, advanced .NET reflection, etc).\nGain experience with both small and large projects, with involvement throughout the product life-cycle.\nOpportunities to be involved with higher level architecture and design.\nMentoring from experienced software architects and some of the smartest peers in the country, on exciting projects that you can really sink your teeth into.\nA blend of programming methodologies (deliberately part way between agile, Kanban, and waterfall plus occasional extreme and pair programming methodologies).\nDoes not involve a lot of boring technical support or fixing broken legacy applications.\nMost of the learning is through hands-on trying and doing and collaborating. Meetings and formal training are minimized.\nRarely requires meeting with a client for those who prefer not to.\nEnvironment allows for some privacy at your workstation as well as time to concentrate without distractions when you need it.\nExchange city program: swap cities with one of our developers in another city! Pleasant covers good portion of travel, no cost accommodation, and stay for a month or two without using up any vacation.\n\nRequirements\n\nHighly intelligent.\nFast learner and enjoys learning.\nPassionate about making software and very good at it.\nGets deeply involved with challenges and will persevere at length to achieve victory.\nTakes pride in work.\nA deep appreciation for reusable code and the benefits of object oriented design.\nNo specific requirements for formal education or industry experience. We evaluate each applicant based on merit rather than formalities.\n\nNice To Have\n\nAbility to see opportunities for improvement everywhere.\nExperience with .NET or mobile development.\nPragmatic approach to balancing perfectionism with getting the job done.\n\nAbout The Work Environment\n\nFriendly, non-threatening, and non-political environment.\nMid-sized company but retaining the speed and flexibility of a smaller company.\nWe are a great environment for both outgoing people and those who are very shy and introverted (applicable to non-client facing positions).\nWe strive to have every employee sitting near a window for natural light and to have plenty of plants throughout the office; we care about employee health.\nSocial events worth remembering (fencing competitions, curling, video game or board game parties, coding competitions, commando combat training, robotics club coming soon, etc).\nUnlimited access to pillage our kitchens for caffeine, sugar, healthy snacks, soups, and more :)\nAdditional perks that are cost-shared like motorized sit-stand desks.\nTask focused: everyone in the company heavily uses centralized to-do lists to stay organized, prioritize, and coordinate.\nFast paced\nHeadquarters and in the future satellite offices too: Free onsite massage therapy.\nHeadquarters: Private nap rooms for isolated thinking time or for taking a nap if you didn’t sleep well last night.\nConsistent work/life balance: mandatory overtime is very rare.\n\nAbout The Company\n\nPleasant Solutions is a dynamic company headquartered in Edmonton, a large satellite office in Toronto/Vancouver, and small satellite offices across Canada and the USA (including in Calgary, Ottawa, Saskatoon, New York, Denver, Boston, etc)\nSilicon Valley kind of excitement and growth potential.\nFast growth: One of the 200 fastest growing technology companies in North America with 955% growth over 5 years (based on growth rates in published rankings of the 2014 Profit 500 and 2013 Deloitte Technology Fast 500). Canadian Profit Guide ranked us #88 out of 500 for fast growth in Canada, announced in Sept 2015.\nStable and well diversified.\nFull of smart and passionate people whom you can learn from.\nVery low employee turn-over rate, attesting to the value of working here.\nWe do a mix of in-house product development, software development services, electronics manufacturing, and IT services. For consulting, we build both large and small custom software for clients who need an internal system or are commercializing an idea. Our in-house products include the high-security Pleasant Password Server, an innovative tool that lets non-technical people build their own web applications using spreadsheets, an event ticketing system, and other business software.\nAn innovative technology company with an aim of achieving results in creative ways.\nWe develop high quality software you will take pride in. Our company name says it all.\nSocially conscious (for example, we pay for employees to sponsor hundreds of WorldVision children).\n\nApplying\n\nWhat do you have to lose by exploring the possibility? Applying does not take long and we keep your application confidential (never disclosed to existing employer).\nApply online today at\nEven if you don't have your resume updated or ready to go, apply anyways, we want to hear from you!\nPlease do not apply via email, apply only by visiting the site.\n\nKeywords\n\nsenior software engineer\nsenior software designer\nsenior software developer\nsenior programmer\nsoftware programmer\nsenior software architect\nproject manager\nteam leader\nlead developer\nsoftware engineering\napplication developer\nmobile software developer\nmobile developer\n\nPlurals\n\nsenior software engineers\nsenior software designers\nsenior software developers\nsenior programmers\nsoftware programmers\nsenior software architects\nproject managers\nteam leaders\nlead developers\napplication developers\nmobile software developers\nmobile developers", "Senior Drupal Software Developer": "If you want to work with an exceptional group of people, in a great location, with numerous benefits and a terrific corporate culture—youare on the right page.\n\nAcro Media is looking for a Drupal Software Developer to develop Drupal 8 and Commerce builds. Someone who can code like it’s their native tongue but still talk to our crew comfortably and sometimes even the odd client.\n\nWe consider ourselves a laid-back bunch but driven to do well for our customers. We’re looking for low egos and high skills. You can be young and inexperienced or a savvy veteran, what we’re really looking for is your ability to code, which may be finely honed skill or raw talent at this point.\n\nWe aren't looking to stick you in a corner with headphones on and call you “the IT department”. Developers own this joint; we get it. If you’re desperate to break free from that office life where you co-workers have never even heard of Minecraft, and want to come on board to build kick-ass commerce sites, corporate gems, and the occasional game, keep reading.\n\nAs the successful candidate, here are some things you’ll be responsible for:\n\nMust have Drupal Experience and be able to provide example work***\n\nProducing high quality work adhering to Acro Media standards and following the Acro Media production process\n\nImplementing updates & revisions to web sites\n\nContributing code back to the Drupal community, testing and responding to issues, maintaining modules.\n\nWorking independently on multiple smaller tasks or larger builds with shifting priorities and tight deadlines\n\nAdhering to and providing accurate estimates for the amount of time required to repair a defect, a build, or to add additional functionality to an existing application\n\nProviding efficient solutions in a timely manner for work requests, issues, and defects\n\nCommunicating well with Account Managers, Supervisors, and Clients in regards to work requests, problems and defects\n\nActing as both a peer/mentor to other Developers as well as be comfortable asking for help from team members\n\nThe Successful Applicant Will Have\n\nAbility to find and fix problems in code, this might not be your code and your only hint might be a cryptic complaint from a client.\n\nA good mix of web development skills, you should be able to build out site template and then code all the gears and pulleys behind the scenes as well, we try not to have people who do all HTML/CSS and people who do all backend coding, we like people who can multi-class. You’re not going to work on the same thing for 8 months. If you only have experience on embedded systems or just design sexy layouts, maybe try to brush up on your weaker areas, we are open minded though so don’t let this scare you away.\n\nOur designers use Photoshop, so when you’re building out the templates, it’s good to know how to navigate around this application. Basic knowledge of how layers work, and the use of some the more important tools that are required for taking apart the design and deriving all the images for web-use is a plus.\n\nWe're Open To Good Programmers Who Know Other Languages And Technologies And Are Will To Learn, But Below Is a List Of a Bunch Of Stuff We Normally Work With\n\nHas Drupal work to send us\n\nPHP\n\nSQL\n\nCSS3/HTML5\n\nJavascript/jQuery\n\nXML\n\nBonus: C++/Objective C/C#/C\n\nIf you know other languages don’t forget to mention them, if you are a badass Lisp hacker type, mention that.\n\nComfortable working in a Linux shell to do day-to-day tasks. Hopefully, you have installed Linux on something at least once, even if it was just your Xbox, phone...or vacuum etc. (For real, though, you can get Linux installed on a Roomba)\n\nSome understanding of Linux hosting if at all possible. Have you configured your own server? Did you setup a web server for your house or friends, even if no one else really cared?\n\nPrior experience with a source control system (ex, SVN, Git, GitHub, etc.)\n\nFormal education or prior experience is NOT required, we just want to know that you can code, so you’ll have to have some work you can show us.\n\nAn excellentinternet connection is required;you must be able to sustain an hour long conference call without any issues\n\nAll offers of employment with Acro Media Inc are contingent upon the candidate having successfully completed a criminal background check.\n\nHere are some things we pride ourselves on being able to offer our staff:\n\nFlex start times & Earned days off:Do you prefer to start at 8:00? or 9:00? We'll work with you. Want every second Friday off? Well we've got a program for that too!\n\nPaid Overtime for all roles...including salary positions: What? What?! Yep you heard right. We pay for all approvedOT...not that we want everyone working so hard,but with the natural ebb and flow of our industry sometimes it's needed to blast out the OT in order to keep our heads above water. We findthis little pay chequenugget is a nice reward for the over timerz.\n\nSlappies: Tougher to explain but once a month we get together and have a little ceremony, some food, a few brews - no altars or corporate chants involved.\n\nFun day: We aim to have fun every day; however, every year for a day we cram a bunch of fun on ourselves. Weee!\n\nSPARC Events: Sometimes we have an in-house breakfast, team building events, (less corny than it sounds), competitions, or just a plain little reward for no reason. It's a little spark in our usually normal days. Warning, we make you wear costumes. Often.\n\nCulture: We're a certain type of people. We're all a little different and unique in our own way but we seem to work well together. No one’s perfect and we embrace that. We take our work seriously, but we don't take ourselves too seriously. Check out our site to get to know us!\nSeniority Level\nAssociate\nIndustry\nMarketing & Advertising Computer Software Internet\nEmployment Type\nFull-time\nJob Functions\nEngineering Information Technology", "Intermediate Java Developer": "Your Role\n\nAs an Intermediate Java Developer at Global Relay, you’ll be using leading edge technologies to build pioneering products that are used by tens of thousands of users globally to solve real world business problems. You also get to tackle interesting and engaging problems to do with scalability and high availability in big data environments. At Global Relay we are continuously pushing the boundaries of Java technology.\n\nThis is an opportunity to work alongside some of the best Java developers in British Columbia and apply your craft in an environment that encourages creative thinking and autonomy. Our software is developed by small, focused agile teams of developers and QA. We encourage our developers to think beyond a single component to build complete system solutions. Challenge yourself by learning new technologies, and apply your skills across our different projects and application domains. If you are committed to code that is clean, well-tested, well-reviewed, performant and secure then you’ll fit in around here.\n\nTech Stack\nNoSQL DBs (Cassandra, MongoDB, HBase, ZooKeeper)\nIn Memory Data Grids (Terracotta)\nSerialization libraries (Thrift, Protocol Buffers)\nLarge scale data processing (Hadoop)\nDependency injection frameworks (Guice, Spring)\nCQRS frameworks (Axon)\nText search engines (Lucene, ElasticSearch)\n\nYour Job\nWork as part of an agile development team to write Java code for enterprise services\nWrite unit and integration tests for your Java code\nDesign, in collaboration with team, the software implementations that satisfy business requirements\nCollaborate with QA in development of test cases for Java code\nDevelop deployment systems for Java based systems\nDocument code and document detail designs\nCollaborate with product owners on user story generation and refinement\nMonitor and support operation of production systems\nParticipate in knowledge sharing activities with colleagues\n\nAbout You\nMinimum 5 years of Java developer experience\nExperience with agile development methodologies\nExperience with test driven development\nExperience with continuous integration systems\nExperience with dependency injection containers\nExperience with network protocols such as HTTP, TLS, TCP\nExperience with service oriented architecture\nExperience with web services technology such as REST, JSON, or Thrift\nExperience with multi-threaded programming\nExperience with design patterns\n\nAbout Us\n\nGlobal Relay is the leading provider of cloud-based archiving, supervision, eDiscovery, and analytics for the global financial sector. We deliver services to 23,000 customers in 90 countries, including 22 of the top 25 global banks. Our market-leading archiving service supports email, instant messaging, Bloomberg®, Thomson Reuters, social media, mobile messaging, and more – with mobile, Outlook, and web access.\n\nOur Global Operations & Development Center is located in Vancouver, BC, Canada. In addition, we have offices in six other cities across the world, including major financial centers like New York, Chicago, and London.\nOver the years, we have won several major awards, including:\nCompany of the Year from the BC Tech Association (2016)\nCanada’s 50 Best Small and Medium Employers (2014, 2015)\nCanada’s Top Employers for Young People (2014)\nCanada’s Top 10 Most Admired Corporate Cultures (2013, 2016)\nCanada’s Best Managed Companies (2013 - present)\nTechnology Fast 50 – Leadership (2014, 2018)\nWe provide fantastic opportunities to individuals passionate about business and technology. For those with international business aspirations, we offer invaluable opportunities for doing business with some of the world’s largest, most influential firms. Our company is also perfect for those who want to create cool technology using massively scalable, big-data architecture, with a strong focus on mobile.\n\nTo learn more about our business, culture, and community involvement, visit www.globalrelay.com .\n\nThink you're a great fit for this job? Apply today with your cover letter and resume.\n\nOptions\n\nApply for this job online Apply\n\nShare\n\nEmail this job to a friend Refer\n\nSorry the Share function is not working properly at this moment. Please refresh the page and try again later.\n\nShare on your newsfeed", "WordPress Developer": "Kelowna, BC\n\nHere is the dealio. Cheeky Monkey Media is expanding their team and you might be just the code monkey they need. The reason we are looking for another hand is that we like to deliver the best to our clients.\n\nSo, there is that part of the job. Here is what we really need from you in order to meet our needs and our customers’ needs. You need to be able to code a WordPress template from scratch ( Yup, you better know what a PHP is). What can we say, sometimes we have clients that have unique needs and we need you to be able to come through with even the not-so-common requests.\n\nThe Front-end Developer that we hire should be laid back, but also appreciate our monkey humor. We are located on Leckie Road in Kelowna, British Columbia, so we are looking to fill one full-time position for that office.\n\nSo, now that we have your attention, what are some perks to working with a bunch of people who call themselves monkeys?\n\nFlexibility: You get to choose your hours and that’s pretty awesome. Your start time is also flexible. Because we roll like that.\nExtended Learning: Our team is all about attending events that help broaden our developer horizons.\nDiversity: Our team is not your average Developer team. We aim to please, but we also have a great time with it.\nTeam Meetings: The person that works with us locally will get to partake in some pretty kick-butt team meetings. There may or may not be beverages consumed.\nBackup: Unlike other companies, we will never let you fall on your monkey-butt. We work as a team and never leave a developer behind.\nCompetitive Pay: Our pay scale is competitive, so we won’t leave you out to starve. We value your talent and for that, you shall be rewarded.\n\nYour Development Duties Will Include\nAlways producing high-quality work and of course following the standards that Cheeky Monkey Media has set for itself.\nIt’s important that you are a deadline-oriented person. You have to be on time and available to take on small or larger projects. At some points in time, you may be asked to juggle several projects.\nTime management is a major part of your role. It’s vital that you stick to the time estimated to finish the project. If more time is needed, then it’s imperative that those concerns are addressed to the supervisor.\nCommunication is just as important as the air you breathe here at Cheeky Monkey Media. You should be available and willing to chat with other members of the team. If there is ever an issue, hopefully, you would feel comfortable enough to talk to your manager.\nTeam player mentality is also important. There are other Developers on the team and that means you should be willing to set aside your differences and work with them on a daily basis. At some point in time, you may also be asked to mentor a new Developer on the team.\nThe right Developer will also have experience in the following:\nAt least 2 years of working with WordPress\nOutstanding HTML/CSS/JS (including HTML5 and CSS3)\nAlways write clean semantic markup\nHave used third-party JavaScript libraries and frameworks\nWorking knowledge of back-end technologies and databases (PHP, MySQL)\nGood design sense\nAttention to detail (we like very pickythemers)\nGood sense of humor\nImpress us with\nKnowing Drupal\nUsing Sass or Less\nYour own personal portfolio\nWorking knowledge of CSS frameworks ( Foundation, Bootstrap etc..)\nAlways willing to learn new technologies\nCheeky Monkey Media might have other tasks/programs we need you to learn.\n\nHow To Apply\n\nWould you like to apply? If so, please send us your contact details to click apply", "ASP / ASP.Net Developer": "We are growing and need to expand our staff!\n\nCurrent Opportunities: ASP / ASP.Net Developer\n\nDescription\n\nThis is an exciting opportunity to be involved in a fast growing company.\n\nYour role will be to follow requirement or technical documentation to achieve the goal of system implementation from an ASP/presentation layer perspective. The stored procedures that contain the business logic will be provided to you for final certification. If you have experience in database development, this would be a definite asset.\n\nYou are not afraid of offering input into the specification as the project traverses through the life-cycle. We are a close-knit team and assist each other to ensure that our customers receive the best quality service for their dollar.\n\nSkill Set (required)\n\nVB ASP\nOur ASP code set is written in VB\nJava Script\nLocal edit checking and other controls are in Java Script\nMS SQL Server\nExperience in interacting with stored procedures is a must\nTesting\nYou need to be able to test software with confidence that it can go live after you\nUser Interface\nYou have experience in ensuring the user experience to gather and present information follows KISS\n\nPreferred\n\nAdditional Skill set (preferred)\n\nNet experience\nWe are leaning towards the large project being on this platform\n\nAdditional Knowledge\n\nPHP\nPayment gateway development\nExperience in this area would be an asset (Beanstream, Paymentech and PayPal)\nSQL Server\nDevelopment of stored procedures and table design an asset.\nPresentation layer\nDesign experience here would work out great!\n\nApplications\n\nIf you are interested in joining our team as a consultant or full-time, please submit your portfolio of example web sites developed with your résumé to click apply. Explanation of your role on each of the examples submitted will assist us with our evaluation.", "Java Developer": "Title: Java DeveloperJob ID: SP1903474119Location: Kelowna, BCOur client needs someone to build pioneering products that are used by thousands of users globally. You will work as part of an agile development team to write Java code for enterprise services. As Java Developer, you will get to tackle interesting and engaging problems to do with scalability and high availability in big data environments. This is an opportunity to work alongside some of the best Java developers in British Columbia and apply your craft in an environment that encourages creative thinking and autonomy. If you are passionate about business and technology; you are looking to challenge yourself by learning new technologies and apply your skills across different projects and application domains; if you are committed to code that is clean, well-tested, well-reviewed, performant and secure then this role is a good fit for you.Tech Stack: NoSQL DBs (Cassandra, MongoDB, HBase, ZooKeeper); In Memory Data Grids (Terracotta); Serialization libraries (Thrift, Protocol Buffers); Large scale data processing (Hadoop); Dependency injection frameworks (Guice, Spring); CQRS frameworks (Axon); Text search engines (Lucene, ElasticSearch)Responsibilities:Write unit and integration tests for your Java codeDesign, in collaboration with team, the software implementations that satisfy business requirementsCollaborate with QA in development of test cases for Java codeDevelop deployment systems for Java based systemsDocument code and document detail designsCollaborate with product owners on user story generation and refinementMonitor and support operation of production systemsParticipate in knowledge sharing activities with colleaguesQualifications:5+ years of Java developer experienceExperience with agile development methodologiestest driven developmentcontinuous integration systemsdependency injection containersnetwork protocols such as HTTP, TLS, TCPservice oriented architecture web services technology such as REST, JSON, or Thriftmulti-threaded programmingdesign patternsFor more information about TEEMA and to consider other career opportunities, please visit our website at", "Senior Java Developer": "Your Role\n\nAs a Senior Java Developer at Global Relay, you’ll be using leading edge technologies to build pioneering products that are used by tens of thousands of users globally to solve real world business problems. You also get to tackle interesting and engaging problems to do with scalability and high availability in big data environments. At Global Relay we are continuously pushing the boundaries of Java technology.\n\nThis is an opportunity to work alongside some of the best Java developers in British Columbia and apply your craft in an environment that encourages creative thinking and autonomy. Our software is developed by small, focused agile teams of developers and QA. We encourage our developers to think beyond a single component to build complete system solutions. Challenge yourself by learning new technologies, and apply your skills across our different projects and application domains. If you are committed to code that is clean, well-tested, well-reviewed, performant and secure then you’ll fit in around here.\n\nTechnologies In Use\nNoSQL DBs (Cassandra, MongoDB, HBase, Zookeeper)\nSerialization libraries (Thrift, Protocol Buffers)\nLarge scale data processing (Hadoop, Kafka)\nDependency injection frameworks (Guice, Spring)\nCQRS frameworks (Axon)\nText search engines (Lucene, ElasticSearch)\n\nRole Responsibilities\nWork as part of an agile development team to write Java code for enterprise services\nWrite unit and integration tests for your Java code\nDesign, in collaboration with team, the software implementations that satisfy business requirements\nDesign, in collaboration with the architecture team, the system architectures that satisfy business requirements\nCollaborate with QA in development of test cases for Java code\nDevelop deployment systems for Java based systems\nDocument code and document detail designs\nCollaborate with product owners on user story generation and refinement\nMonitor and support operation of production systems\nParticipate in knowledge sharing activities with colleagues\n\nTechnical Skills Requirements\nMinimum 8 years of Java developer experience\nExperience with agile development methodologies\nExperience with network protocols such as HTTP, TLS, TCP\nExperience with service oriented architecture\nExperience with web services technology such as REST, JSON, or Thrift\nExperience with multi-threaded programming\nExperience with design patterns\nExperience with test driven development\nExperience with continuous integration systems\nExperience with dependency injection containers\n\nAbout Us\n\nGlobal Relay is the leading provider of cloud-based archiving, supervision, eDiscovery, and analytics for the global financial sector. We deliver services to 23,000 customers in 90 countries, including 22 of the top 25 global banks. Our market-leading archiving service supports email, instant messaging, Bloomberg®, Thomson Reuters, social media, mobile messaging, and more – with mobile, Outlook, and web access.\n\nOur Global Operations & Development Center is located in Vancouver, BC, Canada. In addition, we have offices in six other cities across the world, including major financial centers like New York, Chicago, and London.\nOver the years, we have won several major awards, including:\nCompany of the Year from the BC Tech Association (2016)\nCanada’s 50 Best Small and Medium Employers (2014, 2015)\nCanada’s Top Employers for Young People (2014)\nCanada’s Top 10 Most Admired Corporate Cultures (2013, 2016)\nCanada’s Best Managed Companies (2013 - present)\nTechnology Fast 50 – Leadership (2014, 2018)\nWe provide fantastic opportunities to individuals passionate about business and technology. For those with international business aspirations, we offer invaluable opportunities for doing business with some of the world’s largest, most influential firms. Our company is also perfect for those who want to create cool technology using massively scalable, big-data architecture, with a strong focus on mobile.\n\nTo learn more about our business, culture, and community involvement, visit www.globalrelay.com .\n\nThink you're a great fit for this job? Apply today with your cover letter and resume.\n\nOptions\n\nApply for this job online Apply\n\nShare\n\nEmail this job to a friend Refer\n\nSorry the Share function is not working properly at this moment. Please refresh the page and try again later.\n\nShare on your newsfeed", "Ecommerce, Drupal Website Developer In Canada": "If you want to work with an exceptional group of people, in a great location, with numerous benefits and a terrific corporate culture—your are on the right page.\n\nAcro Media is looking for a Drupal E-commerce websiteDeveloper to develop Drupal 8 and Commerce builds. Someone who can code like it’s their native tongue but still talk to our crew comfortably and sometimes even the odd client.In order to apply for this position you must be able to live and work, legally in Canada.\n\nWe consider ourselves a laid-back bunch but driven to do well for our customers. We’re looking for low egos and high skills. You can be young and inexperienced or a savvy veteran, what we’re really looking for is your ability to code, which may be finely honed skill or raw talent at this point.\n\nWe aren't looking to stick you in a corner with headphones on and call you “the IT department”. Developers own this joint; we get it. If you’re desperate to break free from that office life where you co-workers have never even heard of Minecraft, and want to come on board to build kick-ass commerce sites, corporate gems, and the occasional game, keep reading.\n\nAs the successful candidate, here are some things you’ll be responsible for:\n\nMust have Drupal Experience and be able to provide example work***\n\nProducing high quality work adhering to Acro Media standards and following the Acro Media production process\n\nImplementing updates & revisions to web sites\n\nHighly proficient in spoken and written English\n\nContributing code back to the Drupal community, testing and responding to issues, maintaining modules.\n\nWorking independently on multiple smaller tasks or larger builds with shifting priorities and tight deadlines\n\nAdhering to and providing accurate estimates for the amount of time required to repair a defect, a build, or to add additional functionality to an existing application\n\nProviding efficient solutions in a timely manner for work requests, issues, and defects\n\nCommunicating well with Account Managers, Supervisors, and Clients in regards to work requests, problems and defects\n\nActing as both a peer/mentor to other Developers as well as be comfortable asking for help from team members\n\nThe Successful Applicant Will Have\n\nAbility to find and fix problems in code, this might not be your code and your only hint might be a cryptic complaint from a client.\n\nA good mix of web development skills, you should be able to build out site template and then code all the gears and pulleys behind the scenes as well, we try not to have people who do all HTML/CSS and people who do all backend coding, we like people who can multi-class. You’re not going to work on the same thing for 8 months. If you only have experience on embedded systems or just design sexy layouts, maybe try to brush up on your weaker areas, we are open minded though so don’t let this scare you away.\n\nOur designers use Photoshop, so when you’re building out the templates, it’s good to know how to navigate around this application. Basic knowledge of how layers work, and the use of some the more important tools that are required for taking apart the design and deriving all the images for web-use is a plus.\n\nWe're Open To Good Programmers Who Know Other Languages And Technologies And Are Will To Learn, But Below Is a List Of a Bunch Of Stuff We Normally Work With\n\nHas Drupal work to send us\n\nPHP\n\nSQL\n\nCSS3/HTML5\n\nJavascript/jQuery\n\nXML\n\nBonus: C++/Objective C/C#/C\n\nIf you know other languages don’t forget to mention them, if you are a badass Lisp hacker type, mention that.\n\nComfortable working in a Linux shell to do day-to-day tasks. Hopefully, you have installed Linux on something at least once, even if it was just your Xbox, phone...or vacuum etc. (For real, though, you can get Linux installed on a Roomba)\n\nSome understanding of Linux hosting if at all possible. Have you configured your own server? Did you setup a web server for your house or friends, even if no one else really cared?\n\nPrior experience with a source control system (ex, SVN, Git, GitHub, etc.)\n\nFormal education or prior experience is NOT required, we just want to know that you can code, so you’ll have to have some work you can show us.\n\nAll offers of employment with Acro Media Inc are contingent upon the candidate having successfully completed a criminal background check.\n\nCompensation: $26.32/hour\n\nLocation: Acro Media Inc,#103 2303 Leckie Road, V1X 6Y5, Kelowna\n\nBenefits: After 6 months MSP will be covered, extended benefits offered after 1 year of employment\n\nWorking Conditions: Office environment\n\nPeriod of employment: Contracted for minimum of 2 years.\n\nHere are some things we pride ourselves on being able to offer our staff:\n\nFlex start times & Earned days off:You will be required to work 35 hours a week.Do you prefer to start at 8:00? or 9:00? We'll work with you. Want every second Friday off? Well we've got a program for that too!\n\nPaid Overtime for all roles...including salary positions: What? What?! Yep you heard right. We pay for all approvedOT...not that we want everyone working so hard,but with the natural ebb and flow of our industry sometimes it's needed to blast out the OT in order to keep our heads above water. We findthis little pay chequenugget is a nice reward for the over timerz.\n\nSlappies: Tougher to explain but once a month we get together and have a little ceremony, some food, a few brews - no altars or corporate chants involved.\n\nFun day: We aim to have fun every day; however, every year for a day we cram a bunch of fun on ourselves. Weee!\n\nSPARC Events: Sometimes we have an in-house breakfast, team building events, (less corny than it sounds), competitions, or just a plain little reward for no reason. It's a little spark in our usually normal days. Warning, we make you wear costumes. Often.\n\nCulture: We're a certain type of people. We're all a little different and unique in our own way but we seem to work well together. No one’s perfect and we embrace that. We take our work seriously, but we don't take ourselves too seriously. Check out our site to get to know us!"}