{"People & Talent Manager": "People and Talent Manager in Kelowna\nExperienced in HR programs and talent acquisition? Looking for a new opportunity at a fast-paced studio that works on original IP?\nAs the People and Talent Manager at this studio in Kelowna, you will take on responsibility for driving innovation through leadership of all People practices throughout the studio. You will be building HR systems and processes to support the people who work there, whilst also working on some more day-to-day tasks.\nThe studio aims to connect people through entertainment. They continuously invest and coach their people and have a lot of respect for the unique and creative approaches that different people are able to bring to the table. As a part of the team you will benefit from profit-sharing bonuses, relocation support, health and dental care and an annual self-development budget!\n\nPeople And Talent Manager Key Responsibilities\n\nDesign and execute HR programs that drive performance and development\nEstablish and support a positive culture within the studio and team\nLead talent acquisition, job evaluations, onboarding and more\nStay on top of industry best practices to implement policies to ensure compliance with company guidelines\nCoach team members to aid their professional growth\n\nEssential Requirements For This Role In Kelowna\n\nSignificant experience in progressive HR within a tech or start-up environment\nHold a relevant post-secondary education certification in HR ideally CPHR designation\nProficient in Google Suite and HRIS systems\nIf youd like to apply to this role, contact jr@skillsearch.com, or apply online now by submitting your CV below.\nTags: Talent Acquisition, Recruitment, Director, People Culture, Mobile Games, Canada, Video Games\nA little bit about the city: Kelowna\nLocated in British Columbia, Canada, and on the shore of the beautiful lake Okanagan, Kelowna is a city just east of Vancouver, without the Vancouver price tag! If youre looking for beautiful scenery, you will be spoilt for choice in Kelowna. Residents can enjoy hiking in the mountains, water sports on the lake and a nearby ski resort offers a ski and snowboarding paradise. There are several neighbourhoods in Kelowna, but Glenmore is known for accepting newcomers to the city, and is also perfect for families, although there are many other neighbourhoods to choose from if youre looking for a more young and fun feel.\nSeniority Level\nAssociate\nIndustry\nMarketing & Advertising Computer Software Staffing & Recruiting\nEmployment Type\nFull-time\nJob Functions\nHuman Resources", "Part-Time Marketing Associate in Kelowna": "We are filling the final spots on our student marketing teams through the area as we begin marketing our home servicing business for the 2020 season! We are looking for motivated, personable people that want a job that rewards them for how well they do it!\nWhat's this thing all about?\nWork in a fast paced environment, can't be bored here!\nPerformance based pay - the harder you work and more skills you build, the most you will earn!\nThe ability to set your own schedule (work takes place on evenings and weekends)\nWork local! We operate all over the place!\nA great way to gain sales experience and interpersonal skills! People who enjoy other people tend to excel in this role.\nPotential for future promotion opportunities in future summers - We like to promote and build our people!\nWhat will you do?\nBreath some fresh air while getting some exercise and getting to meet a bunch of cool new people in your neighborhood!\nGenerate window cleaning, eavestrough cleaning and siding cleaning customer leads through door-to-door marketing offering free estimates, earning $15 per lead. You can make between $15-$25+ per hour depending on your performance!\nSchedule estimates for local student production managers\nPotential to learn to perform estimates and schedule work if succeeding in generating leads\n\nWe will be connecting with candidates who are interested in the next short while, and look to have our team hired as soon as possible!\nIf you are interested in learning more about what we do, please reply with your resume!", "Future Opportunities: The Source - Sales Associate - Kelowna, Orchard Park Mall": "The Source is Canada’s largest tech retailer, and every day we come into work excited to share cool tech and amazing brands with our fellow Canadians. From your local shopping centre to cool music festivals, we are where Canadians live, work and play.\n\nEvery day our Associates across the country help Canadians find the tech they want and need. The Source is a great place to work and we are committed to your development through best in class training programs that help you do your best. Behind our in-store Associates is a supporting team of professionals who curate our product assortment, ensure on-time deliveries, create engaging marketing campaigns and help keep our systems running at peak capacity.\n\nWe are passionate about what we do and look for individuals with their own passion, curiosity and genuine helpfulness to join us!\n\nWhat You’ll Do\nYou’ll be a passionate brand ambassador\nYou’ll contribute to the team’s success by achieving personal sales goals\nAs a Sales Associate, you’ll be an expert in all things tech, and you will help build easy solutions for our customers\nYou will work closely with your teammates to ensure the store is running at its peak operational performance\nYou will stay ahead of the curve by completing training regularly – and then share what you’ve learned with others\n\n\nWhat You’ll Need\nYou need to be passionate about connected technology and how it impacts people’s lives\nYou will need to have great people skills – for example: being a good listener, able to build relationships, and able to overcome objections\nA natural curiosity about technology, telecommunications, and sales\nExperience in retail or sales a definite asset\nYou’ll need to be flexible: ability to work weekdays, evenings, and weekends is a must\n\n\nWhat You’ll Get\nYou’ll be exposed to hands-on and handheld training – get ready to learn!\nOur rewards and recognition programs are vast: enjoy variable pay based on your personal sales, as well as other cool incentives like chances to win trips abroad or even seeded devices\nYou’ll enjoy a compensation package that includes a base wage plus uncapped commissions: most of our associates make between $16 and $19 hourly*\nYou’ll get awesome discounts on nearly all of our products\nThinking about building a career with us? Explore endless internal opportunities in both retail and in corporate roles\nThis range is not a guaranteed rate. The range presented is an approximation based on current associates’ commissions and base wages. As it is an uncapped structure, associates may make more than presented, though associates are guaranteed their base wage as outlined by their employment contract.\n\nPosition Type: Retail Stores\nPosition: Sales Associate\nJob Location: Canada : British Columbia : Kelowna\nApplication Deadline: 04/01/2020\n\nAs Canada's neighborhood tech retailer, we're proud to offer a competitive compensation package including an extensive recognition and rewards program, career development opportunities, multi faceted training programs, competitive medical and dental benefits, charity and volunteer opportunities and of course, associate discounts!\n\nThe Source celebrates and embraces diversity as part of our culture. We strive to be an inclusive, equitable and accessible environment that supports both our internal and external customers, ensuring everyone feels valued and respected.", "Cellar Hand": "Cellar Hand\n\nCedarCreek Estate Winery\n\nKelowna, British Columbia\n\nPermanent, Year-Round\n\nAbout Us\n\nOur Winery is in the heart of British Columbia’s Okanagan Valley, building on more than three decades of winemaking, and defining a new chapter with bright, expressive North Okanagan wines. Our year-round tasting room and Home Block restaurant, housed in contemporary farmhouse buildings, offer our visitors an exceptional experience in a serene natural setting.\n\nOur Winemaking\n\nCedarCreek sources organically farmed fruit from estate vineyards between Kelowna and Osoyoos, with production split approximately half between white and red. Our facility is a certified organic production facility with plans to convert 100% of viticulture and winemaking to organic by 2021. We have the capability to sort to individual berries, and we ferment in concrete, stainless, and oak, with one of the largest barrel programs in the valley. We use techniques such as whole bunch press, skin contact, extended maceration, and spontaneous fermentation and malolactic fermentation to help build personality into our wines across the spectrum.\n\nOur emphasis is on cool climate varieties - Pinot Noir, Chardonnay, Riesling, Pinot Gris, and Sauvignon Blanc. We have 35 acres planned for planting at CedarCreek in 2020 and 2021 with a focus on building a self-sustaining property from a winemaking and culinary perspective. This exciting opportunity to be a part of a winery team goes well beyond winemaking to other parts of the business.\n\nDay In The Life\n\nOur Cellar Hands contribute as a member of our winemaking team dedicated to producing world-class wines and providing the finest and most intimate estate winery experience. They participate in the execution of all winemaking activities at the CedarCreek Estate Winery related to the production of our VQA - British Columbia wine portfolio.\n\nWant to know more? You will…\nCoordinate and execute all aspects of cellar activities - with a strong emphasis on attention to detail.\nAssist in monitoring of the qualitative and analytical states of all wines.\nEnsure presentation, organization and sanitation of the cellars is always of the highest standard.\nAssist with bottling (as required) - labour requirements, finished goods shipping, production records and any other related details.\nExecute the shipping and receiving of goods from and to bottled-wine warehouse.\n\n\nMust Haves\nUniversity degree in Oenology/Winemaking or applicable Science Related Field (preferred); Diploma in Oenology/Winemaking or applicable Science Related field (minimum requirement).\nIdeally a minimum of 2 harvest experiences, preferably one international,\nProficient in operation of all production equipment.\nMust have complete knowledge of the operation and correct application of cellar equipment.\nAbility to prioritize and manage multiple projects at one time.\nStrong computer literacy experienced with MS Office and the ability to learn and use company wine inventory system (VinTrace).\nExcellent oral and written communication skills.\n\nCedarCreek is dedicated to the growth of our team and provides excellent internal opportunities for those who are committed to learning and personal development. This permanent, year-round opportunity offers a competitive compensation package including 3 weeks’ vacation, extended health & dental benefits, and eligibility to participate in a DPSP and RRSP matching program.\n\nIf this sounds like you, head over to our website at www.cedarcreek.bc.ca, and submit your online application today. Interested in spending Harvest 2020 with us?! Please apply with harvest in your resume title!", "Field Service IT Technician": "Vodastra Technologies is seeking a Field Service IT Technician to join our team! You will resolve computer-related issues for your clients.\n\nResponsibilities\nProvide technical assistance with computer hardware and software\nResolve issues for clients via phone, in person, or electronically\nRecommend hardware and software improvements\nTrack customer issues and resolutions\n\n\nQualifications\n\nPlease contact Chris@469-469-0455 or chris.pierson@vodastra.com if you meet these qualifications.\nPrevious experience in IT, customer service, or other related fields.\nStrong troubleshooting and critical thinking skills.\nPrinter/copier and laptop/desktop experience, technical training, or equivalent combination of education and technical experience.\nComputer skills including Microsoft Office Products, networking, and internet browsers.\nKnowledge of using diagnostic tools, service aids, and product schematics, to assess and resolve equipment and system failures\nAbility to maintain and complete accurate record keeping and processing of paperwork.\nMust work well independently, as well as follow directions.\nAble to handle more than one responsibility at a time.\nAble to work under deadline pressures.\nStrong communication skills, organizational skills, and time Management.\nAbility to build rapport with clients.\nPositive and professional demeanor\n\nPowered by JazzHR", "Specialist: Bike Mechanic - Kelowna Store": "The WHY\n\nWhy MEC?\n\nMEC is more than a store, and we’re more than a place to buy hats and backpacks. We’re physical and digital hubs for the outdoor community. People connect here, through our stores, online channels, over the phone, or through one of our leading events, clinics or services.\n\nMEC is an equal opportunity employer. We’re proud to work with our people to create a diverse workplace, which accommodates individuals of all abilities, backgrounds and identities. We welcome and encourage applications from people with disabilities. Tell us what you need during the hiring process, and we’ll do our best to accommodate you.\n\nWhy YOU?\n\nIf you like working with an inclusive, hands-on, collaborative team, who connect people with quality products to encourage active outdoor lives, then this is the team for you. MEC is an awesome place if you’re always learning and trying new things, like bouldering, yoga or trail running!\n\nYou are good natured and have a welcoming vibe. You’re outgoing and genuinely like helping people. You’re stoked about being active outside. You have flexibility to work a variety of shifts from Monday to Sunday. Bonus points if you have retail or customer service experience.\n\nThe HOW\n\nYou connect with members by sharing your passion for an active lifestyle. You ask open-ended questions to build loyalty with members by demonstrating product knowledge and by understanding their needs. You’re stoked to share MEC clinics, services and events. The leadership behaviors we look for at MEC - personal integrity and awareness, customer focus, driver and character, team work and ability to develop self and others - are part of your skill set.\n\nThe WHAT\n\nMechanics\n\nYou assemble, maintain and repair bicycles within MEC's productivity, quality and safety guidelines. Mentor and train frontline staff about bike repair processes and procedures. You do all repairs with MEC sustainability principles in mind. In winter, bike mechanics help in our ski shop, so you’ll also install, adjust and repair ski bindings.\n\nWhat Great Looks Like\n\nYou inspire members to be part of the MEC community through exceptional gear, product knowledge, member service, clinics and events. Members are the reason for everything we do so we listen and respond to them. We provide exceptional service in every interaction.\nSeniority Level\nEntry level\nIndustry\nMarketing & Advertising Internet Retail\nEmployment Type\nFull-time\nJob Functions\nOther"}