{"Cloud Developer - Canada": "Cloud Developer\n\nCanada | Remote | Work from Home\n\nWhy you?\n\nAre you a Canadian based Cloud Engineer or Full Stack Software Developer who can provide consulting services to Pythian’s global clients including planning, designing and implementing new solutions using the latest Cloud and Big Data technologies? Do you want to work on large scale custom consulting projects? Do you want to work remotely to implement and help develop cutting edge solutions, create data pipelines which will migrate data from customers on-prem systems and load it into a cloud hosted Enterprise Data Platform ? If you have a passion for big data and solving complex problems then this could be the job for you!\n\nWhat will you be doing?\nWorking with our Cloud Architects to design and develop end to end Cloud based solutions with heavy focus on application and data, all with good understanding of underlying cloud infrastructure\nBe part of a team of globally dispersed Cloud Consultants, supporting other members of the team in overcoming challenges, removing roadblocks and developing options and solutions\nWorking on complex and varied Cloud Data focused projects such as migrating business-critical applications to the cloud, re-platforming or re-architecting difficult data and analytics use cases; Migrate existing data warehouses from on-premise data center or from one cloud provider to another. As an example of our migration approach, read about our Teradata to Google Cloud Platform migration service.\nHelp our customers to grow from a data warehouse into a true cloud-native data platform with full multi-source data ingestion and integration.\nBuild or move analytic workloads to the cloud for better scalability and efficiency.\nTranslating complex functional and technical requirements into detailed designs.\nWriting high-performance, reliable and maintainable code.\nAutomate, create reusable accelerators to help get the job done quicker and better\nPerform data processing requirements analysis and data flow integrations with external systems.\nSecuring components of clients’ Data platforms.\nDiagnostics and troubleshooting of operational issues. Perform Health-checks and configuration reviews.\nAssisting client developers and advising on efficient data access and manipulations.\n\nWhat do we need from you?\nWhile we realise you might not have everything on the list to be the successful candidate for the Cloud Consultant job you will likely have at least 5 years experience in similar roles. The position requires specialized knowledge and experience in performing the following:\nBe fluent in a couple of object oriented language, preferably Java and Python, familiarity with Scala and Go would be a plus.\nExperience building end to end software on Google Cloud Platform (GCP), Amazon Web Services (AWS) or Microsoft Azure.\nGood knowledge of popular database and data warehouse technologies & concepts from Google, Amazon or Microsoft (Cloud & Conventional RDBMS), such as BigQuery, Redshift, Microsoft Azure SQL Data Warehouse, Snowflake etc.\nExperience with GCP Dataflow, AWS Glue, Azure DataFactory or any equivalent would be great\nExperience in data modeling, data design and persistence (e.g. warehousing, data marts, data lakes).\nGeneral knowledge of modern data-center and cloud infrastructure including server hardware, networking and storage.\n\nWhat do you get in return?\nCompetitive total rewards package\nFlexible work environment: Why commute? Work remotely from your home, there’s no daily travel requirement to an office!\nOutstanding people: Collaborate with the industry’s top minds.\nSubstantial training allowance: Hone your skills or learn new ones; participate in professional development days, attend conferences, become certified, whatever you like!\nAmazing time off: Start with a minimum 3 weeks paid time off, 7 sick days, and 2 professional development days!\nOffice Allowance: A device of your choosing and personalise your work environment!\nFun, fun, fun: Blog during work hours ; take a day off and volunteer for your favorite charity.\n\nWhy Pythian?\n\nPythian excels at helping businesses use their data and cloud to transform how they compete and win in this ever-changing environment by delivering advanced on-prem, hybrid, cloud and multi-cloud solutions to solve the toughest data challenges faster and better than anyone else. Founded and headquartered in Ottawa, Canada in 1997, Pythian now has more than 300 employees located around the globe with over 350 clients spanning industries from SaaS; media; gaming; financial services; e-commerce and more. Pythian is known for its technology-enabled data expertise covering everything from ETL to ML. We pride ourselves on our ability to deliver innovative solutions that meet the specific data goals of each client and have built meaningful partnerships with major cloud vendors AWS, Google and Microsoft. The powerful combination of our extensive expertise in data and cloud and our ability to keep on top of the latest bleeding edge technologies make us the perfect partner to help mid and large-sized businesses transform to stay ahead in today’s rapidly changing digital economy. If you are a Cloud Consultant; live in the United States or Canada; love your data and want to love your career then join us!\n\nIntrigued to see what a job is like at Pythian or check us out @Pythian and #pythianlife . Follow @PythianJobs on Twitter and @loveyourdata on Instagram!\n\nNot the right job for you? Check out what other great jobs Pythian has open around the world! Pythian Careers\n\nDisclaimer\n\nFor this job an equivalent combination of education and experience, which results in demonstrated ability to apply skills will also be considered.\n\nPythian is an equal opportunity employer and welcomes applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\nThe successful applicant will need to fulfill the requirements necessary to obtain a background check.\n\nApplicants must be legally authorized to work in their country of residence permanently– Pythian will not relocate, sponsor, or file petitions of any kind on behalf of a foreign worker to gain a work visa, become a permanent resident based on a permanent job offer, or to otherwise obtain authorization to work.\n\nNo recruitment agencies\nSeniority Level\nEntry level\nIndustry\nInformation Technology & Services\nEmployment Type\nFull-time\nJob Functions\nOther", "Mobile Mortgage Specialist": "Description\nAre you autonomous, organized, disciplined and hard working?\nDo you view the opportunity to work entirely on commission as a plus?\n\n\nWith National Bank, you benefit from working with a large established company, covering a large territory (with all the potential it has to offer), and enjoying flexible working conditions, while helping local people build their lives.\n\nBy joining National Bank as a Mortgage Specialist, you will be working with three different groups of people in your territory: clients, real estate agents and internal partners.\n\nIn This Role, You Will Be Expected To\nOffer outstanding service to your clients by helping them find the best mortgage strategy for their needs\nEstablish and maintain lasting business relationships with real estate agents and/or builders by keeping them informed of the products and services we offer\nWork closely with target branches to identify and meet clients' internal and external refinancing needs\nCommunicate and work effectively with internal partners to improve client retention, client onboarding in branches and cross-selling by referring clients to the most appropriate partners\nKeep current on National Bank products and market trends in order to act as an expert in your field\nAttend meetings and training seminars considered essential for you to provide high quality service\nAttend various business development and recognition activities\nAdhere closely to established processes and procedures to produce high-quality files that comply with current standards and regulations\nThe candidate needs to be able to identify all risks inherent to the Personal and Commercial Banking sector’s activities.\n\n\nQualifications\nA Bachelor's degree in a related field and one year of relevant experience or a college diploma and three years' relevant experience\nBusiness development experience\nAbility to work under the pressure of meeting business development targets\nStrong interpersonal skills and ability to manage various internal and external stakeholders\nKnowledge of financial products, an asset\nRigour and excellent IT skills\nBilingualism (English and French), an asset\nNational Bank sees diversity as a great source of wealth and values it in all its dimensions. Its objective is to offer an open, respectful work environment where all employees can achieve their full potential. Senior management's concrete commitment helps spread this value across all sectors in the organization. The Bank has been ranked among the top employers for diversity in Canada for several years.", "Senior Software Engineer": "Filtering the negative to make room for the positive.\n\nAt Two Hat, our mission is to help social networks build safe and healthy online communities by removing negative interactions to make room for positive human connections. We believe that everyone should be free to share online without fear of harassment or abuse.\n\nProcessing nearly 30 billion interactions a month, Two Hat enables clients across a variety of social networks and gaming companies to deliver positive user experiences by detecting and filtering harmful content in real time, before it reaches the community. More than just a filter, we provide an all-in-one content moderation solution, with data analysis, content escalations, flexible workflows, auto-moderated user reports, and more. Clients benefit from our scalable, autonomous, and transparent solution, as well as our team of industry experts who consult on best practices and industry standards. As a leading provider of content moderation best practices, we believe we can restore the original purpose of the internet - to empower positive human connection and facilitate healthy social online interactions. \n\nRemoving illegal content is a shared responsibility. To that end, we work with international governments and law enforcement in helping to prevent the targeting of children through the internet, and train AI to detect new child exploitation material.\n\nWho you are\n\nWe are looking for a complex problem solver with a delivery mindset to join our team as a Software Engineer. In this role, you’ll build out and scale our products as well as drive continuous improvements to our flagship automated moderation product CommunitySift and its ability to process data at a massive scale. \n\nWhat’s in it for you? \n\nPurpose and impact. We’ve said it a few times, but what we do matters. We are building solutions that make a difference. This is your chance to be part of an organization adding true value and meaning to the world.\n\nCutting edge technology. You want to work with deep learning loops; collaborate with Data Scientists to build fast AI that encompasses natural language processing; build our classifiers, both algorithmic or machine learning. You want to:\nExecute on Agile SaaS-based tool development. You will develop and iterate new features and functionality for our web and mobile products.\nLead architectural discussions. You will identify architecture and infrastructure problems - and solutions.\nCollaborate. You will be a key member of the product development team; assisting with operations and information security.\nPlan and advise. You will execute on tactics that support the technology vision for the product and the organization as a whole.\n\nGrowth and challenges. You want to bring your knowledge, expertise and lessons learned to influence and help build out our architecture and processes. You want to move between our three engineering teams, features, maintenance and platform, gaining exposure to all of our products and working on complex client projects. You want to be part of a well-supported and close-knit team with the freedom to work remotely. You want to share your thoughts on how to solve challenges beyond what anyone else out there is taking on in AI, ML and NLP.\n\nWhat you bring\n\nTechnical expertise. You have experience in a cloud development environment building high availability SaaS applications that serve 100,000+ requests every second. You have hands-on expertise with object-oriented programming; knowledge of Python, Javascript, C/C++, JIRA, Git/Github are all beneficial. You have a strong understanding of best practices for Security.\nA passion for Agile. You thrive in a fast-paced and Agile Kanban environment. You can:\nWork with Product Managers to translate user stories into actionable tasks.\nCollaborate with the engineering team to scope tasks and provide estimates.\nDevelop solutions to meet acceptance criteria.\nA growth mindset. You think big and keep up to date on emerging trends and industry best practices. You are open to feedback and on a personal mission to pursue new learnings at every opportunity.  \nA delivery focus. You have a proven track record managing competing priorities while maintaining an ability to execute on time, beyond expectations.\nAn innovative team approach. You are a team player with a positive attitude punctuated by high energy, initiative and perseverance. You can effectively build working relationships, be accountable and coordinate resources with cross-functional teams.\n\nJoin us\n\nOur CEO and Founder is a visionary who believes in a better internet for everyone- and it’s a vision each one of us stands behind. Sure, it’s a lofty goal; and maybe it sounds impossible…but we don’t think it is. Our technology is capable of more now than when we started, but unsafe users are growing increasingly deceptive. We continue to step up our game and meet those challenges at every turn. \n\nRight now, we are growing and we aren’t slowing down anytime soon. We are looking for brilliant, innovative and deeply conscientious people to join our team and be part of our mission. This is a place where:\nWe have an evolving startup culture of fiercely dedicated and collaborative individuals.\nA tech giant praised us for tackling - and solving - a highly complex chat feature.\nWe coordinate and run an “Amazing Race” event celebrating our six year anniversary.\nSpot rewards are handed out by the CEO.\nWe host a “Mug Club” which is our version of a Ted Talk presented by anyone with a bright idea.\nPink Shirt Day means something to us on a deeper level.\nWe participate in local acts of good, both big and small, to bring a little joy to our community.\n\nIf you are driven to make the world a better place; you share our growth mindset; and you have built your talent on a foundation of hard work and creative thinking, join us.\n\nTwo Hat welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\nDue to COVID-19 please expect changes to our standard recruitment process. In all instances, the safety of our employees and our candidates is of our utmost concern so we will be conducting interviews virtually and online. We will keep you informed on these changes and ensure that you are prepared in advance with the necessary instructions to conduct the next steps in the recruitment process.", "Concierge Non Union": "If you’re passionate about being a part of a team that is, committed to the Team Member Experience and driven by innovation and growth, then join us! Health and Dental Benefits are available with no waiting period for successful candidates.\n\nThe Concierge is a critical role within our communities as it impacts the lives of residents and ignites the warmth of human connection.\n\nAs a Concierge your typical day will impact in the following ways:\nResponding to all resident and visitor enquiries as their first priority in a diplomatic manner, utilizing problem solving and complaint resolution skills and ensures all complaints are forwarded to the General Manager in writing.\nPromoting excellent customer service in all personal interactions with visitors, families, residents and team members.\nGreeting all visitors to the building and ensures that their needs are addressed in a pleasant and unhurried fashion and conducts mini tours in accordance with policies and procedures.\nProviding clerical and computer support to all managers as requested.\nCompleting required records to support cash transactions related to the sale of guest and team member meal vouchers / tickets.\nPerforming other duties as assigned.\nMust Haves\nCompletion of grade 12 education.\nExcellent verbal and written communication skills.\nPositive attitude and proven customer service skills through related work experience.\nProven organizational skills and ability to multi task.\nMust demonstrate computer proficiency with MS Office, specifically Excel, Word, and Power Point.\nAll applicants must successfully pass the prescribed Vulnerable Sector Check. Applicable to Ontario applicants.\nAll applicants must successfully pass the prescribed Criminal Records Check. Applicable to British Columbia applicants.\nBonus Points For Having\nAdditional applied courses i.e. office administration preferred.\nAct upon your desire to help others and Join Sienna Senior Living as we continue to enhance the lives of those we serve.\n\nFor Ontario locations, in accordance with the Accessibility for Ontarians with Disabilities Act 2005, upon request, support will be provided for accommodations throughout the recruitment, selection and assessment process.", "Business Systems Analyst": "The Business Systems Analyst is responsible for supporting the implementation of new systems and changes to the existing ones. To succeed in this role, resourcefulness is a necessary skill to have, and you not only enjoy variety, but thrive in a changing and fast-paced environment. You should have the patience to communicate with a variety of interdisciplinary teams and users. Your goal will be to ensure that our systems are stable, reliable, integrated and support the business to run smoothly and efficiently.\n\nResponsibilities:\nSupport the implementation and integration of new enterprise systems and technology\nDetermine ongoing information needs and translate them into functional and technical requirements\nIdentify system changes and complete the installation, configuration, initial data loading, testing and hand over to production, by working with software vendors and/or internal staff\nSupport business software. Perform troubleshooting to diagnose and resolve problems\nPerform proactive system maintenance for excellent performance and optimization\nCreate dashboards, reports, and assist users with ad-hoc requests for data extracts and analysis\nEvaluate training needs, develop training materials and provide system training to existing and new users\nCreate and maintain documentation for all aspects of business systems\nOther project work, as assigned by management\n\nQualifications:\nDiploma/degree in Computer Science, Management of Information Systems or related, plus a minimum of 4 years’ recent experience in a similar role\nExperience with business analysis in an enterprise environment, including requirements gathering, UAT, software implementation, project management methodology, change management and version control\nGood knowledge of Microsoft cloud technologies: Azure AD, O365, SharePoint, Teams\nGood knowledge of various enterprise systems, e.g. IT ticketing, quality management, manufacturing, scheduling, HRIS, etc, and reporting tools, e.g. Power BI, Tableau, Power Pivot, etc. ERP experience is an asset\nAbility to analyze business problems by looking at both process and technology\nResourcefulness and problem-solving aptitude\nClear communication and presentation skills\nAbility to deal with multiple tasks, prioritize, change quickly and work under pressure\nCuriosity, enthusiasm and a passion for technology\nClean criminal record check", "STRATEGIC INFORMATION ANALYST": "STRATEGIC INFORMATION ANALYST\nJob ID 1391448 Date posted 04/15/2020\nJob title :STRATEGIC INFORMATION ANALYST\nCommunity :KELOWNA\nFacility :KELOWNA CHSC\nStatus :PERMANENT FULL TIME\n\nPosition Summary\n\nWe are seeking a Strategic Information Analyst to join our Strategic Information Management team in Kelowna, BC.\n\nThe Strategic Information Analyst will be responsible for supporting strategic information planning, analysis, and decision support within a defined portfolio. The Analyst will be part of the Strategic Information Management Department but will work closely with the Manager or Lead of the assigned portfolio and key internal stakeholders.\n\nTypical Duties And Responsibilities\nProvides timely, relevant, reliable, and clear information with appropriate supporting data analyses and review of alternatives to inform planning and decision-making. This will include population, service utilization, and outcomes analyses and information for use by facilities planning, senior leadership, program Managers, and healthcare providers as well as for public information.\nProvides data analysis using key data sources (population, clinical, organizational, and administrative) in response to strategic and corporate services, senior executive, and program level requests for information and analysis. This work may include data linkage, descriptive information, statistical analyses, and statistical tests of significance.\nReviews planning and evaluation documents as well as plans for allocating resources and provides appropriate information and feedback. This will include health services plan and program planning documents prepared by Interior Health (IH) Health Services planning, Facilities Management, and program staff. Information and feedback will include providing assistance with population and utilization data as well as feedback on planning assumptions.\nProvides input and identifies opportunities for information support activities to the Corporate Director, Information Management. This will include providing suggestions and advice on important data development and future projects/analyses.\nDevelops a strong working relationship with program Managers, Directors, Senior Executive members, Business Support, and others who require information for planning, managing, and evaluating services. Project support may include planning project deliverables and identifying data sources and appropriate methods to support planning, data analyses, writing summary reports, and preparing presentations.\nResponds to data and information requests from staff at all levels of the organization. Provides support and technical advice to staff on the use of strategic information resources and applications.\nWorks with provincial and national representatives on strategic information projects. This may include working with the Canadian Institute for Health Information and Ministry of Health priority projects. The focus of this work will be to review key assumptions and methods, provide data, and assist with interpretation of findings.\nWorks with representatives of other Health Authorities and other data custodians to support strategic information, analysis, interpretation, and reporting initiatives.\nProvides advice, analysis, and recommendations on initiatives related to data collection, database development, and data extraction and analysis to Information Support and Research.\nWorks with Information Management/Information Technology and other IH staff to support timely, reliable, and consistent data reporting and analysis.\nPerforms other duties as assigned.\nQualifications\n\nEducation, Training, and Experience\nA post-secondary degree with completed course work in a health-related discipline, and/or an equivalent combination of education and experience. A Master’s degree is preferred.\nA minimum of two years of experience in data management, linkage, analysis, interpretation, and reporting.\nPreference will be given to a candidate with a strong health information management background including health records training.\nExperience working in a complex computerized environment.\nSkills and Abilities\nTeamwork and strong interpersonal skills due to the amount of communication required.\nCollaborative leadership in order to both work as a member of a team and provide leadership in developing partnerships amongst multiple stakeholders.\nPhysical ability to perform the duties of the position.\nInterior Health values diversity and inclusion. Our goal is to cultivate a workforce rich in culture, experience and knowledge to ensure equitable health outcomes for all of the clients we serve. We are welcoming of all populations including our Aboriginal partners throughout the Interior Health Region. We are committed to increasing our Aboriginal representative workforce to build an engaged, culturally diverse organization focused on the goal of providing high quality, sustainable healthcare through an engaged workforce and healthy workplaces. We build inclusive, trusting and respectful relationships through our partnerships. At Interior Health, Every Person Matters."}