{"Rendering Software Engineer": "Oooh is a team of 20 who have built some of the biggest global phenomenons in video and video games and have come together with a moonshot mission. Backed by an incredible group of Silicon Valley and LA VC’s, founders, product and technology leaders and entertainment moguls—all of whom feel personally connected to our purpose—we’ve been quietly building a smarter and healthier next-gen digital platform focused on younger audiences. And, one that’s way more fun. That’s about all we can say here :)  \n\nWe’re now looking for a Rendering Software Engineer to join our team! Working either from our Los Angeles, or Kelowna, British Columbia Canada offices you’ll be the first engineer dedicated to video graphics and rendering.  \n\nYou will have a passion for pushing the leading edge of video technology and a sensibility for making your implementations accessible to casual users. This role needs someone who is brings domain expertise from the video or gaming world, and ideally having worked at platforms with significant real-time video rendering products like Snapchat, TikTok, Instagram or AR-companies leveraging similar types of technologies. Without relative past experience, you may not be a great fit for this first dedicated video graphics engineering position.\n\nRESPONSIBILITIES\nDevelop innovative user experiences based on advanced computer graphics, video processing, computer vision and/or AR technologies\nLearn and acquire new techniques quickly based on project requirements\nWork closely with other teams to explore and prototype new product features\n\nEXPERIENCE\nBA/BS, MS in Computer Science or a related field\n4+ years experience in similar role\nExperience in video and image processing related applications on mobile phones\nStrong CS fundamentals (algorithms and data structures) and problem-solving skills\n\nPREFERRED QUALIFICATIONS\nStrong C/C++/C# skills and mobile platform development experiences (iOS or Android)\nExperience with graphics rendering APIs such as OpenGL ES / Metal / Vulkan\nExperience in designing, prototyping, and programming with real-time 3D engines such as Unity or Unreal\nExperience in shader programming\nExperience Profiling and Performance Optimizations\n\n*BONUS*\nHave worked on Snapchat or Instagram ‘Stories’ or TikTok’s video products, including filters/lenses and other real-time and post-processing video features\nFull-stack video software engineering experience\nExperience working with Computer Vision libraries such as OpenCV\nExperience with any of the following: Mapping and tracking algorithms, Camera optics, Image sensor technology, Image filtering techniques, Image analysis and segmentation, or IMUs\nExperience with augmented reality application development\nExperience using machine learning frameworks such as Tensorflow\n\nENVIRONMENT\nSmall team moving fast. All of the ownership with none of the BS.\n\nPERKS\nPremier Medical, Vision, Dental and Disability insurance\nUnlimited PTO\nMaternity and Paternity Leave\nOther typical startup life benefits - that you have a say in - as we grow\nSeniority Level\nMid-Senior level\nIndustry\nEntertainment Computer Games Online Media\nEmployment Type\nFull-time\nJob Functions\nEngineering", "BBW Key Holder-ORCHARD PARK SHOPPING CENTRE": "Description\n\nSupports delivering sales plan through effective execution of store and operational tasks.\n\nBuilding High Performing Teams\nParticipates in the hiring process by screening and scheduling interviews for candidates\nResponsible for leadership tasks as delegated by the store manager\nProvide individual and team performance feedback and recommendations to managers\nCoach and reward in the moment to maximize selling potential of associates\nResponsible for enforcing company policy, ensures a safe work environment, free of harassment or unlawful discrimination\nSupport onboarding and continued training of sales associates\n\n\nSelling Effectiveness\nLead and model the selling and customer experience standards\nLead selling efforts to meet selling goals during scheduled shifts\nEnsure associates consistently execute to the selling model\nDisplay knowledge of product, company policies and store strategies\nSet the direction and goals for the day/shift when associates arrive for work\nBuild highly satisfied and loyal customer base through engagement, conversion and capturing customer phone and e-mail\nAssist in meeting payroll targets by ensuring appropriate sales floor coverage (manage call-ins / call-offs)\nEnsure associates receive scheduled breaks and meal periods (per state specific guidelines)\n\n\nTelling The Brand Story\nSupport replenishment activities that keep the store full and abundant\nAssist with floorsets, window changes, visual presentations, signage placement, etc. as directed\nExecute visual standards and maintain a safe, inviting store appearance\n\n\nOperational Excellence\nPerform opening and closing routines including execution of bank deposits, receipt of shipment, and interpret / disseminate company directive when assigned as manager on duty\nAct as the manager on duty, when scheduled, to address customer service, vendor or maintenance issues\nResponsible for communicating any issues during opening/closing shifts to the store manager\nMaintain policies and procedures\nLead operational teams*\nIncorporate Loss Prevention and safety messages into daily operations\n*Note: The primary position responsibilities outlined above are not intended to be all-inclusive and additional responsibilities may be required depending on the volume and complexity of the store.\n\nQualifications\nPreferably an existing sales associate that aspires for management role\nAbility to foster a customer focused selling culture\nDemonstrated results (selling and operational)\nAvailable for varied weekly shifts including weekend, closing and peak shifts\nAbility to provide in the moment coaching to associates\nAn equal opportunity employer, we do not discriminate in hiring or terms and conditions of employment because of an individual’s race, ancestry, colour, place of origin, religion, gender, gender identity, national origin, citizenship, age, disability, sexual orientation, family status or marital status, or any other protected category recognized by provincial or federal laws. We only hire individuals authorized for employment in Canada.", "Freelancer - Smashbox - Kelowna, BC": "Smashbox Cosmetics knows camera-ready beauty. Born out of Smashbox Studios in Los Angeles—the modern-day image factory where countless iconic celebrity and fashion images have been shot—we are a fast-growing, prestige cosmetics brand with domestic and international presence. Staying true to our L.A. studio roots, we are creative and trendsetting, yet laidback and accessible.\n\nGLAMGLOW® was founded in 2010 exclusively for backstage and professional use in Hollywood's Entertainment, Music, Fashion & Award industries. Over the past 8 years GLAMGLOW® has grown from a conversation into an incredible success story, having won a wealth of beauty awards, being granted a patent for our TEAOXI® real leaf technology and becoming globally recognized for fast-acting, innovative mud treatments that deliver instant, visible results\n\nThe Role\n\nAs one of our highly skilled make-up artists/ skin care specialist you will combine your creative and technical expertise and passion for people to provide a welcoming, inspirational and personalized in-store experience which educates and delights our customers.\n\nWorking as part of a high performing team to you will create impact with in-store events and to ensure that the store always achieves our high standards of visual merchandising.\n\nAs a leader in prestige beauty with a culture that values diversity of thought and people, we offer excellent training and development and a competitive remuneration.\nWhile a qualification in make-up artistry/previous retail make up experience is preferred, we welcome applicants with amateur level experience who are able to demonstrate a high level of creative and technical expertise\nDynamic self-starter with the ability to provide inspirational, authentic and personalized customer service\nAbility to work flexible retail hours including days, nights, weekends and special events in a fast-paced work environment\nAbility to work within designated store set\nCollege diploma preferred\nWork Environment\n\nDynamic, Fun, Exciting, Team-spirited, “Never the same thing twice!”", "Investment Solution Representative": "The Investment Solutions Representative supports Interior Savings’ vision of sales & service excellence by developing valuable long-term relationships with members, pro-actively determining & fulfilling their investment needs and providing them sound advice with high-quality financial solutions to match their financial goals.\nThrough personal strengths in communication, sales leadership, and initiative you achieve financial sales goals through a focus on investors seeking diverse investment solutions. You will pro-actively manage client relationships; pursue opportunities and referrals including the success of key programs at the Investment Solutions Centre, including Outbound and Inbound Calls (IBC), Proactive KYC Updates, Mutual Fund sales, Pre-Authorized Credit (PAC) increases as well as referrals to the Wealth department, branch partners and digital channels.\nWith your ability to meet and exceed goals and objectives you will identify referral opportunities to other Interior Savings partners, achieve KYC update objectives and promote digital offerings.\nYou will work as a team member with licensed branch staff to ensure that all member needs are met in a timely manner in order to pro-actively grow the business. You will also perform other duties as assigned.\n  REQUIRED QUALIFICATIONS\nEducation\nHigh School diploma/Grade 12 plus two (2) years of formal post-secondary education or equivalent and have or be willing to work towards the CFP (Certified Financial Planner designation)\nInvestment Funds in Canada course – mutual fund sales license (MFDA)\n Knowledge/Experience\n2-4 years of job related experience in a financial sales & services environment\nDemonstrated knowledge of current domestic and international investment marketplace\nDemonstrated knowledge of RRSPs, RRIFs, RESPs, mutual funds\nFinancial planning courses considered an asset\nAdditional Requirements\nThis position requires work outside of regular branch hours, including evenings and some weekends.\n Come join our team! For more information or to apply for a position please visit our website: www.interiorsavings.com and submit your application. We thank all applicants for their interest and will contact short-listed candidates only.\n  ", "Maintenance Tech I/II": "We are seeking a Maintenance Technician I to assist with maintaining an industrial facility.\nAssisting with repairing, maintaining, installing and troubleshooting industrial equipment, systems and components\nAssisting with performing preventive/predictive maintenance\nResolving safety concerns\nPerforming indoor and outdoor housekeeping\nMonitoring inventory supplies and maintaining maintenance records\n\nRequired\n2+ years' experience repairing industrial processing equipment in an industrial environment or in the military\nAbility to read maintenance literature printed in English\nExperience with and ability to read a blueprint\nBasic Microsoft Office computer skills\nAbility to stand for up to 7 hours in an 8 hour shift\nHigh School Diploma/GED\n\nPreferred\nBoiler knowledge\nHVAC experience\nPrior experience and ability to perform welding activities including MIG, TIG, ARC, cutting and brazing\n\n*MON*", "Communications, Protection & Control Technologist": "Branch Electric\n\nDepartment Network Operations - Substations\n\nAffiliation IBEW\n\nJob Status Full Time Regular\n\nPosition Overview\nThe Communications, Protection & Control (CP&C) Technologist is responsible for the conduct of installation, maintenance and repairs on all telecommunication, electrical apparatus and equipment to ensure safe and efficient power system operation.\n\nResponsibilities\nConduct emergent, investigative and scheduled tests on generation, transmission and distribution system electrical apparatus and equipment, cables, metering, telecommunications and protective relaying facilities by coordinating line and equipment clearances.\nCarry out specialized tests required to analyze and assess inherent faults or conditions including power quality and radio or television frequency interference.\nCompile and record test data on telecommunications, relay characteristic tests and other associated electrical equipment.\nInstall, test and commission a wide range of generation, substation and terminal station communication and protective schemes.\nAssess and organize those conditions that must be dealt with in the installation and maintenance of telecontrol equipment such as, two-way radios, repeater sites, microwave radio, powerline carrier, supervisory control, telemetering equipment, telecontrol standby power equipment and security systems.\nRead, interpret and troubleshoot complex protective relaying schemes and determine any corrective actions needed to solve problems.\nAs required, undertake cost estimates, basic designs, job planning, scheduling, work documentation and reports.\nLiaise with other internal or external parties to provide technical expertise as required.\nWilling and able to provide technical training in areas covered under job duties to others in the workforce including those at a lower employee classification.\nSubject to Standby and Callouts. Will be required to establish residence as per the Standby policy.\nPerform duties normally carried out by a lower classification employee\n\nRequirements\n\nSpecial Skill Requirements:\nDemonstrated interpersonal skills (written/oral) to effectively communicate with crews, staff and public\nEffective job execution skills with good problem-solving abilities\nSelf-starter with ability to work well on own and as a part of a team\nAdaptable and confident – able to maintain a constructive, positive attitude when plans change\n\nKnowledge And Experience Requirements\nDiploma in Electrical, Electronics or Instrumentation Technology\nJourneyman Electrical tradesman (Red Seal) or Power System Electrician (PSE)\nPractical experience in work related to generating, substation or terminal station equipment\nMust possess a strong computer background\nPractical experience in the use of tools and electrical testing equipment\nMust be holder of a valid Class 5 Driver’s License\n\nAdditional Information\n\nThis position supports our Network Operations group by maintaining and operating the 40 electricity substations within the Okanagan region. Candidates must currently hold a 2 year technologist diploma in addition to a Journeyman Red Seal Electrician ticket or Power Systems Electrician ticket to be considered for this opportunity.", "Customer Experience Sales Floor Dept. Manager": "Req ID\n1417198BR\nLocation\n1555 BANKS ROAD, KELOWNA, BC, V1X 7Y8\nTime Type\nFull Time\n\nCompany Summary\n\nWalmart Canada operates a chain of more than 400 stores nationwide serving more than 1.2 million customers each day. Walmart Canada's flagship online store, walmart.ca, is visited by 750,000 customers daily. With more than 85,000 associates, Walmart Canada is one of Canada's largest employers and is ranked one of the country's top 10 most influential brands. Walmart Canada's extensive philanthropy program is focused on supporting Canadian families in need, and since 1994 Walmart Canada has raised and donated more than $400 million to Canadian charities. Additional information can be found at walmartcanada.ca, facebook.com/walmartcanada and @walmartcanada.\n\nPosition Summary\n\nThe GM Apparel Sales floor Dept. Manager will provide customer service by coordinating the activities of associates to maintain a stocked and zoned salesfloor and offering assistance to meet the customer’s shopping needs. This will be accomplished by assisting at the Front End as required and maintaining and recovering merchandise all in a safe and clean environment. This Department Manager will function as a lead of a team to strategically plan and execute duties based on workload and customer traffic patterns. Shift Requirements: A variety of shifts including evenings and weekends.\n\nPosition Responsibilities\n\nPrimary responsibilities are listed below. Other responsibilities may be assigned.\nAssigning associates to areas of the salesfloor in partnership with the respective salaried Manager\nEnsuring associate breaks are taken in accordance with coverage\nCovering an assigned area on the salesfloor as needed\nZoning assigned area\nWorking recovery merchandise from the Customer Service desk and other areas of the store\nAssisting with Front End coverage\nMoving feature merchandise to its modular home\nExecuting housekeeping as required\nTraining, coaching and offering feedback to associates Provides excellent Customer service through:\nPracticing the 3 Meter Rule\nResponding to customer requests for information and service\nAssisting customer in locating merchandise Ensures that safe work habits are being followed by:\nPerforming warm-up stretches prior to shift\nBeing knowledgeable about emergency and safety procedures\nFollowing pallet jack and equipment safety procedures\nFollowing proper lifting techniques\nMaintaining a safe work area, free of excess debris and fixtures\nFollowing riser and ladder safety\nBeing knowledgeable with lockout/tag out procedures\nProperly handling all liquid and chemical spills\nMaintaining a clean accessible fixture room Ensures cleanliness through:\nDisposing of trash/boxes quickly\nKeeping a clean, hazard free work area\nMaintaining clean modulars Demonstrates initiative and dependability by:\nWorking well on his/her own and requiring very littler supervision and follow-up\nExcelling in a team working environment\nBeing flexible based on the freight flow and demand\nCanada Walmart Division\nRetail Store Associates\n\nQualifications\n\nQualification Requirements To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Previous supervisory and working experience in a Retail environment is an asset. Mathematical Skills Ability to add, subtract, multiply and divide in all units of measure, using whole numbers, common fractions and decimals. Basic Reading/Writing Skills Ability to understand to the meaning of written or printed matter and to record information by inscribing characters or symbols. Certificates, Licenses, and Registrations The associate must complete all Wal-Mart Basic and Advanced Training Modules and classes. The Associate must also be comfortable working with technology and be willing to learn new technological platforms when required. Physical Demands The physical demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions. While performing the duties of this job, the Associate is regularly required to: Spend frequent periods standing with a constant opportunity to move about. It is an occasional requirement to stoop or lift material, fixtures or equipment and climb a ladder. The Associate must regularly lift and/or move up to 9.1 kg (20 lbs.) and occasionally lift and/or move up to 18 kg (40 lbs.). Work Environment The work environment characteristics described in this section are representative of those an associate encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This job is located in a comfortable indoor area. Conditions could produce mild discomfort on occasion, e.g., dust, moderate noise. Regular need to give close attention, either hearing or seeing, to what is happening is required. There is some modest pressure from deadlines or other productivity standards. Work is somewhat repetitious.\n\nLicensing & Other Qualifications\n\nThe Associate must complete all Wal-Mart Basic and Advanced Training Modules and classes\nPhysical Demands\nPhysical Demands The physical demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions. While performing the duties of this job, the Associate is regularly required to: Spend frequent periods standing with a constant opportunity to move about. It is an occasional requirement to stoop or lift material, fixtures or equipment and climb a ladder. The Associate must regularly lift and/or move up to 9.1 kg (20 lbs.) and occasionally lift and/or move up to 18 kg (40 lbs.). Work Environment The work environment characteristics described in this section are representative of those an associate encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This job is located in a comfortable indoor area. Conditions could produce mild discomfort on occasion, e.g., dust, moderate noise. Regular need to give close attention, either hearing or seeing, to what is happening is required. There is some modest pressure from deadlines or other productivity standards. Work is somewhat repetitious.\nSchedule Details\nSA: 7:00am - 11:00pm\nSU: 7:00am - 11:00pm\nMO:7:00am - 11:00pm\nTU: 7:00am - 11:00pm\nWE:7:00am - 11:00pm\nTH: 7:00am - 11:00pm\nFR: 7:00am - 11:00pm\nAccessibility\nWalmart will accommodate the disability-related needs of applicants and associates as required by law."}