{"Cloud Developer - Canada": "Cloud Developer\n\nCanada | Remote | Work from Home\n\nWhy you?\n\nAre you a Canadian based Cloud Engineer or Full Stack Software Developer who can provide consulting services to Pythian’s global clients including planning, designing and implementing new solutions using the latest Cloud and Big Data technologies? Do you want to work on large scale custom consulting projects? Do you want to work remotely to implement and help develop cutting edge solutions, create data pipelines which will migrate data from customers on-prem systems and load it into a cloud hosted Enterprise Data Platform ? If you have a passion for big data and solving complex problems then this could be the job for you!\n\nWhat will you be doing?\nWorking with our Cloud Architects to design and develop end to end Cloud based solutions with heavy focus on application and data, all with good understanding of underlying cloud infrastructure\nBe part of a team of globally dispersed Cloud Consultants, supporting other members of the team in overcoming challenges, removing roadblocks and developing options and solutions\nWorking on complex and varied Cloud Data focused projects such as migrating business-critical applications to the cloud, re-platforming or re-architecting difficult data and analytics use cases; Migrate existing data warehouses from on-premise data center or from one cloud provider to another. As an example of our migration approach, read about our Teradata to Google Cloud Platform migration service.\nHelp our customers to grow from a data warehouse into a true cloud-native data platform with full multi-source data ingestion and integration.\nBuild or move analytic workloads to the cloud for better scalability and efficiency.\nTranslating complex functional and technical requirements into detailed designs.\nWriting high-performance, reliable and maintainable code.\nAutomate, create reusable accelerators to help get the job done quicker and better\nPerform data processing requirements analysis and data flow integrations with external systems.\nSecuring components of clients’ Data platforms.\nDiagnostics and troubleshooting of operational issues. Perform Health-checks and configuration reviews.\nAssisting client developers and advising on efficient data access and manipulations.\n\nWhat do we need from you?\nWhile we realise you might not have everything on the list to be the successful candidate for the Cloud Consultant job you will likely have at least 5 years experience in similar roles. The position requires specialized knowledge and experience in performing the following:\nBe fluent in a couple of object oriented language, preferably Java and Python, familiarity with Scala and Go would be a plus.\nExperience building end to end software on Google Cloud Platform (GCP), Amazon Web Services (AWS) or Microsoft Azure.\nGood knowledge of popular database and data warehouse technologies & concepts from Google, Amazon or Microsoft (Cloud & Conventional RDBMS), such as BigQuery, Redshift, Microsoft Azure SQL Data Warehouse, Snowflake etc.\nExperience with GCP Dataflow, AWS Glue, Azure DataFactory or any equivalent would be great\nExperience in data modeling, data design and persistence (e.g. warehousing, data marts, data lakes).\nGeneral knowledge of modern data-center and cloud infrastructure including server hardware, networking and storage.\n\nWhat do you get in return?\nCompetitive total rewards package\nFlexible work environment: Why commute? Work remotely from your home, there’s no daily travel requirement to an office!\nOutstanding people: Collaborate with the industry’s top minds.\nSubstantial training allowance: Hone your skills or learn new ones; participate in professional development days, attend conferences, become certified, whatever you like!\nAmazing time off: Start with a minimum 3 weeks paid time off, 7 sick days, and 2 professional development days!\nOffice Allowance: A device of your choosing and personalise your work environment!\nFun, fun, fun: Blog during work hours ; take a day off and volunteer for your favorite charity.\n\nWhy Pythian?\n\nPythian excels at helping businesses use their data and cloud to transform how they compete and win in this ever-changing environment by delivering advanced on-prem, hybrid, cloud and multi-cloud solutions to solve the toughest data challenges faster and better than anyone else. Founded and headquartered in Ottawa, Canada in 1997, Pythian now has more than 300 employees located around the globe with over 350 clients spanning industries from SaaS; media; gaming; financial services; e-commerce and more. Pythian is known for its technology-enabled data expertise covering everything from ETL to ML. We pride ourselves on our ability to deliver innovative solutions that meet the specific data goals of each client and have built meaningful partnerships with major cloud vendors AWS, Google and Microsoft. The powerful combination of our extensive expertise in data and cloud and our ability to keep on top of the latest bleeding edge technologies make us the perfect partner to help mid and large-sized businesses transform to stay ahead in today’s rapidly changing digital economy. If you are a Cloud Consultant; live in the United States or Canada; love your data and want to love your career then join us!\n\nIntrigued to see what a job is like at Pythian or check us out @Pythian and #pythianlife . Follow @PythianJobs on Twitter and @loveyourdata on Instagram!\n\nNot the right job for you? Check out what other great jobs Pythian has open around the world! Pythian Careers\n\nDisclaimer\n\nFor this job an equivalent combination of education and experience, which results in demonstrated ability to apply skills will also be considered.\n\nPythian is an equal opportunity employer and welcomes applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\nThe successful applicant will need to fulfill the requirements necessary to obtain a background check.\n\nApplicants must be legally authorized to work in their country of residence permanently– Pythian will not relocate, sponsor, or file petitions of any kind on behalf of a foreign worker to gain a work visa, become a permanent resident based on a permanent job offer, or to otherwise obtain authorization to work.\n\nNo recruitment agencies\nSeniority Level\nEntry level\nIndustry\nInformation Technology & Services\nEmployment Type\nFull-time\nJob Functions\nOther", "Mobile Mortgage Specialist": "Description\nAre you autonomous, organized, disciplined and hard working?\nDo you view the opportunity to work entirely on commission as a plus?\n\n\nWith National Bank, you benefit from working with a large established company, covering a large territory (with all the potential it has to offer), and enjoying flexible working conditions, while helping local people build their lives.\n\nBy joining National Bank as a Mortgage Specialist, you will be working with three different groups of people in your territory: clients, real estate agents and internal partners.\n\nIn This Role, You Will Be Expected To\nOffer outstanding service to your clients by helping them find the best mortgage strategy for their needs\nEstablish and maintain lasting business relationships with real estate agents and/or builders by keeping them informed of the products and services we offer\nWork closely with target branches to identify and meet clients' internal and external refinancing needs\nCommunicate and work effectively with internal partners to improve client retention, client onboarding in branches and cross-selling by referring clients to the most appropriate partners\nKeep current on National Bank products and market trends in order to act as an expert in your field\nAttend meetings and training seminars considered essential for you to provide high quality service\nAttend various business development and recognition activities\nAdhere closely to established processes and procedures to produce high-quality files that comply with current standards and regulations\nThe candidate needs to be able to identify all risks inherent to the Personal and Commercial Banking sector’s activities.\n\n\nQualifications\nA Bachelor's degree in a related field and one year of relevant experience or a college diploma and three years' relevant experience\nBusiness development experience\nAbility to work under the pressure of meeting business development targets\nStrong interpersonal skills and ability to manage various internal and external stakeholders\nKnowledge of financial products, an asset\nRigour and excellent IT skills\nBilingualism (English and French), an asset\nNational Bank sees diversity as a great source of wealth and values it in all its dimensions. Its objective is to offer an open, respectful work environment where all employees can achieve their full potential. Senior management's concrete commitment helps spread this value across all sectors in the organization. The Bank has been ranked among the top employers for diversity in Canada for several years.", "Senior Software Engineer": "Filtering the negative to make room for the positive.\n\nAt Two Hat, our mission is to help social networks build safe and healthy online communities by removing negative interactions to make room for positive human connections. We believe that everyone should be free to share online without fear of harassment or abuse.\n\nProcessing nearly 30 billion interactions a month, Two Hat enables clients across a variety of social networks and gaming companies to deliver positive user experiences by detecting and filtering harmful content in real time, before it reaches the community. More than just a filter, we provide an all-in-one content moderation solution, with data analysis, content escalations, flexible workflows, auto-moderated user reports, and more. Clients benefit from our scalable, autonomous, and transparent solution, as well as our team of industry experts who consult on best practices and industry standards. As a leading provider of content moderation best practices, we believe we can restore the original purpose of the internet - to empower positive human connection and facilitate healthy social online interactions. \n\nRemoving illegal content is a shared responsibility. To that end, we work with international governments and law enforcement in helping to prevent the targeting of children through the internet, and train AI to detect new child exploitation material.\n\nWho you are\n\nWe are looking for a complex problem solver with a delivery mindset to join our team as a Software Engineer. In this role, you’ll build out and scale our products as well as drive continuous improvements to our flagship automated moderation product CommunitySift and its ability to process data at a massive scale. \n\nWhat’s in it for you? \n\nPurpose and impact. We’ve said it a few times, but what we do matters. We are building solutions that make a difference. This is your chance to be part of an organization adding true value and meaning to the world.\n\nCutting edge technology. You want to work with deep learning loops; collaborate with Data Scientists to build fast AI that encompasses natural language processing; build our classifiers, both algorithmic or machine learning. You want to:\nExecute on Agile SaaS-based tool development. You will develop and iterate new features and functionality for our web and mobile products.\nLead architectural discussions. You will identify architecture and infrastructure problems - and solutions.\nCollaborate. You will be a key member of the product development team; assisting with operations and information security.\nPlan and advise. You will execute on tactics that support the technology vision for the product and the organization as a whole.\n\nGrowth and challenges. You want to bring your knowledge, expertise and lessons learned to influence and help build out our architecture and processes. You want to move between our three engineering teams, features, maintenance and platform, gaining exposure to all of our products and working on complex client projects. You want to be part of a well-supported and close-knit team with the freedom to work remotely. You want to share your thoughts on how to solve challenges beyond what anyone else out there is taking on in AI, ML and NLP.\n\nWhat you bring\n\nTechnical expertise. You have experience in a cloud development environment building high availability SaaS applications that serve 100,000+ requests every second. You have hands-on expertise with object-oriented programming; knowledge of Python, Javascript, C/C++, JIRA, Git/Github are all beneficial. You have a strong understanding of best practices for Security.\nA passion for Agile. You thrive in a fast-paced and Agile Kanban environment. You can:\nWork with Product Managers to translate user stories into actionable tasks.\nCollaborate with the engineering team to scope tasks and provide estimates.\nDevelop solutions to meet acceptance criteria.\nA growth mindset. You think big and keep up to date on emerging trends and industry best practices. You are open to feedback and on a personal mission to pursue new learnings at every opportunity.  \nA delivery focus. You have a proven track record managing competing priorities while maintaining an ability to execute on time, beyond expectations.\nAn innovative team approach. You are a team player with a positive attitude punctuated by high energy, initiative and perseverance. You can effectively build working relationships, be accountable and coordinate resources with cross-functional teams.\n\nJoin us\n\nOur CEO and Founder is a visionary who believes in a better internet for everyone- and it’s a vision each one of us stands behind. Sure, it’s a lofty goal; and maybe it sounds impossible…but we don’t think it is. Our technology is capable of more now than when we started, but unsafe users are growing increasingly deceptive. We continue to step up our game and meet those challenges at every turn. \n\nRight now, we are growing and we aren’t slowing down anytime soon. We are looking for brilliant, innovative and deeply conscientious people to join our team and be part of our mission. This is a place where:\nWe have an evolving startup culture of fiercely dedicated and collaborative individuals.\nA tech giant praised us for tackling - and solving - a highly complex chat feature.\nWe coordinate and run an “Amazing Race” event celebrating our six year anniversary.\nSpot rewards are handed out by the CEO.\nWe host a “Mug Club” which is our version of a Ted Talk presented by anyone with a bright idea.\nPink Shirt Day means something to us on a deeper level.\nWe participate in local acts of good, both big and small, to bring a little joy to our community.\n\nIf you are driven to make the world a better place; you share our growth mindset; and you have built your talent on a foundation of hard work and creative thinking, join us.\n\nTwo Hat welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\nDue to COVID-19 please expect changes to our standard recruitment process. In all instances, the safety of our employees and our candidates is of our utmost concern so we will be conducting interviews virtually and online. We will keep you informed on these changes and ensure that you are prepared in advance with the necessary instructions to conduct the next steps in the recruitment process.", "Concierge Non Union": "If you’re passionate about being a part of a team that is, committed to the Team Member Experience and driven by innovation and growth, then join us! Health and Dental Benefits are available with no waiting period for successful candidates.\n\nThe Concierge is a critical role within our communities as it impacts the lives of residents and ignites the warmth of human connection.\n\nAs a Concierge your typical day will impact in the following ways:\nResponding to all resident and visitor enquiries as their first priority in a diplomatic manner, utilizing problem solving and complaint resolution skills and ensures all complaints are forwarded to the General Manager in writing.\nPromoting excellent customer service in all personal interactions with visitors, families, residents and team members.\nGreeting all visitors to the building and ensures that their needs are addressed in a pleasant and unhurried fashion and conducts mini tours in accordance with policies and procedures.\nProviding clerical and computer support to all managers as requested.\nCompleting required records to support cash transactions related to the sale of guest and team member meal vouchers / tickets.\nPerforming other duties as assigned.\nMust Haves\nCompletion of grade 12 education.\nExcellent verbal and written communication skills.\nPositive attitude and proven customer service skills through related work experience.\nProven organizational skills and ability to multi task.\nMust demonstrate computer proficiency with MS Office, specifically Excel, Word, and Power Point.\nAll applicants must successfully pass the prescribed Vulnerable Sector Check. Applicable to Ontario applicants.\nAll applicants must successfully pass the prescribed Criminal Records Check. Applicable to British Columbia applicants.\nBonus Points For Having\nAdditional applied courses i.e. office administration preferred.\nAct upon your desire to help others and Join Sienna Senior Living as we continue to enhance the lives of those we serve.\n\nFor Ontario locations, in accordance with the Accessibility for Ontarians with Disabilities Act 2005, upon request, support will be provided for accommodations throughout the recruitment, selection and assessment process.", "Business Systems Analyst": "The Business Systems Analyst is responsible for supporting the implementation of new systems and changes to the existing ones. To succeed in this role, resourcefulness is a necessary skill to have, and you not only enjoy variety, but thrive in a changing and fast-paced environment. You should have the patience to communicate with a variety of interdisciplinary teams and users. Your goal will be to ensure that our systems are stable, reliable, integrated and support the business to run smoothly and efficiently.\n\nResponsibilities:\nSupport the implementation and integration of new enterprise systems and technology\nDetermine ongoing information needs and translate them into functional and technical requirements\nIdentify system changes and complete the installation, configuration, initial data loading, testing and hand over to production, by working with software vendors and/or internal staff\nSupport business software. Perform troubleshooting to diagnose and resolve problems\nPerform proactive system maintenance for excellent performance and optimization\nCreate dashboards, reports, and assist users with ad-hoc requests for data extracts and analysis\nEvaluate training needs, develop training materials and provide system training to existing and new users\nCreate and maintain documentation for all aspects of business systems\nOther project work, as assigned by management\n\nQualifications:\nDiploma/degree in Computer Science, Management of Information Systems or related, plus a minimum of 4 years’ recent experience in a similar role\nExperience with business analysis in an enterprise environment, including requirements gathering, UAT, software implementation, project management methodology, change management and version control\nGood knowledge of Microsoft cloud technologies: Azure AD, O365, SharePoint, Teams\nGood knowledge of various enterprise systems, e.g. IT ticketing, quality management, manufacturing, scheduling, HRIS, etc, and reporting tools, e.g. Power BI, Tableau, Power Pivot, etc. ERP experience is an asset\nAbility to analyze business problems by looking at both process and technology\nResourcefulness and problem-solving aptitude\nClear communication and presentation skills\nAbility to deal with multiple tasks, prioritize, change quickly and work under pressure\nCuriosity, enthusiasm and a passion for technology\nClean criminal record check", "STRATEGIC INFORMATION ANALYST": "STRATEGIC INFORMATION ANALYST\nJob ID 1391448 Date posted 04/15/2020\nJob title :STRATEGIC INFORMATION ANALYST\nCommunity :KELOWNA\nFacility :KELOWNA CHSC\nStatus :PERMANENT FULL TIME\n\nPosition Summary\n\nWe are seeking a Strategic Information Analyst to join our Strategic Information Management team in Kelowna, BC.\n\nThe Strategic Information Analyst will be responsible for supporting strategic information planning, analysis, and decision support within a defined portfolio. The Analyst will be part of the Strategic Information Management Department but will work closely with the Manager or Lead of the assigned portfolio and key internal stakeholders.\n\nTypical Duties And Responsibilities\nProvides timely, relevant, reliable, and clear information with appropriate supporting data analyses and review of alternatives to inform planning and decision-making. This will include population, service utilization, and outcomes analyses and information for use by facilities planning, senior leadership, program Managers, and healthcare providers as well as for public information.\nProvides data analysis using key data sources (population, clinical, organizational, and administrative) in response to strategic and corporate services, senior executive, and program level requests for information and analysis. This work may include data linkage, descriptive information, statistical analyses, and statistical tests of significance.\nReviews planning and evaluation documents as well as plans for allocating resources and provides appropriate information and feedback. This will include health services plan and program planning documents prepared by Interior Health (IH) Health Services planning, Facilities Management, and program staff. Information and feedback will include providing assistance with population and utilization data as well as feedback on planning assumptions.\nProvides input and identifies opportunities for information support activities to the Corporate Director, Information Management. This will include providing suggestions and advice on important data development and future projects/analyses.\nDevelops a strong working relationship with program Managers, Directors, Senior Executive members, Business Support, and others who require information for planning, managing, and evaluating services. Project support may include planning project deliverables and identifying data sources and appropriate methods to support planning, data analyses, writing summary reports, and preparing presentations.\nResponds to data and information requests from staff at all levels of the organization. Provides support and technical advice to staff on the use of strategic information resources and applications.\nWorks with provincial and national representatives on strategic information projects. This may include working with the Canadian Institute for Health Information and Ministry of Health priority projects. The focus of this work will be to review key assumptions and methods, provide data, and assist with interpretation of findings.\nWorks with representatives of other Health Authorities and other data custodians to support strategic information, analysis, interpretation, and reporting initiatives.\nProvides advice, analysis, and recommendations on initiatives related to data collection, database development, and data extraction and analysis to Information Support and Research.\nWorks with Information Management/Information Technology and other IH staff to support timely, reliable, and consistent data reporting and analysis.\nPerforms other duties as assigned.\nQualifications\n\nEducation, Training, and Experience\nA post-secondary degree with completed course work in a health-related discipline, and/or an equivalent combination of education and experience. A Master’s degree is preferred.\nA minimum of two years of experience in data management, linkage, analysis, interpretation, and reporting.\nPreference will be given to a candidate with a strong health information management background including health records training.\nExperience working in a complex computerized environment.\nSkills and Abilities\nTeamwork and strong interpersonal skills due to the amount of communication required.\nCollaborative leadership in order to both work as a member of a team and provide leadership in developing partnerships amongst multiple stakeholders.\nPhysical ability to perform the duties of the position.\nInterior Health values diversity and inclusion. Our goal is to cultivate a workforce rich in culture, experience and knowledge to ensure equitable health outcomes for all of the clients we serve. We are welcoming of all populations including our Aboriginal partners throughout the Interior Health Region. We are committed to increasing our Aboriginal representative workforce to build an engaged, culturally diverse organization focused on the goal of providing high quality, sustainable healthcare through an engaged workforce and healthy workplaces. We build inclusive, trusting and respectful relationships through our partnerships. At Interior Health, Every Person Matters.", "Rendering Software Engineer": "Oooh is a team of 20 who have built some of the biggest global phenomenons in video and video games and have come together with a moonshot mission. Backed by an incredible group of Silicon Valley and LA VC’s, founders, product and technology leaders and entertainment moguls—all of whom feel personally connected to our purpose—we’ve been quietly building a smarter and healthier next-gen digital platform focused on younger audiences. And, one that’s way more fun. That’s about all we can say here :)  \n\nWe’re now looking for a Rendering Software Engineer to join our team! Working either from our Los Angeles, or Kelowna, British Columbia Canada offices you’ll be the first engineer dedicated to video graphics and rendering.  \n\nYou will have a passion for pushing the leading edge of video technology and a sensibility for making your implementations accessible to casual users. This role needs someone who is brings domain expertise from the video or gaming world, and ideally having worked at platforms with significant real-time video rendering products like Snapchat, TikTok, Instagram or AR-companies leveraging similar types of technologies. Without relative past experience, you may not be a great fit for this first dedicated video graphics engineering position.\n\nRESPONSIBILITIES\nDevelop innovative user experiences based on advanced computer graphics, video processing, computer vision and/or AR technologies\nLearn and acquire new techniques quickly based on project requirements\nWork closely with other teams to explore and prototype new product features\n\nEXPERIENCE\nBA/BS, MS in Computer Science or a related field\n4+ years experience in similar role\nExperience in video and image processing related applications on mobile phones\nStrong CS fundamentals (algorithms and data structures) and problem-solving skills\n\nPREFERRED QUALIFICATIONS\nStrong C/C++/C# skills and mobile platform development experiences (iOS or Android)\nExperience with graphics rendering APIs such as OpenGL ES / Metal / Vulkan\nExperience in designing, prototyping, and programming with real-time 3D engines such as Unity or Unreal\nExperience in shader programming\nExperience Profiling and Performance Optimizations\n\n*BONUS*\nHave worked on Snapchat or Instagram ‘Stories’ or TikTok’s video products, including filters/lenses and other real-time and post-processing video features\nFull-stack video software engineering experience\nExperience working with Computer Vision libraries such as OpenCV\nExperience with any of the following: Mapping and tracking algorithms, Camera optics, Image sensor technology, Image filtering techniques, Image analysis and segmentation, or IMUs\nExperience with augmented reality application development\nExperience using machine learning frameworks such as Tensorflow\n\nENVIRONMENT\nSmall team moving fast. All of the ownership with none of the BS.\n\nPERKS\nPremier Medical, Vision, Dental and Disability insurance\nUnlimited PTO\nMaternity and Paternity Leave\nOther typical startup life benefits - that you have a say in - as we grow\nSeniority Level\nMid-Senior level\nIndustry\nEntertainment Computer Games Online Media\nEmployment Type\nFull-time\nJob Functions\nEngineering", "BBW Key Holder-ORCHARD PARK SHOPPING CENTRE": "Description\n\nSupports delivering sales plan through effective execution of store and operational tasks.\n\nBuilding High Performing Teams\nParticipates in the hiring process by screening and scheduling interviews for candidates\nResponsible for leadership tasks as delegated by the store manager\nProvide individual and team performance feedback and recommendations to managers\nCoach and reward in the moment to maximize selling potential of associates\nResponsible for enforcing company policy, ensures a safe work environment, free of harassment or unlawful discrimination\nSupport onboarding and continued training of sales associates\n\n\nSelling Effectiveness\nLead and model the selling and customer experience standards\nLead selling efforts to meet selling goals during scheduled shifts\nEnsure associates consistently execute to the selling model\nDisplay knowledge of product, company policies and store strategies\nSet the direction and goals for the day/shift when associates arrive for work\nBuild highly satisfied and loyal customer base through engagement, conversion and capturing customer phone and e-mail\nAssist in meeting payroll targets by ensuring appropriate sales floor coverage (manage call-ins / call-offs)\nEnsure associates receive scheduled breaks and meal periods (per state specific guidelines)\n\n\nTelling The Brand Story\nSupport replenishment activities that keep the store full and abundant\nAssist with floorsets, window changes, visual presentations, signage placement, etc. as directed\nExecute visual standards and maintain a safe, inviting store appearance\n\n\nOperational Excellence\nPerform opening and closing routines including execution of bank deposits, receipt of shipment, and interpret / disseminate company directive when assigned as manager on duty\nAct as the manager on duty, when scheduled, to address customer service, vendor or maintenance issues\nResponsible for communicating any issues during opening/closing shifts to the store manager\nMaintain policies and procedures\nLead operational teams*\nIncorporate Loss Prevention and safety messages into daily operations\n*Note: The primary position responsibilities outlined above are not intended to be all-inclusive and additional responsibilities may be required depending on the volume and complexity of the store.\n\nQualifications\nPreferably an existing sales associate that aspires for management role\nAbility to foster a customer focused selling culture\nDemonstrated results (selling and operational)\nAvailable for varied weekly shifts including weekend, closing and peak shifts\nAbility to provide in the moment coaching to associates\nAn equal opportunity employer, we do not discriminate in hiring or terms and conditions of employment because of an individual’s race, ancestry, colour, place of origin, religion, gender, gender identity, national origin, citizenship, age, disability, sexual orientation, family status or marital status, or any other protected category recognized by provincial or federal laws. We only hire individuals authorized for employment in Canada.", "Freelancer - Smashbox - Kelowna, BC": "Smashbox Cosmetics knows camera-ready beauty. Born out of Smashbox Studios in Los Angeles—the modern-day image factory where countless iconic celebrity and fashion images have been shot—we are a fast-growing, prestige cosmetics brand with domestic and international presence. Staying true to our L.A. studio roots, we are creative and trendsetting, yet laidback and accessible.\n\nGLAMGLOW® was founded in 2010 exclusively for backstage and professional use in Hollywood's Entertainment, Music, Fashion & Award industries. Over the past 8 years GLAMGLOW® has grown from a conversation into an incredible success story, having won a wealth of beauty awards, being granted a patent for our TEAOXI® real leaf technology and becoming globally recognized for fast-acting, innovative mud treatments that deliver instant, visible results\n\nThe Role\n\nAs one of our highly skilled make-up artists/ skin care specialist you will combine your creative and technical expertise and passion for people to provide a welcoming, inspirational and personalized in-store experience which educates and delights our customers.\n\nWorking as part of a high performing team to you will create impact with in-store events and to ensure that the store always achieves our high standards of visual merchandising.\n\nAs a leader in prestige beauty with a culture that values diversity of thought and people, we offer excellent training and development and a competitive remuneration.\nWhile a qualification in make-up artistry/previous retail make up experience is preferred, we welcome applicants with amateur level experience who are able to demonstrate a high level of creative and technical expertise\nDynamic self-starter with the ability to provide inspirational, authentic and personalized customer service\nAbility to work flexible retail hours including days, nights, weekends and special events in a fast-paced work environment\nAbility to work within designated store set\nCollege diploma preferred\nWork Environment\n\nDynamic, Fun, Exciting, Team-spirited, “Never the same thing twice!”", "Investment Solution Representative": "The Investment Solutions Representative supports Interior Savings’ vision of sales & service excellence by developing valuable long-term relationships with members, pro-actively determining & fulfilling their investment needs and providing them sound advice with high-quality financial solutions to match their financial goals.\nThrough personal strengths in communication, sales leadership, and initiative you achieve financial sales goals through a focus on investors seeking diverse investment solutions. You will pro-actively manage client relationships; pursue opportunities and referrals including the success of key programs at the Investment Solutions Centre, including Outbound and Inbound Calls (IBC), Proactive KYC Updates, Mutual Fund sales, Pre-Authorized Credit (PAC) increases as well as referrals to the Wealth department, branch partners and digital channels.\nWith your ability to meet and exceed goals and objectives you will identify referral opportunities to other Interior Savings partners, achieve KYC update objectives and promote digital offerings.\nYou will work as a team member with licensed branch staff to ensure that all member needs are met in a timely manner in order to pro-actively grow the business. You will also perform other duties as assigned.\n  REQUIRED QUALIFICATIONS\nEducation\nHigh School diploma/Grade 12 plus two (2) years of formal post-secondary education or equivalent and have or be willing to work towards the CFP (Certified Financial Planner designation)\nInvestment Funds in Canada course – mutual fund sales license (MFDA)\n Knowledge/Experience\n2-4 years of job related experience in a financial sales & services environment\nDemonstrated knowledge of current domestic and international investment marketplace\nDemonstrated knowledge of RRSPs, RRIFs, RESPs, mutual funds\nFinancial planning courses considered an asset\nAdditional Requirements\nThis position requires work outside of regular branch hours, including evenings and some weekends.\n Come join our team! For more information or to apply for a position please visit our website: www.interiorsavings.com and submit your application. We thank all applicants for their interest and will contact short-listed candidates only.\n  ", "Maintenance Tech I/II": "We are seeking a Maintenance Technician I to assist with maintaining an industrial facility.\nAssisting with repairing, maintaining, installing and troubleshooting industrial equipment, systems and components\nAssisting with performing preventive/predictive maintenance\nResolving safety concerns\nPerforming indoor and outdoor housekeeping\nMonitoring inventory supplies and maintaining maintenance records\n\nRequired\n2+ years' experience repairing industrial processing equipment in an industrial environment or in the military\nAbility to read maintenance literature printed in English\nExperience with and ability to read a blueprint\nBasic Microsoft Office computer skills\nAbility to stand for up to 7 hours in an 8 hour shift\nHigh School Diploma/GED\n\nPreferred\nBoiler knowledge\nHVAC experience\nPrior experience and ability to perform welding activities including MIG, TIG, ARC, cutting and brazing\n\n*MON*", "Communications, Protection & Control Technologist": "Branch Electric\n\nDepartment Network Operations - Substations\n\nAffiliation IBEW\n\nJob Status Full Time Regular\n\nPosition Overview\nThe Communications, Protection & Control (CP&C) Technologist is responsible for the conduct of installation, maintenance and repairs on all telecommunication, electrical apparatus and equipment to ensure safe and efficient power system operation.\n\nResponsibilities\nConduct emergent, investigative and scheduled tests on generation, transmission and distribution system electrical apparatus and equipment, cables, metering, telecommunications and protective relaying facilities by coordinating line and equipment clearances.\nCarry out specialized tests required to analyze and assess inherent faults or conditions including power quality and radio or television frequency interference.\nCompile and record test data on telecommunications, relay characteristic tests and other associated electrical equipment.\nInstall, test and commission a wide range of generation, substation and terminal station communication and protective schemes.\nAssess and organize those conditions that must be dealt with in the installation and maintenance of telecontrol equipment such as, two-way radios, repeater sites, microwave radio, powerline carrier, supervisory control, telemetering equipment, telecontrol standby power equipment and security systems.\nRead, interpret and troubleshoot complex protective relaying schemes and determine any corrective actions needed to solve problems.\nAs required, undertake cost estimates, basic designs, job planning, scheduling, work documentation and reports.\nLiaise with other internal or external parties to provide technical expertise as required.\nWilling and able to provide technical training in areas covered under job duties to others in the workforce including those at a lower employee classification.\nSubject to Standby and Callouts. Will be required to establish residence as per the Standby policy.\nPerform duties normally carried out by a lower classification employee\n\nRequirements\n\nSpecial Skill Requirements:\nDemonstrated interpersonal skills (written/oral) to effectively communicate with crews, staff and public\nEffective job execution skills with good problem-solving abilities\nSelf-starter with ability to work well on own and as a part of a team\nAdaptable and confident – able to maintain a constructive, positive attitude when plans change\n\nKnowledge And Experience Requirements\nDiploma in Electrical, Electronics or Instrumentation Technology\nJourneyman Electrical tradesman (Red Seal) or Power System Electrician (PSE)\nPractical experience in work related to generating, substation or terminal station equipment\nMust possess a strong computer background\nPractical experience in the use of tools and electrical testing equipment\nMust be holder of a valid Class 5 Driver’s License\n\nAdditional Information\n\nThis position supports our Network Operations group by maintaining and operating the 40 electricity substations within the Okanagan region. Candidates must currently hold a 2 year technologist diploma in addition to a Journeyman Red Seal Electrician ticket or Power Systems Electrician ticket to be considered for this opportunity.", "Customer Experience Sales Floor Dept. Manager": "Req ID\n1417198BR\nLocation\n1555 BANKS ROAD, KELOWNA, BC, V1X 7Y8\nTime Type\nFull Time\n\nCompany Summary\n\nWalmart Canada operates a chain of more than 400 stores nationwide serving more than 1.2 million customers each day. Walmart Canada's flagship online store, walmart.ca, is visited by 750,000 customers daily. With more than 85,000 associates, Walmart Canada is one of Canada's largest employers and is ranked one of the country's top 10 most influential brands. Walmart Canada's extensive philanthropy program is focused on supporting Canadian families in need, and since 1994 Walmart Canada has raised and donated more than $400 million to Canadian charities. Additional information can be found at walmartcanada.ca, facebook.com/walmartcanada and @walmartcanada.\n\nPosition Summary\n\nThe GM Apparel Sales floor Dept. Manager will provide customer service by coordinating the activities of associates to maintain a stocked and zoned salesfloor and offering assistance to meet the customer’s shopping needs. This will be accomplished by assisting at the Front End as required and maintaining and recovering merchandise all in a safe and clean environment. This Department Manager will function as a lead of a team to strategically plan and execute duties based on workload and customer traffic patterns. Shift Requirements: A variety of shifts including evenings and weekends.\n\nPosition Responsibilities\n\nPrimary responsibilities are listed below. Other responsibilities may be assigned.\nAssigning associates to areas of the salesfloor in partnership with the respective salaried Manager\nEnsuring associate breaks are taken in accordance with coverage\nCovering an assigned area on the salesfloor as needed\nZoning assigned area\nWorking recovery merchandise from the Customer Service desk and other areas of the store\nAssisting with Front End coverage\nMoving feature merchandise to its modular home\nExecuting housekeeping as required\nTraining, coaching and offering feedback to associates Provides excellent Customer service through:\nPracticing the 3 Meter Rule\nResponding to customer requests for information and service\nAssisting customer in locating merchandise Ensures that safe work habits are being followed by:\nPerforming warm-up stretches prior to shift\nBeing knowledgeable about emergency and safety procedures\nFollowing pallet jack and equipment safety procedures\nFollowing proper lifting techniques\nMaintaining a safe work area, free of excess debris and fixtures\nFollowing riser and ladder safety\nBeing knowledgeable with lockout/tag out procedures\nProperly handling all liquid and chemical spills\nMaintaining a clean accessible fixture room Ensures cleanliness through:\nDisposing of trash/boxes quickly\nKeeping a clean, hazard free work area\nMaintaining clean modulars Demonstrates initiative and dependability by:\nWorking well on his/her own and requiring very littler supervision and follow-up\nExcelling in a team working environment\nBeing flexible based on the freight flow and demand\nCanada Walmart Division\nRetail Store Associates\n\nQualifications\n\nQualification Requirements To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Previous supervisory and working experience in a Retail environment is an asset. Mathematical Skills Ability to add, subtract, multiply and divide in all units of measure, using whole numbers, common fractions and decimals. Basic Reading/Writing Skills Ability to understand to the meaning of written or printed matter and to record information by inscribing characters or symbols. Certificates, Licenses, and Registrations The associate must complete all Wal-Mart Basic and Advanced Training Modules and classes. The Associate must also be comfortable working with technology and be willing to learn new technological platforms when required. Physical Demands The physical demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions. While performing the duties of this job, the Associate is regularly required to: Spend frequent periods standing with a constant opportunity to move about. It is an occasional requirement to stoop or lift material, fixtures or equipment and climb a ladder. The Associate must regularly lift and/or move up to 9.1 kg (20 lbs.) and occasionally lift and/or move up to 18 kg (40 lbs.). Work Environment The work environment characteristics described in this section are representative of those an associate encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This job is located in a comfortable indoor area. Conditions could produce mild discomfort on occasion, e.g., dust, moderate noise. Regular need to give close attention, either hearing or seeing, to what is happening is required. There is some modest pressure from deadlines or other productivity standards. Work is somewhat repetitious.\n\nLicensing & Other Qualifications\n\nThe Associate must complete all Wal-Mart Basic and Advanced Training Modules and classes\nPhysical Demands\nPhysical Demands The physical demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions. While performing the duties of this job, the Associate is regularly required to: Spend frequent periods standing with a constant opportunity to move about. It is an occasional requirement to stoop or lift material, fixtures or equipment and climb a ladder. The Associate must regularly lift and/or move up to 9.1 kg (20 lbs.) and occasionally lift and/or move up to 18 kg (40 lbs.). Work Environment The work environment characteristics described in this section are representative of those an associate encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This job is located in a comfortable indoor area. Conditions could produce mild discomfort on occasion, e.g., dust, moderate noise. Regular need to give close attention, either hearing or seeing, to what is happening is required. There is some modest pressure from deadlines or other productivity standards. Work is somewhat repetitious.\nSchedule Details\nSA: 7:00am - 11:00pm\nSU: 7:00am - 11:00pm\nMO:7:00am - 11:00pm\nTU: 7:00am - 11:00pm\nWE:7:00am - 11:00pm\nTH: 7:00am - 11:00pm\nFR: 7:00am - 11:00pm\nAccessibility\nWalmart will accommodate the disability-related needs of applicants and associates as required by law.", "Payroll and Benefits Specialist": "THE ORGANIZATION \n\nThe Flowr Corporation is a Toronto-headquartered cannabis company with operations in Canada, Europe, and Australia. Our Canadian operating campus, located in Kelowna, BC, includes a purpose-built, GMP-designed indoor cultivation facility; an outdoor and greenhouse cultivation site; and a state-of-the-art R&D facility that is currently under construction. From this campus, we produce recreational and medicinal products. Internationally, we intend to service the global medical cannabis market through our subsidiary Holigen, which has a license for cannabis cultivation in Portugal and will operate GMP-designed manufacturing facilities in Portugal and Australia.\n\nOur purpose is to Cultivate Better: People, Plants, Products. To this end, we aim to support improving outcomes through responsible cannabis use and, as established experts in cannabis cultivation, strive to be the brand of choice for consumers and patients seeking the highest-quality craftsmanship and product consistency across a portfolio of differentiated cannabis products. All of this can only be achieved through the hard work of our growing, passionate team, who share the core values of being Pioneers, Champions, and Students, in all that we do. Visit www.flowr.ca for more information. \n\nPOSITION SUMMARY\n\nFlowr is seeking an experienced Payroll and Benefits Specialist who will be responsible for the payroll function, benefits administration and other total compensation related functions for the organization across Canada. Reporting into our Director, People and Culture, the Payroll Specialist will partner closely with our controller, as well as our People and Culture team in order to ensure that all pay and benefits related matters are executed on time, in the most efficient and cost effective manner possible. The ideal candidate will have demonstrated the ability to lead the development of the payroll strategy with key internal and external stakeholders to ensure optimal efficiency and effectiveness. This role will be based in Kelowna, BC. \n\nCORE JOB DUTIES\n\n• Manage full-cycle payroll processing for 250-350 employees for a multi-province Canadian payroll (Hourly and Salaried) to ensure employees are paid accurately and timely.\n• Under direction from the People team, assist in creating and maintaining Flowr’s compensation framework, including a job evaluation system with appropriate levels, salary bands, pay equity and total rewards details.\n• Oversee and administer the benefits process, including benefits open enrollment, onboarding and related activities and communications. \n• Provide timely response to inquiries from managers, employees, government agencies and other third-party agencies.\n• Be responsible for ensuring all internal audit processes and procedures are in place to support payroll and data integrity. \n• Ensure consistency of practices and compliance with strategy, policies, standards and regulatory requirements.\n• Lead, organize, and be the point of contact for the implementation project of Flowr’s HR/payroll system - Ceridian Dayforce. Identify best practice opportunities, process gaps and system-enablement improvements. \n• Effectively utilize project management skills and cross-functional collaboration to lead projects and provide recommendations and reports to the People and Culture team and senior leadership as required.\n• Support the People and Culture team in headcount management.\n• Participate in various compensation surveys; providing appropriate compensation and wage information; stay current with industry trends and best practice through market research. \n• Other reasonable duties as may be required from time to time as directed by People and Culture team and the Finance team. \n\nJOB SKILLS & REQUIREMENTS \n\n• Payroll Compliance Certification (PCP) is required \n• Five or more years of progressive payroll experience in a multi-province payroll environment (particularly experience with Ontario and British Columbia) \n• In-depth knowledge of Canadian payroll legislation, Employment Standards, Taxation rules and year-end reporting processes, experience in British Columbia and Ontario payroll legislative requirements is essential.\n• Previous system conversion experience or other experience in leading significant payroll process changes is an asset. In-depth knowledge of Ceridian Dayforce preferred. \n• Strong attention to detail and proven ability to take initiative, make independent decisions, exercise sound judgment, develop creative solutions and meet deadlines.\n• Ability to maintain composure and handle multiple conflicting priorities in a fast-paced environment.\n• Excellent verbal and outstanding written communication skills, including excellent presentation, facilitation, influence, and listening skills, with strong expertise in communicating scientific information.\n• An individual with high integrity, creativity, and a roll-up your sleeves work ethic.\n\nTHE OPPORTUNITY \n\nThis is an exciting opportunity to join a promising industry with lots of room for career growth and advancement. Work alongside a skilled, professional and passionate team that genuinely intends to make a mark in this rapidly growing industry. This role has breadth offering the candidate great experience in a fast-paced environment.   \n\n\n\n\nThe Company is a committed equal opportunity employer. Flowr’s recruitment strategy is designed to attract the best person for each position, to ensure equality of opportunity for all applicants, and to promote our corporate vision and culture. When considering applicants for positions within our Company, only job-related criteria such as ability, merit and responsibility are used to evaluate applicants. Flowr prohibits discrimination or harassment on the basis of any characteristics protected by applicable law.\n\nThe Company is committed to treating all people in a way that allows them to maintain their dignity and independence. The Company believes in integration and equal opportunity. The Company is committed to meeting the needs of persons with disabilities in a timely manner and will do so by identifying barriers to accessibility, removing barriers to accessibility and meeting accessibility standards in accordance with applicable law.\nSeniority Level\nMid-Senior level\nIndustry\nPharmaceuticals\nEmployment Type\nFull-time\nJob Functions\nFinance Human Resources", "Merchandiser, Okanagan": "Job Description\n\nWe are currently recruiting for a passionate, dedicated and hardworking individual to fill our part-time Merchandiser position in Kelowna, BC.\n\nDaily Duties Include, But Are Not Limited To\n\nThe role of a Merchandiser is to provide sales support to the territory Sales Representative and ensure store level merchandising excellence in order to expand sales of Arterra Wines Canada premium wine portfolio from both a volume and market share perspective.\nBuild and merchandise impactful product displays, features, and racks in retail accounts\nWork with store partners to ensure proper rotation of back stock to retail floor, displays and shelf\nEnsure monthly sales are passed on by retailers and tagged at shelf and display\nApply shelf talkers, necktags and related value-added items to inventory at shelf and on display\nApply, maintain and replace impactful branded point of sale materials in partner stores. This includes backer cards, shelf talkers, case cards, posters, price cards, fridge clings etc.\nEnsure Arterra products are appropriately shelved, and maintain this positioning on an ongoing basis\nMaintain overall product and display appearance: dust-free, correctly priced on shelf and in cooler.\nTake photos of displays, competitor’s displays, competitors on packs, new products etc.\nMaintain consistent communication with the sales representative regarding changes in buyer preferences, out of stock inventory concerns/situations encountered, market intelligence and daily call summary\nComplete other special projects as required, including but not limited to trade events, trade shows, consumer tastings, seminars, maintenance of storage unit, staff training and store set ups.\nJob Requirements:\nBeverage Alcohol Industry experience and product knowledge an asset.\nWSET or ISG Certification an asset.\nExcellent communication, interpersonal and organizational skills.\nResults oriented, self-motivated, driven and disciplined.\nThe ability to work independently with minimal supervision\nProof of valid Driver’s License will be required.\nProvide your own vehicle with the proper insurance and driving record within DMV policy guidelines\nMust reside within, or in close proximity to the general area of the sales territory.\nMust be able to lift cases weighing up to 45 pounds on an ongoing, daily basis\nHow to Apply:\nTo apply please email your cover letter and resume to Jim Stansfield, Field Sales Manager at (jim.stansfield@arterracanada.com) or\n\nVisit our webpage and submit your online application. www.arterracanada.com/careers\nNumber of Openings: 1\nWe are committed to establishing a qualified workforce that reflects the diverse population it serves and we encourage applications from all qualified individuals. We are also committed to preventing and removing barriers to employment for people with disabilities, and we invite you to inform us should you have any accessibility or accommodation needs.", "Vocational Rehab Consultant": "Are you interested in being part of a team that helps people injured at work return to work safely? We're looking for knowledgeable, compassionate, and dedicated vocational rehabilitation professionals to work as key members of our case management team.\n\nWe have two-year temporary opportunities available in our Richmond and Kelowna offices. Please specify in your cover letter which locations(s) you prefer. Apply now for positions scheduled to start in June, 2020. We'll be reviewing applications weekly.\n\nYou'll assess the impact of workers' injuries on their employment potential and quality of life, and determine what vocational rehabilitation benefits they're entitled to. You'll also provide vocational counseling and create vocational rehabilitation and return-to-work plans.\n\nWe're Looking For People Who Can\nAssess employment barriers and provide vocational counseling to develop suitable return-to-work and vocational rehabilitation plans that may include work assessments, formal on-the-job training, job search and self-employment support, and job development activities\nUse sound judgment to weigh evidence, interpret policy, and apply discretion to determine eligibility and entitlement to vocational rehabilitation programs and services\nApply organizational and decision-making skills to manage a complex, high-volume caseload\nEstablish and maintain collaborative, professional relationships with various stakeholders, including injured workers, employers, and community health care providers\nAccurately manage rehabilitation expenditures\nMediate and negotiate effectively to help achieve positive outcomes\nThis position requires regular and punctual attendance.\nMeet one of our current vocational rehabilitation consultants to learn more about this job.\n\nYour Experience And Educational Background\nA bachelor's degree in a related discipline such as disability studies, vocational counseling, rehabilitation counseling, social work, physiotherapy, psychology, occupational therapy, or kinesiology\nFour years of directly related experience in vocational rehabilitation counseling, career or employment counseling, vocational evaluation, vocational rehabilitation planning, employability assessment, or rehabilitation management\nA relevant professional designation is preferred. This includes Certified Vocational Rehabilitation Professional (CVRP), Registered Rehabilitation Professional (RRP), Certified Rehabilitation Counsellor/Canadian Certified Rehabilitation Counsellor (CRC/CCRC), and Canadian Certified Vocational Evaluator (CCVE)\nAn understanding of disability management and return-to-work principles and practices and vocational or psycho-vocational tests in the context of vocational rehabilitation\nExperience working in a computerized work environment with common computer applications, such as Microsoft Word\nA valid driver's license and the ability to travel throughout the province and stay overnight is required\nWe'll consider an equivalent combination of education and experience.\n\nYour resume does not need to be limited to two pages and should provide details of all your work responsibilities for each position you've held. Please include the month and year you started and left each position and whether the position was full or part-time.\n\nYou must submit your application by 4:30pm on the closing date of the competition.\n\nIf you require an accommodation in the assessment process, please email the HR Testing Accommodation (SM) at the time you submit your application.\nWho are we?\nAt WorkSafeBC, we're dedicated to promoting safe and healthy workplaces across British Columbia. We partner with workers and employers to save lives and prevent injury, disease, and disability. When work-related injuries and diseases occur, we provide compensation, and support injured workers in their recovery, rehabilitation, and safe return to work. We also work diligently to sustain our workers compensation system for today and future generations. We're honoured to serve the 2.4 million workers and 245,000 registered employers in our province.\n\nWe recognize that our ability to make a difference relies on building a team with a rich variety of skills, knowledge, backgrounds, abilities, and experiences, and which reflects the diversity of the people we serve. We are committed to fostering a welcoming, inclusive, and supportive work culture where everyone can contribute as their best, authentic self. We encourage all qualified applicants to apply.\nWhat's it like to work at WorkSafeBC?\nIt's challenging, stimulating and hugely rewarding. Our positions offer tremendous diversity and excellent opportunities for professional growth. Every day, the work we do impacts people and changes lives. What we do is important and so are the people we do it for.\n\nOur Benefits\n\nBeing part of WorkSafeBC means being part of a strong, committed team. Along with a competitive salary starting at $78,447, your total compensation package includes vacation, optional leave arrangements, health care and dental benefits, and contributions toward your retirement pension. As a member of our team, you'll have access to services and benefits that can help you get the most out of work — and life. Learn more about what we offer .\n\nIf you're the successful applicant, we'll be making a conditional offer contingent upon your clearing a criminal record check under the Criminal Records Review Act . At the time of offer, you'll need to provide consent for a criminal record check. Once we receive clearance, we'll confirm your offer of employment.\n\nThis position is restricted to those legally entitled to work in Canada.\n\nThank you, in advance, for applying.", "Service Manager": "Position Profile:\nThe Kelowna Service Manager is responsible for managing the business of Roofing services, installation, maintenance and repair. In this role, they will serve clients of commercial properties, industrial, and institutional facilities.\n\nResponsibilities include:\nManage customer’s accounts, including invoicing and aged accounts receivables\nDevelop and maintain relationships with customers\nIncrease sales volume by meeting the specific needs of our customers\nReview quotes and tenders for maintenance to look for further sales opportunities; review repairs and mechanical upgrades as well as tenders for new roofs and roof replacements, as required\nReview roof reports with photos, roof CAD drawings, and quotes to look for further sales opportunities and then present them to the client in clear and concise language\nConduct bi-weekly staff meetings\nReview service financials\nProduce an annual budget for sales and overheads which predicts staff and equipment acquisitions\nResponsible for all department staff including, hiring, terminating, goal setting, and performance reviews\nAttend conventions and conferences as required\n\nSkills/Qualifications Include:\nSales-driven and customer service oriented\nExperience in a management role within a construction environment\nSkilled at solution selling and tailoring Flynn’s products and services to meet our client’s unique and specific requirements\nStrong management, delegation, planning, sales, and leadership skills\nExcellent communication and organizational skills\nAble to use MS Office Suite (Word, Excel, PowerPoint, Outlook)\nComfortable with heights and climbing a ladder\nPreference given to those with experience in the commercial roofing industry\n\nAdditional Information:\nWe are also highly active and committed to creating an environment which is accessible to all of our customers, employees and applicants. Reasonable accommodations in the hiring process will be provided to people with disabilities upon request.\n\nFlynn Group of Companies is an affiliated contractor with the Helmets to Hardhats Program.\n\nFor more information about starting your career with Flynn please visit www.flynncompanies.com", "Educator": "who we are\n\nYoga is our first love, and we also make technical product for running, training and pretty much every other way you like to sweat. You can find our stores all around the world, from Vancouver to Dubai, and places in between. Our vision is to create transformational experiences for people to live happy, healthy, fun lives and our mission is to elevate the world through the power of practice.\n\nwho you are\n\nYou are the foundation of our success as an organization. You are an expert in creating world-class guest experience in our retail stores. You deliver this experience by connecting with our guests, sharing top-quality product education, and speaking authentically about our community and culture.\n\nYou share exemplary product knowledge in every guest interaction, through education on special features, benefits, fabric properties, usage and care instructions in a way that is relevant to each unique guest, and you collect design feedback to continually elevate lululemon product design. You leverage product resources to elevate technical product knowledge, and you share your knowledge with other members of the team to elevate the level of technical education on the floor every day.\n\na Day In The Life\nYou create relationships with every guest to create excitement and fun about our culture, product and community, and you go above and beyond to exceed their expectations\nYou are knowledgeable and up to date on company communication, priorities, roll-outs and any additional information required by the Store Manager; you educate on guest-facing initiatives on the retail floor\nYou receive and process stock, involving: unpacking, counting, tagging as required, folding, sizing and placing on the floor, with overflow stock in back room and stored areas\nYou unpack boxes for inventory as required (boxes can weigh 5 - 30 lbs)\nYou are responsible for inventory management including receiving, processing, restocking + destocking, and visual merchandising\nYou assist in preparing the store for the day including: replenishing garment styles and other merchandise by color, size, and quantity requirements; folding, sizing, merchandising and changing mannequins as needed to maximize sell-through\nYou answer store phones and respond to voicemails and store email account as needed\nYou ensure items from fit rooms are cleaned, organized and returned to appropriate area\nYou prepare garments for hemming including pinning, completing necessary documentation (guest/store hemming slip); and educating regarding timelines for completion as well as preparing garments for guest pickup and/or shipping\nYou arrange shipping from store to guests, stores and warehouse as needed\nYou assist in closing the store for the day including: sizing, cleaning, collecting and removing trash and recycling and other duties as needed\nYou utilize Point of Sale system to accurately and efficiently process guest transactions; payments, refunds/exchanges and gift cards\nYou use hand held mobile devices to access and order product for our guests from our distribution and ecommerce channels\nYou are aware of company safety policies and procedures and you work in partnership with your team to ensure a safe workplace\nYou educate on your local community programs including local studios, instructors and events\nYou demonstrate exemplary community education in every guest interaction and you explain the “why” behind events/experiences and enroll guests in attending them\nYou facilitate relationships with sweat influencers in your store’s community by enrolling relevant guests in our Sweat Collective program and gathering product feedback\nYou know all current ambassadors by name and expertise and you facilitate the introduction of ambassadors to the team and other leaders in the community\nUnder the direction of the Store Manager/Assistant Manager/Key Leader, you perform/complete other additional projects, duties, and assignments as required and/or by request\n\nMust Haves\nYou have a passion for customer service and delivering an exceptional experience for guests\nYou integrate fun and joy as a way of being and working (aka you don't take yourself too seriously)\nYou acknowledge the presence of choice in every moment and take personal responsibility for your life\nYou possess an entrepreneurial spirit and continuously innovate to achieve great results.\nYou communicate with honesty and kindness, and create the space for others to do the same\nYou lead with courage, knowing the possibility of greatness is bigger than the fear of failure\nYou foster connection by putting people first and building trusting relationships\n\nQualifications\nAll employees’ availability must reflect the needs of the business, which may change from time to time. The Store Manager determines the availability needs, and this schedule could include a combination of shift times, including mornings, evenings, and weekends\nlululemon reserves the right to make amendments to the schedule and/ or availability requirements from time to time and at its sole discretion\nAll employees are expected to be available to work “Black Friday” (the day after US Thanksgiving) and from the second week of December (the start of the second week in period 11) until the end of the holiday season, to be defined each year based in part on the time period guests are permitted to return holiday merchandise, on an annual basis\nApplicants are a minimum of 18 years of age\nHigh school diploma or GED preferred\n\nThe Finer Print\nWho your leader is: Store Manager, Assistant Manager(s) + Key Leaders\nWhere you spend your time: Retail floor\nHours expectation:\nPart time: up to 19 hours\nFull time: 20-40 hours\nStatus: Non-Exempt\n\n\nNOTE: Only those applicants under consideration will be contacted. Please accept our utmost appreciation for your interest. lululemon is an Equal Employment Opportunity employer. Employment decisions are based on merit and business needs, and not on race, color, creed, age, sex, gender, sexual orientation, national origin, religion, marital status, medical condition, physical or mental disability, military service, pregnancy, childbirth and related medical conditions or any other classification protected by federal, state or provincial and local laws and ordinances. Reasonable accommodation is available for qualified individuals with disabilities, upon request. This Equal Employment Opportunity policy applies to all practices relating to recruitment and hiring, compensation, benefits, discipline, transfer, termination and all other terms and conditions of employment. While management is primarily responsible for seeing that lululemon equal employment opportunity policies are implemented, you share in the responsibility for assuring that, by your personal actions, the policies are effective.\n\nPrimary Location\n\nCAN-British Columbia-Kelowna\n\nJob\n\nStore Operations\n\nUnposting Date\n\nOngoing", "Technical Service Representative I": "Xerox (NYSE: XRX) makes every day work better.  We are a workplace technology company, building and integrating software and hardware for enterprises large and small.  As customers seek to manage information across digital and physical platforms, Xerox delivers a seamless, secure and sustainable experience. Whether inventing the copier, the ethernet, the laser printer or more, Xerox has long defined the modern work experience. Learn more at www.xerox.com and explore our commitment to diversity and inclusion!\nXerox Service Technician Location: Territory Coverage Kamloops - Kelowna, BC\nThe incumbent is accountable for the diagnosis and repair of Xerox photocopiers and multifunctional devices. Xerox will train the individual and will develop the necessary product knowledge, troubleshooting, customer and territory management skills through formal classroom training at a Xerox facility. The products to be supported are a mix of color, black and white and other products installed in the territory.\nRESPONSIBILITIES \n- Assume responsibility for coverage to an assigned territory\n\n- Correct service problems within the assigned product mix\n\n- Complete the required reports and records accurately and in a timely manner\n\n- Plan and install mandatory and optional retrofits\n\n- Communicate effectively with customers and Xerox employees\n\n- Attend and satisfactorily complete required Xerox training programs\n\n- Demonstrate proper care and maintenance of Xerox property\n\n- Represent Xerox to customers in a professional manner\n\n- Work and communicate effectively in a large work-group.\n \n\n- The position is full time with benefits. Xerox will provide vehicle, laptop, cell phone and all tools needed.\n\n- Xerox will provide all necessary training.\n\n- Must have Valid Class 5 drivers license and clean drivers abstract\n\n- Must be able to pass a criminal background check\n\n \n\n ", "Part Time Merchandiser - Kelowna": "Auto req ID: 204675BR\n\nJob Description\n\nPEPSICO BEVERAGES CANADA\n\nAccount Merchandiser\n\nThe Role\n\nYou are passionate about improving the consumer buying experience through the execution of flawless merchandising standards. This includes rotating and re-stocking products into shelves, racks, and displays. PepsiCo merchandisers are detail oriented, customer-focused and self-driven to create enticing marketing displays that drive brand awareness of our current promotions.\nHours: 25-40 hours a week\nShifts: Wednesday - Sunday from around early mornings to afternoon\nThe Company\nPepsiCo Canada is recognized as one of Canada’s top 100 employers. PepsiCo products are enjoyed by consumers more than one billion times a day in more than 200 countries and territories around the world. Our product portfolio includes 22 world-famous, billion-dollar brands; from Gatorade to Quaker, Tropicana to Lay’s and more. We make hundreds of enjoyable foods and beverages that are loved throughout the world.\n\nAt PepsiCo Canada, we are always centered on the consumer, developing exciting brand campaigns and continuously driving product innovations. Our people are our greatest asset! By supporting their ability to work effectively together and providing them with the tools they need to succeed, we are ensuring that PepsiCo Canada is the company you want to work for!\n\nWhat You’ll Be Doing\nMerchandising Pepsi products into store shelving, racks, coolers and displays by transporting product from the store’s stock room to different points of purchase using manual or powered equipment\nMaintaining back room stock in neat and orderly condition\nSupporting execution of store promotions by ensuring all shelves are filled and promotional materials are maximized throughout the account\nFollowing FIFO procedures and rotating out expired products to ensure freshness of Pepsi products\nWorking collaboratively with the Account Sales Representatives and Delivery teams to provide top quality servicing of all Pepsi accounts\n\nQualifications/Requirements\n\nWho’s a good fit for the team:\nYou have your high school diploma (or equivalent)\nYou hold a valid Class 5 license and have access to your own vehicle\nIf you have prior merchandising or customer service experience, that’s an is an asset\nPrevious grocery store experience is also an asset\nYou must be able to repeatedly lift up to 50 lbs unassisted and push or pull up to 200 lbs using a palette jack\nYou must enjoy working independently and be self-driven in an autonomous work environment\nYou have excellent time management skills and can organize and prioritize your day well\n\nWhat You Can Expect From Us\nCompetitive compensation\nA flexible working environment that promotes a healthy work-life balance\nA dynamic and inclusive culture that promotes you to bring your whole-self to work\nA supportive team that will encourage your professional growth and development\nAn opportunity to be meaningful and impactful within your work\n\nSuccessful applicants will be required to pass a background check which includes a criminal record check, a reference check, a general employment verification, and confirmation of high school (or equivalent credential) completion.\n\n#PBH\n\n#GD-PBC\n\nJob Type: Part-Time", "People & Talent Manager": "People and Talent Manager in Kelowna\nExperienced in HR programs and talent acquisition? Looking for a new opportunity at a fast-paced studio that works on original IP?\nAs the People and Talent Manager at this studio in Kelowna, you will take on responsibility for driving innovation through leadership of all People practices throughout the studio. You will be building HR systems and processes to support the people who work there, whilst also working on some more day-to-day tasks.\nThe studio aims to connect people through entertainment. They continuously invest and coach their people and have a lot of respect for the unique and creative approaches that different people are able to bring to the table. As a part of the team you will benefit from profit-sharing bonuses, relocation support, health and dental care and an annual self-development budget!\n\nPeople And Talent Manager Key Responsibilities\n\nDesign and execute HR programs that drive performance and development\nEstablish and support a positive culture within the studio and team\nLead talent acquisition, job evaluations, onboarding and more\nStay on top of industry best practices to implement policies to ensure compliance with company guidelines\nCoach team members to aid their professional growth\n\nEssential Requirements For This Role In Kelowna\n\nSignificant experience in progressive HR within a tech or start-up environment\nHold a relevant post-secondary education certification in HR ideally CPHR designation\nProficient in Google Suite and HRIS systems\nIf youd like to apply to this role, contact jr@skillsearch.com, or apply online now by submitting your CV below.\nTags: Talent Acquisition, Recruitment, Director, People Culture, Mobile Games, Canada, Video Games\nA little bit about the city: Kelowna\nLocated in British Columbia, Canada, and on the shore of the beautiful lake Okanagan, Kelowna is a city just east of Vancouver, without the Vancouver price tag! If youre looking for beautiful scenery, you will be spoilt for choice in Kelowna. Residents can enjoy hiking in the mountains, water sports on the lake and a nearby ski resort offers a ski and snowboarding paradise. There are several neighbourhoods in Kelowna, but Glenmore is known for accepting newcomers to the city, and is also perfect for families, although there are many other neighbourhoods to choose from if youre looking for a more young and fun feel.\nSeniority Level\nAssociate\nIndustry\nMarketing & Advertising Computer Software Staffing & Recruiting\nEmployment Type\nFull-time\nJob Functions\nHuman Resources", "Part-Time Marketing Associate in Kelowna": "We are filling the final spots on our student marketing teams through the area as we begin marketing our home servicing business for the 2020 season! We are looking for motivated, personable people that want a job that rewards them for how well they do it!\nWhat's this thing all about?\nWork in a fast paced environment, can't be bored here!\nPerformance based pay - the harder you work and more skills you build, the most you will earn!\nThe ability to set your own schedule (work takes place on evenings and weekends)\nWork local! We operate all over the place!\nA great way to gain sales experience and interpersonal skills! People who enjoy other people tend to excel in this role.\nPotential for future promotion opportunities in future summers - We like to promote and build our people!\nWhat will you do?\nBreath some fresh air while getting some exercise and getting to meet a bunch of cool new people in your neighborhood!\nGenerate window cleaning, eavestrough cleaning and siding cleaning customer leads through door-to-door marketing offering free estimates, earning $15 per lead. You can make between $15-$25+ per hour depending on your performance!\nSchedule estimates for local student production managers\nPotential to learn to perform estimates and schedule work if succeeding in generating leads\n\nWe will be connecting with candidates who are interested in the next short while, and look to have our team hired as soon as possible!\nIf you are interested in learning more about what we do, please reply with your resume!", "Future Opportunities: The Source - Sales Associate - Kelowna, Orchard Park Mall": "The Source is Canada’s largest tech retailer, and every day we come into work excited to share cool tech and amazing brands with our fellow Canadians. From your local shopping centre to cool music festivals, we are where Canadians live, work and play.\n\nEvery day our Associates across the country help Canadians find the tech they want and need. The Source is a great place to work and we are committed to your development through best in class training programs that help you do your best. Behind our in-store Associates is a supporting team of professionals who curate our product assortment, ensure on-time deliveries, create engaging marketing campaigns and help keep our systems running at peak capacity.\n\nWe are passionate about what we do and look for individuals with their own passion, curiosity and genuine helpfulness to join us!\n\nWhat You’ll Do\nYou’ll be a passionate brand ambassador\nYou’ll contribute to the team’s success by achieving personal sales goals\nAs a Sales Associate, you’ll be an expert in all things tech, and you will help build easy solutions for our customers\nYou will work closely with your teammates to ensure the store is running at its peak operational performance\nYou will stay ahead of the curve by completing training regularly – and then share what you’ve learned with others\n\n\nWhat You’ll Need\nYou need to be passionate about connected technology and how it impacts people’s lives\nYou will need to have great people skills – for example: being a good listener, able to build relationships, and able to overcome objections\nA natural curiosity about technology, telecommunications, and sales\nExperience in retail or sales a definite asset\nYou’ll need to be flexible: ability to work weekdays, evenings, and weekends is a must\n\n\nWhat You’ll Get\nYou’ll be exposed to hands-on and handheld training – get ready to learn!\nOur rewards and recognition programs are vast: enjoy variable pay based on your personal sales, as well as other cool incentives like chances to win trips abroad or even seeded devices\nYou’ll enjoy a compensation package that includes a base wage plus uncapped commissions: most of our associates make between $16 and $19 hourly*\nYou’ll get awesome discounts on nearly all of our products\nThinking about building a career with us? Explore endless internal opportunities in both retail and in corporate roles\nThis range is not a guaranteed rate. The range presented is an approximation based on current associates’ commissions and base wages. As it is an uncapped structure, associates may make more than presented, though associates are guaranteed their base wage as outlined by their employment contract.\n\nPosition Type: Retail Stores\nPosition: Sales Associate\nJob Location: Canada : British Columbia : Kelowna\nApplication Deadline: 04/01/2020\n\nAs Canada's neighborhood tech retailer, we're proud to offer a competitive compensation package including an extensive recognition and rewards program, career development opportunities, multi faceted training programs, competitive medical and dental benefits, charity and volunteer opportunities and of course, associate discounts!\n\nThe Source celebrates and embraces diversity as part of our culture. We strive to be an inclusive, equitable and accessible environment that supports both our internal and external customers, ensuring everyone feels valued and respected.", "Cellar Hand": "Cellar Hand\n\nCedarCreek Estate Winery\n\nKelowna, British Columbia\n\nPermanent, Year-Round\n\nAbout Us\n\nOur Winery is in the heart of British Columbia’s Okanagan Valley, building on more than three decades of winemaking, and defining a new chapter with bright, expressive North Okanagan wines. Our year-round tasting room and Home Block restaurant, housed in contemporary farmhouse buildings, offer our visitors an exceptional experience in a serene natural setting.\n\nOur Winemaking\n\nCedarCreek sources organically farmed fruit from estate vineyards between Kelowna and Osoyoos, with production split approximately half between white and red. Our facility is a certified organic production facility with plans to convert 100% of viticulture and winemaking to organic by 2021. We have the capability to sort to individual berries, and we ferment in concrete, stainless, and oak, with one of the largest barrel programs in the valley. We use techniques such as whole bunch press, skin contact, extended maceration, and spontaneous fermentation and malolactic fermentation to help build personality into our wines across the spectrum.\n\nOur emphasis is on cool climate varieties - Pinot Noir, Chardonnay, Riesling, Pinot Gris, and Sauvignon Blanc. We have 35 acres planned for planting at CedarCreek in 2020 and 2021 with a focus on building a self-sustaining property from a winemaking and culinary perspective. This exciting opportunity to be a part of a winery team goes well beyond winemaking to other parts of the business.\n\nDay In The Life\n\nOur Cellar Hands contribute as a member of our winemaking team dedicated to producing world-class wines and providing the finest and most intimate estate winery experience. They participate in the execution of all winemaking activities at the CedarCreek Estate Winery related to the production of our VQA - British Columbia wine portfolio.\n\nWant to know more? You will…\nCoordinate and execute all aspects of cellar activities - with a strong emphasis on attention to detail.\nAssist in monitoring of the qualitative and analytical states of all wines.\nEnsure presentation, organization and sanitation of the cellars is always of the highest standard.\nAssist with bottling (as required) - labour requirements, finished goods shipping, production records and any other related details.\nExecute the shipping and receiving of goods from and to bottled-wine warehouse.\n\n\nMust Haves\nUniversity degree in Oenology/Winemaking or applicable Science Related Field (preferred); Diploma in Oenology/Winemaking or applicable Science Related field (minimum requirement).\nIdeally a minimum of 2 harvest experiences, preferably one international,\nProficient in operation of all production equipment.\nMust have complete knowledge of the operation and correct application of cellar equipment.\nAbility to prioritize and manage multiple projects at one time.\nStrong computer literacy experienced with MS Office and the ability to learn and use company wine inventory system (VinTrace).\nExcellent oral and written communication skills.\n\nCedarCreek is dedicated to the growth of our team and provides excellent internal opportunities for those who are committed to learning and personal development. This permanent, year-round opportunity offers a competitive compensation package including 3 weeks’ vacation, extended health & dental benefits, and eligibility to participate in a DPSP and RRSP matching program.\n\nIf this sounds like you, head over to our website at www.cedarcreek.bc.ca, and submit your online application today. Interested in spending Harvest 2020 with us?! Please apply with harvest in your resume title!", "Field Service IT Technician": "Vodastra Technologies is seeking a Field Service IT Technician to join our team! You will resolve computer-related issues for your clients.\n\nResponsibilities\nProvide technical assistance with computer hardware and software\nResolve issues for clients via phone, in person, or electronically\nRecommend hardware and software improvements\nTrack customer issues and resolutions\n\n\nQualifications\n\nPlease contact Chris@469-469-0455 or chris.pierson@vodastra.com if you meet these qualifications.\nPrevious experience in IT, customer service, or other related fields.\nStrong troubleshooting and critical thinking skills.\nPrinter/copier and laptop/desktop experience, technical training, or equivalent combination of education and technical experience.\nComputer skills including Microsoft Office Products, networking, and internet browsers.\nKnowledge of using diagnostic tools, service aids, and product schematics, to assess and resolve equipment and system failures\nAbility to maintain and complete accurate record keeping and processing of paperwork.\nMust work well independently, as well as follow directions.\nAble to handle more than one responsibility at a time.\nAble to work under deadline pressures.\nStrong communication skills, organizational skills, and time Management.\nAbility to build rapport with clients.\nPositive and professional demeanor\n\nPowered by JazzHR", "Specialist: Bike Mechanic - Kelowna Store": "The WHY\n\nWhy MEC?\n\nMEC is more than a store, and we’re more than a place to buy hats and backpacks. We’re physical and digital hubs for the outdoor community. People connect here, through our stores, online channels, over the phone, or through one of our leading events, clinics or services.\n\nMEC is an equal opportunity employer. We’re proud to work with our people to create a diverse workplace, which accommodates individuals of all abilities, backgrounds and identities. We welcome and encourage applications from people with disabilities. Tell us what you need during the hiring process, and we’ll do our best to accommodate you.\n\nWhy YOU?\n\nIf you like working with an inclusive, hands-on, collaborative team, who connect people with quality products to encourage active outdoor lives, then this is the team for you. MEC is an awesome place if you’re always learning and trying new things, like bouldering, yoga or trail running!\n\nYou are good natured and have a welcoming vibe. You’re outgoing and genuinely like helping people. You’re stoked about being active outside. You have flexibility to work a variety of shifts from Monday to Sunday. Bonus points if you have retail or customer service experience.\n\nThe HOW\n\nYou connect with members by sharing your passion for an active lifestyle. You ask open-ended questions to build loyalty with members by demonstrating product knowledge and by understanding their needs. You’re stoked to share MEC clinics, services and events. The leadership behaviors we look for at MEC - personal integrity and awareness, customer focus, driver and character, team work and ability to develop self and others - are part of your skill set.\n\nThe WHAT\n\nMechanics\n\nYou assemble, maintain and repair bicycles within MEC's productivity, quality and safety guidelines. Mentor and train frontline staff about bike repair processes and procedures. You do all repairs with MEC sustainability principles in mind. In winter, bike mechanics help in our ski shop, so you’ll also install, adjust and repair ski bindings.\n\nWhat Great Looks Like\n\nYou inspire members to be part of the MEC community through exceptional gear, product knowledge, member service, clinics and events. Members are the reason for everything we do so we listen and respond to them. We provide exceptional service in every interaction.\nSeniority Level\nEntry level\nIndustry\nMarketing & Advertising Internet Retail\nEmployment Type\nFull-time\nJob Functions\nOther", "Server": "Interested in a career that makes a meaningful difference in the lives of others? One where you are valued and respected, listened to, and empowered to live up to your potential? If so, Chartwell Retirement Residences is the place for you.\n\nWe are always looking for empathetic, positive and passionate individuals committed to Making People's Lives Better. With over 200 residences across Canada, we have an opportunity for you that will make a difference in your life.\n\nThe Server is responsible for assisting in the preparation and serving of meals and providing catering services, ensures work areas are maintained in a safe and sanitary condition.\n\nThe responsibilities of the role include but are not limited to:\nPrepares food for serving to residents;\nEnsures resident satisfaction with meal service;\nResponds to resident or family member concerns and ensures appropriate action is taken within decision-making authority and/or brings to the attention of the Food Services Manager/Food and Beverage Manager;\nPerforms the set-up, serving and tear down services at booked catering events;\nEffectively communicates and interacts with residents, family members, visitors and volunteers in a courteous and professional manner. Projects an appropriate image and focuses on customer service excellence.\n\n\nThe Ideal Candidates Will Possess\nPrevious food services experience in a retirement residence, long term care residence or other hospitality environment;\nCompletion of secondary school education or equivalent;\nFood Safe Level 1 Certificate is preferred;\nSmart Serve Certificate is preferred;\nFirst Aid Certificate is preferred;\nAbility or read, write and follow written and verbal instructions in English;\nDemonstrated empathy and understanding of the needs of seniors;\nEffective interpersonal and conflict resolution skills;\nAbility to organize work and work under strict time constraints.\n\nCandidates must be available to work days, evenings and weekends.\n\nTo apply please email your CV/resume to dmueller@chartwell.com\nSeniority Level\nEntry level\nIndustry\nHospital & Health Care\nEmployment Type\nFull-time\nJob Functions\nManagement Manufacturing", "Housekeeper NU": "If you’re passionate about being a part of a team that is, committed to the Team Member Experience and driven by innovation and growth, then join us! Health and Dental Benefits are available with no waiting period for successful candidates.\n\nThe Housekeeper is a critical role within our communities as it impacts the lives of residents and ignites the warmth of human connection.\n\nAs a Housekeeper your typical day will impact in the following ways:\nReceiving assignment, assembling required materials and supplies, loading service cart and transporting to work area.\nPerforms resident room cleaning as per assigned schedule.\nPerforms cleaning and disinfecting duties such as sweeping, dry/wet mopping, vacuuming and rearranging furniture.\nEnsuring privacy of residents during performance of duties.\nPreparing room for new occupant following prescribed procedures to ensure tour ready at all times.\nNotifying supervisor when supplies are low or equipment is malfunctioning.\nPerforming other duties as assigned.\nMust Haves\nPrevious housekeeping experience is required.\nAbility to read, write English and follow written instructions.\nGood understanding of chemical and equipment use.\nAbility to work independently or as a team.\nGood understanding of chemical and equipment use.\nWHMIS trained.\nStrong customer service skills and ability to effectively communicate with residents and team members.\nAll applicants must successfully pass the prescribed Vulnerable Sector Check. Applicable to Ontario applicants.\nAll applicants must successfully pass the prescribed Criminal Records Check. Applicable to British Columbia applicants.\nAct upon your desire to help others and Join Sienna Senior Living as we continue to enhance the lives of those we serve.\n\nFor Ontario locations, in accordance with the Accessibility for Ontarians with Disabilities Act 2005, upon request, support will be provided for accommodations throughout the recruitment, selection and assessment process.", "Journeys Part-Time Sales Associate Canada": "WHY WORK FOR SHOES?\nWe’re committed to our people – we want you to succeed!\nWe offer rapid promotions for top performers – we promote from within.\nTangible results of your hard work reflected in your paycheck… Work Hard- Make Good Money, Work Harder- Make GREAT Money!\nCompensation includes base pay, sales commission, and bonus potential.\nGreat Store Environment\nExcellent Benefits\nWe are fun, a bit irreverent and encourage you to embrace your individuality.\n\nSales Associate - Job Description\nMeet and exceed personal sales goal and standards of performance.\nBe aware of store sales goal.\nProvide a fun, full service experience to all customers.\nComplete all point of sale functions as required.\nComplete all assigned tasks and responsibilities promptly.\nPerform all Operational/Loss Prevention procedures accurately according to policies.\nMaintain store appearance and stockroom organization.\nEffectively communicate all store needs to management\nStay informed of current fashion trends.\nComplete all required training.\nUnderstand the Journeys culture and demonstrate it to the team.\nPrior retail sales experience preferred.\nAbility to multi-task in a fast-paced environment.\nExcellent interpersonal and customer service skills.\nDesire to succeed in fast paced retail environment.\nWillingness to learn.\nAbility to climb, reach, bend, and lift up to 50 pounds.\nAbility to work night and weekend shifts.\nStand for long periods of time\nMust be at least 16 years of age.", "Financial Advisor - Okanagan Kootenay & Area": "The Financial Advisor Opportunity\n\nWe’re looking for dedicated people with an entrepreneurial spirit and an agile and proactive mindset who want to help Canadians achieve their financial goals. Perhaps you are considering a career change or, if you are currently in the industry, you are seeking an opportunity to improve outcomes for yourself and clients. Becoming a financial advisor with IG Wealth Management requires a high degree of dedication, commitment, and effort. For the right individual, combined with our support, this will be a highly rewarding career both personally and professionally. We are committed to excellence. Today, over 1,400 of our Consultants hold the CFP or F. Pl. designation, with a goal of having 100% of Consultants certified.\n\nIt’s a Rewarding Career And We Invite You To Explore The Opportunity We Offer\n\nAt IG Wealth Management, you build your practice on your terms – working directly with clients to develop relationships, provide comprehensive financial plans, and help them achieve financial confidence with their life-long financial goals.\nProvide industry-leading training, support, and ongoing development throughout your career\nSupport you through a team of advanced financial planning experts and a network of wealth planning, mortgage, and insurance planning specialists\nOffer exceptional income potential, where your earnings are reflective of your efforts.\nEncourage independence and work-life synergy as you plan your schedule\n\n\nAbout IG Wealth Management\n\nOur goal is to be Canada’s financial partner of choice.\nFor more than 90 years, we have built meaningful, long-term relationships with our clients and their families. Our synchronized approach to financial planning looks at all aspects of a client’s financial life. We take the time to explore all the life goals, financial aspirations, and concerns clients have for themselves and their families, and then follow up with a comprehensive analysis of their overall financial well-being. We know that life is dynamic, so we assess and adjust client plans as their circumstances change. This approach enables them to take advantage of the possibilities that life brings and helps them realize their full financial potential. Today we deliver financial planning and wealth advice to more than one million Canadians coast to coast through our network of financial advisors.", "Management/Sales Trainee": "La Description\n\nBienvenue chez Sherwin-Williams\n\nSherwin-Williams est la plus grande entreprise de peinture au monde. Avec un chiffre d’affaire de 15.8 milliards de dollars, plus de 4,100 magasins et 140 centres de production et de distribution dans le monde entier. Nos 60,000 salariés à travers le monde sont diversifiés, innovants et passionnés. Avec une variété d’opportunités stimulantes et enrichissantes, Sherwin-Williams est l’endroit pour démarrer une carrière. Trouvez la vôtre et rejoignez-nous aujourd’hui.\n\nSi vous pensez avoir ce qu’il faut pour être un expert, un formateur, un analyste, pour résoudre efficacement les problèmes ou tout simplement un bon leader, vous pouvez faire partie de l’équipe de gestion Sherwin Williams. Notre programme de formation en Gestion est conçu pour vous fournir toutes les connaissances nécessaires pour vous bâtir une belle carrière en gestion ou en vente.\n\nNotre programme de formation en gestion inclus des modules d’autoapprentissage, de la formation structure sur le terrain, des cous en classe à notre centre de formation de même qu’une éducation continue tout au long de votre carrière. Votre formation couvrira tous les aspects de la gestion de magasin, incluant la peinture, les produits associés, le service à la clientèle, les ventes professionnelles et marketing, crédit et gestion des comptes recevables, gestion des ressources humaines, gestion des profits et pertes et de la mise en marché.\n\nAprès avoir compléter le programme de formation, vous serez aptes à progresser au travers de plusieurs positions en gestion d’un magasin de peinture. Nos assistants de magasins et gérants de magasins gèrent des magasins d’un millions de dollar, fournissant du leadership et des connaissances approfondies dans les stratégies de développement de leur magasin.\n\nPlusieurs Stagiaires en gestion choisissent une voie qui mène à une carrière dans la vente. Les Professionnel(le)s de la vente de Sherwin-Williams accroissent la part de marché de la compagnie en vendant à des clients commerciaux, tel que les entrepreneurs peintres, les acheteurs, les manufacturiers et autres clients commerciaux qui nécessitent un gros volume de nos produits de haute qualité. Généralement, les Professionnel(le)s de la vente appliquent leur expertise sur des territoires spécifiques. Les Stagiaires en gestion sont éligibles aux postes de Professionnel(le)s de la vente lorsque leur réussite en magasin a été établie.\n\nExigences De Base\nDoit posséder un permis de conduire valide.\nDoit posséder un Baccalauréat d’une université accréditée ou en obtenir un dans les 12 prochains mois.\nDoit être légalement autorisé(e) à travailler dans le pays d’embauche sans parrainage pour visa d’emploi.\nDoit pouvoir récupérer du matériel sur des tablettes ou des piles sur le sol et transporter jusqu’à 50lbs\nDoit pouvoir teinter de la peinture, donc doit avoir une bonne perception de la couleur\nDoit pouvoir opérer un ordinateur et communiquer par téléphone.\nExigences Souhaitées\nExpérience précédente en vente ou service à la clientèle.\nVolonté de relocalisation pour opportunités de promotion.\nLe bilinguisme serait un atout.\nJoignez-vous au programme de formation qui vous servira de tremplin pour toutes vos aspirations professionnelles.\n\nQui sommes nous;\n\nChez Sherwin-Williams, nous sommes fiers de notre famille d’employés loyaux. Pour en connaître davantage sur notre compagnie et notre culture visitez le Sherwin.com/careers .\n\nEmployeur souscrivant au principe de l'égalité d'accès à l'emploiTous les candidats qualifiés seront considérés pour le poste et pour l'emploi et ne seront pas victimes de discrimination fondée sur la race, la couleur, la religion, le sexe, l'orientation sexuelle, l'identité sexuelle, la nationalité, le statut de vétéran protégé, le handicap, l'âge, la grossesse, l'information génétique ou toute autre considération interdite par la loi ou le contrat.", "Part Time CAREGiver to Seniors - Kelowna": "At Home Instead caring is our passion – and it starts with our CAREGivers .\n\nEvery day families are balancing what feels like a thousand requests, needs, and demands. Many are raising children, working stressful jobs, AND caring for a senior family member. Advances in medicine and healthier lifestyles help seniors live longer and continue to lead more productive lives. But the numbers tell a deeper story: children of seniors who need day-to-day assistance are caught between being an involved, loving parent; a dedicated employee; and a devoted caregiver to the seniors they love. These family caregivers eventually run out of hours in the day and the stress can overcome even the most giving.\n\nThat’s where you come in.\n\nAs a CAREGiver, your job will be to help the senior thrive in their home. By doing that you will also help their children to restore balance, order, and peace to their lives. Caring for seniors is a labour of love that requires a special person with just the right touch. That’s why when you provide care with our Home Instead Senior Care office, you become a CAREGiver with a capital “CARE”.\n\nBecoming a professional CAREGiver is a unique job with many joys and rewards, responsibilities and challenges – both physical and emotional. As a Home Instead CAREGiver you’ll meet wonderful people, build fulfilling relationships, and make a difference in the lives of seniors in your community.\n\nImportant Information\nNo experience or medical skills necessary, we focus on finding amazing people and developing the skill set necessary\nVariable shifts\nAvailability to 15 hrs or more per week. (days, evenings and overnight plus either a Saturday or Sunday)\nCAREGivers require their own personal vehicle and driver's license with no restrictions. We service from Penticton to Lake Country\n\n\nWhat We Offer\nCompetitive Wages\nBenefits package available\nOngoing paid training and education opportunities\nA support team in the office 24/7\nRecognition of the important work you do.\nA fun and rewarding career!", "Estimator and Installer:": "Essentials\nTelephone and on-site professionalism.\nValid driver’s license and reliable vehicle.\nAbility to be flexible with work schedule, including weekends and holidays.\nPossess strong organizational skills.\nDemonstrate strong written and verbal communication skills.\n\nDuties\nPerform site survey complete with maps, photos and documentation.\nProvide detailed list of equipment required for installation.\nCreate proposals, written and verbal for potential clients that will illustrate how Absolute Wi-Fi Solutions will meet their business needs.\nCoordinate installations with technologists.\nCreate property maps outlining installation equipment.\nAt times provide own transportation.\nAt times travel with other technologists.\n\nCompetencies/Skills And Experience\nExtensive knowledge of wireless deployment.\nStrong written and verbal communication skills.\nSolid time-management and organizational skills.\nInterpersonal skills.\nSolid relationship building skills.\nAbility to work within in a deadline driven environment.\nCustomer Focus.\nAble to manage multiple tasks.\nAbility to operate solely and as a member of a team.\nSolid understanding of network and solution design."}