{"Server": "Interested in a career that makes a meaningful difference in the lives of others? One where you are valued and respected, listened to, and empowered to live up to your potential? If so, Chartwell Retirement Residences is the place for you.\n\nWe are always looking for empathetic, positive and passionate individuals committed to Making People's Lives Better. With over 200 residences across Canada, we have an opportunity for you that will make a difference in your life.\n\nThe Server is responsible for assisting in the preparation and serving of meals and providing catering services, ensures work areas are maintained in a safe and sanitary condition.\n\nThe responsibilities of the role include but are not limited to:\nPrepares food for serving to residents;\nEnsures resident satisfaction with meal service;\nResponds to resident or family member concerns and ensures appropriate action is taken within decision-making authority and/or brings to the attention of the Food Services Manager/Food and Beverage Manager;\nPerforms the set-up, serving and tear down services at booked catering events;\nEffectively communicates and interacts with residents, family members, visitors and volunteers in a courteous and professional manner. Projects an appropriate image and focuses on customer service excellence.\n\n\nThe Ideal Candidates Will Possess\nPrevious food services experience in a retirement residence, long term care residence or other hospitality environment;\nCompletion of secondary school education or equivalent;\nFood Safe Level 1 Certificate is preferred;\nSmart Serve Certificate is preferred;\nFirst Aid Certificate is preferred;\nAbility or read, write and follow written and verbal instructions in English;\nDemonstrated empathy and understanding of the needs of seniors;\nEffective interpersonal and conflict resolution skills;\nAbility to organize work and work under strict time constraints.\n\nCandidates must be available to work days, evenings and weekends.\n\nTo apply please email your CV/resume to dmueller@chartwell.com\nSeniority Level\nEntry level\nIndustry\nHospital & Health Care\nEmployment Type\nFull-time\nJob Functions\nManagement Manufacturing", "Housekeeper NU": "If you’re passionate about being a part of a team that is, committed to the Team Member Experience and driven by innovation and growth, then join us! Health and Dental Benefits are available with no waiting period for successful candidates.\n\nThe Housekeeper is a critical role within our communities as it impacts the lives of residents and ignites the warmth of human connection.\n\nAs a Housekeeper your typical day will impact in the following ways:\nReceiving assignment, assembling required materials and supplies, loading service cart and transporting to work area.\nPerforms resident room cleaning as per assigned schedule.\nPerforms cleaning and disinfecting duties such as sweeping, dry/wet mopping, vacuuming and rearranging furniture.\nEnsuring privacy of residents during performance of duties.\nPreparing room for new occupant following prescribed procedures to ensure tour ready at all times.\nNotifying supervisor when supplies are low or equipment is malfunctioning.\nPerforming other duties as assigned.\nMust Haves\nPrevious housekeeping experience is required.\nAbility to read, write English and follow written instructions.\nGood understanding of chemical and equipment use.\nAbility to work independently or as a team.\nGood understanding of chemical and equipment use.\nWHMIS trained.\nStrong customer service skills and ability to effectively communicate with residents and team members.\nAll applicants must successfully pass the prescribed Vulnerable Sector Check. Applicable to Ontario applicants.\nAll applicants must successfully pass the prescribed Criminal Records Check. Applicable to British Columbia applicants.\nAct upon your desire to help others and Join Sienna Senior Living as we continue to enhance the lives of those we serve.\n\nFor Ontario locations, in accordance with the Accessibility for Ontarians with Disabilities Act 2005, upon request, support will be provided for accommodations throughout the recruitment, selection and assessment process.", "Journeys Part-Time Sales Associate Canada": "WHY WORK FOR SHOES?\nWe’re committed to our people – we want you to succeed!\nWe offer rapid promotions for top performers – we promote from within.\nTangible results of your hard work reflected in your paycheck… Work Hard- Make Good Money, Work Harder- Make GREAT Money!\nCompensation includes base pay, sales commission, and bonus potential.\nGreat Store Environment\nExcellent Benefits\nWe are fun, a bit irreverent and encourage you to embrace your individuality.\n\nSales Associate - Job Description\nMeet and exceed personal sales goal and standards of performance.\nBe aware of store sales goal.\nProvide a fun, full service experience to all customers.\nComplete all point of sale functions as required.\nComplete all assigned tasks and responsibilities promptly.\nPerform all Operational/Loss Prevention procedures accurately according to policies.\nMaintain store appearance and stockroom organization.\nEffectively communicate all store needs to management\nStay informed of current fashion trends.\nComplete all required training.\nUnderstand the Journeys culture and demonstrate it to the team.\nPrior retail sales experience preferred.\nAbility to multi-task in a fast-paced environment.\nExcellent interpersonal and customer service skills.\nDesire to succeed in fast paced retail environment.\nWillingness to learn.\nAbility to climb, reach, bend, and lift up to 50 pounds.\nAbility to work night and weekend shifts.\nStand for long periods of time\nMust be at least 16 years of age.", "Financial Advisor - Okanagan Kootenay & Area": "The Financial Advisor Opportunity\n\nWe’re looking for dedicated people with an entrepreneurial spirit and an agile and proactive mindset who want to help Canadians achieve their financial goals. Perhaps you are considering a career change or, if you are currently in the industry, you are seeking an opportunity to improve outcomes for yourself and clients. Becoming a financial advisor with IG Wealth Management requires a high degree of dedication, commitment, and effort. For the right individual, combined with our support, this will be a highly rewarding career both personally and professionally. We are committed to excellence. Today, over 1,400 of our Consultants hold the CFP or F. Pl. designation, with a goal of having 100% of Consultants certified.\n\nIt’s a Rewarding Career And We Invite You To Explore The Opportunity We Offer\n\nAt IG Wealth Management, you build your practice on your terms – working directly with clients to develop relationships, provide comprehensive financial plans, and help them achieve financial confidence with their life-long financial goals.\nProvide industry-leading training, support, and ongoing development throughout your career\nSupport you through a team of advanced financial planning experts and a network of wealth planning, mortgage, and insurance planning specialists\nOffer exceptional income potential, where your earnings are reflective of your efforts.\nEncourage independence and work-life synergy as you plan your schedule\n\n\nAbout IG Wealth Management\n\nOur goal is to be Canada’s financial partner of choice.\nFor more than 90 years, we have built meaningful, long-term relationships with our clients and their families. Our synchronized approach to financial planning looks at all aspects of a client’s financial life. We take the time to explore all the life goals, financial aspirations, and concerns clients have for themselves and their families, and then follow up with a comprehensive analysis of their overall financial well-being. We know that life is dynamic, so we assess and adjust client plans as their circumstances change. This approach enables them to take advantage of the possibilities that life brings and helps them realize their full financial potential. Today we deliver financial planning and wealth advice to more than one million Canadians coast to coast through our network of financial advisors.", "Management/Sales Trainee": "La Description\n\nBienvenue chez Sherwin-Williams\n\nSherwin-Williams est la plus grande entreprise de peinture au monde. Avec un chiffre d’affaire de 15.8 milliards de dollars, plus de 4,100 magasins et 140 centres de production et de distribution dans le monde entier. Nos 60,000 salariés à travers le monde sont diversifiés, innovants et passionnés. Avec une variété d’opportunités stimulantes et enrichissantes, Sherwin-Williams est l’endroit pour démarrer une carrière. Trouvez la vôtre et rejoignez-nous aujourd’hui.\n\nSi vous pensez avoir ce qu’il faut pour être un expert, un formateur, un analyste, pour résoudre efficacement les problèmes ou tout simplement un bon leader, vous pouvez faire partie de l’équipe de gestion Sherwin Williams. Notre programme de formation en Gestion est conçu pour vous fournir toutes les connaissances nécessaires pour vous bâtir une belle carrière en gestion ou en vente.\n\nNotre programme de formation en gestion inclus des modules d’autoapprentissage, de la formation structure sur le terrain, des cous en classe à notre centre de formation de même qu’une éducation continue tout au long de votre carrière. Votre formation couvrira tous les aspects de la gestion de magasin, incluant la peinture, les produits associés, le service à la clientèle, les ventes professionnelles et marketing, crédit et gestion des comptes recevables, gestion des ressources humaines, gestion des profits et pertes et de la mise en marché.\n\nAprès avoir compléter le programme de formation, vous serez aptes à progresser au travers de plusieurs positions en gestion d’un magasin de peinture. Nos assistants de magasins et gérants de magasins gèrent des magasins d’un millions de dollar, fournissant du leadership et des connaissances approfondies dans les stratégies de développement de leur magasin.\n\nPlusieurs Stagiaires en gestion choisissent une voie qui mène à une carrière dans la vente. Les Professionnel(le)s de la vente de Sherwin-Williams accroissent la part de marché de la compagnie en vendant à des clients commerciaux, tel que les entrepreneurs peintres, les acheteurs, les manufacturiers et autres clients commerciaux qui nécessitent un gros volume de nos produits de haute qualité. Généralement, les Professionnel(le)s de la vente appliquent leur expertise sur des territoires spécifiques. Les Stagiaires en gestion sont éligibles aux postes de Professionnel(le)s de la vente lorsque leur réussite en magasin a été établie.\n\nExigences De Base\nDoit posséder un permis de conduire valide.\nDoit posséder un Baccalauréat d’une université accréditée ou en obtenir un dans les 12 prochains mois.\nDoit être légalement autorisé(e) à travailler dans le pays d’embauche sans parrainage pour visa d’emploi.\nDoit pouvoir récupérer du matériel sur des tablettes ou des piles sur le sol et transporter jusqu’à 50lbs\nDoit pouvoir teinter de la peinture, donc doit avoir une bonne perception de la couleur\nDoit pouvoir opérer un ordinateur et communiquer par téléphone.\nExigences Souhaitées\nExpérience précédente en vente ou service à la clientèle.\nVolonté de relocalisation pour opportunités de promotion.\nLe bilinguisme serait un atout.\nJoignez-vous au programme de formation qui vous servira de tremplin pour toutes vos aspirations professionnelles.\n\nQui sommes nous;\n\nChez Sherwin-Williams, nous sommes fiers de notre famille d’employés loyaux. Pour en connaître davantage sur notre compagnie et notre culture visitez le Sherwin.com/careers .\n\nEmployeur souscrivant au principe de l'égalité d'accès à l'emploiTous les candidats qualifiés seront considérés pour le poste et pour l'emploi et ne seront pas victimes de discrimination fondée sur la race, la couleur, la religion, le sexe, l'orientation sexuelle, l'identité sexuelle, la nationalité, le statut de vétéran protégé, le handicap, l'âge, la grossesse, l'information génétique ou toute autre considération interdite par la loi ou le contrat.", "Part Time CAREGiver to Seniors - Kelowna": "At Home Instead caring is our passion – and it starts with our CAREGivers .\n\nEvery day families are balancing what feels like a thousand requests, needs, and demands. Many are raising children, working stressful jobs, AND caring for a senior family member. Advances in medicine and healthier lifestyles help seniors live longer and continue to lead more productive lives. But the numbers tell a deeper story: children of seniors who need day-to-day assistance are caught between being an involved, loving parent; a dedicated employee; and a devoted caregiver to the seniors they love. These family caregivers eventually run out of hours in the day and the stress can overcome even the most giving.\n\nThat’s where you come in.\n\nAs a CAREGiver, your job will be to help the senior thrive in their home. By doing that you will also help their children to restore balance, order, and peace to their lives. Caring for seniors is a labour of love that requires a special person with just the right touch. That’s why when you provide care with our Home Instead Senior Care office, you become a CAREGiver with a capital “CARE”.\n\nBecoming a professional CAREGiver is a unique job with many joys and rewards, responsibilities and challenges – both physical and emotional. As a Home Instead CAREGiver you’ll meet wonderful people, build fulfilling relationships, and make a difference in the lives of seniors in your community.\n\nImportant Information\nNo experience or medical skills necessary, we focus on finding amazing people and developing the skill set necessary\nVariable shifts\nAvailability to 15 hrs or more per week. (days, evenings and overnight plus either a Saturday or Sunday)\nCAREGivers require their own personal vehicle and driver's license with no restrictions. We service from Penticton to Lake Country\n\n\nWhat We Offer\nCompetitive Wages\nBenefits package available\nOngoing paid training and education opportunities\nA support team in the office 24/7\nRecognition of the important work you do.\nA fun and rewarding career!", "Estimator and Installer:": "Essentials\nTelephone and on-site professionalism.\nValid driver’s license and reliable vehicle.\nAbility to be flexible with work schedule, including weekends and holidays.\nPossess strong organizational skills.\nDemonstrate strong written and verbal communication skills.\n\nDuties\nPerform site survey complete with maps, photos and documentation.\nProvide detailed list of equipment required for installation.\nCreate proposals, written and verbal for potential clients that will illustrate how Absolute Wi-Fi Solutions will meet their business needs.\nCoordinate installations with technologists.\nCreate property maps outlining installation equipment.\nAt times provide own transportation.\nAt times travel with other technologists.\n\nCompetencies/Skills And Experience\nExtensive knowledge of wireless deployment.\nStrong written and verbal communication skills.\nSolid time-management and organizational skills.\nInterpersonal skills.\nSolid relationship building skills.\nAbility to work within in a deadline driven environment.\nCustomer Focus.\nAble to manage multiple tasks.\nAbility to operate solely and as a member of a team.\nSolid understanding of network and solution design."}