{"Construction Manager": "Job requirements\n\nLanguages\n\nEnglish\n\nEducation\n\nSecondary (high) school graduation certificate\n\nExperience\n\n1 to less than 7 months\nSpecific SkillsPlan and manage budgets; Plan and prepare construction schedules and milestones and monitor progress; Establish and implement policies and procedures for quality control; Prepare reports; Plan, organize, direct, control and evaluate daily operations", "Developer": "VersaBank is an entrepreneurial, rapidly expanding, Schedule 1 Chartered Bank with over $1.8 billion in assets. We provide innovative financing solutions to high quality borrowers including large corporations and public sector organizations. We are a branchless bank that raises deposits through a nationwide network of dedicated financial planners and deposit brokers. Our team of IT professionals is an integral part of our organization.\n VersaBank (VB) shares trade on the Toronto Stock Exchange.\n Key Responsibilities\n The Developer is responsible for supporting the design and construction of VersaBank’s software. This role will also maintain and provide ongoing development, client support and consultation for VB's deposit systems. The individual in this role will have strong working knowledge of Linux and experience with programming languages such as Python, C#, .Net Core, SQL Server and PostgreSQL.\n What to Expect:\nOpen communicative environment\nA place that desires continuous improvement and innovative ideas\nContribute to new software services\nTeam-base collaboration toward completion of goals\nClose cooperation with end users\nMaintain current systems with an eye to the future\nStrong focus on testing automation\nStrong focus on clean code\nStrong focus on secure software development\nSome Linux system administration duties\n Technologies we use:\nLinux/Windows\nPython\nAMQP\nC#\n .Net Core\nWPF\nVisual Studio\nAnsible\nNginx\nAngular\nJavaScript / CSS / HTML\nGit\nIssue Tracking\nTFS\nSQL Server/ PostgreSQL\nVirtual Machine Technology\n Vagrant\nDocker Containers\n\nQualifications\nBachelor’s degree or post-secondary accreditation in a related Technical, Scientific or Engineering discipline\n1-2 years of experience in the areas specified above or a related field\nStrong understanding of the Linux operating system\nStrong understanding of object-oriented design\nUnderstanding of secure software development lifecycle\nExperience developing a message based distributed application\nExperience with automated testing\nExperience with our technologies\nExperience with database structures and database administration would be an asset\nExperience developing software in a Linux environment is an asset\n The successful candidate has excellent verbal and written communication skills as well as the ability to work independently or as part of a team. They are self-starter who is detail-oriented, highly organized and efficient. You are customer-focused and results driven and are able to work under tight timelines. Project management skills are an asset. \n We offer excellent career advancement opportunities, an informal, positive work environment and a very competitive compensation package that includes base salary, an outstanding benefits package, tuition refund program, fitness club membership and participation in an attractive incentive award program.\n Application Procedure\n If working for a ‘non-traditional’, technology savvy bank with an entrepreneurial flair appeals to you, we encourage you to apply in confidence with your resume and cover letter as soon as possible. \n We thank you for taking the time to submit an application. Please be advised that only those selected for an interview will be contacted.\n  ", "Junior Construction Foreman": "HB&R Construction Ltd. is looking for an eager individual to fill a Junior Construction Foreman position. Applicants will be experienced Construction Workers who have a passion for building and a sense of leadership. We are looking for a candidate that strives to develop not only themselves but also their team.\n\nAs a Junior Construction Foreman you will be responsible for:\nOverseeing project progress and maintaining employee workflow.\nConsulting drawings for layout and preparation of tasks.\nMeasurement and takeoff for material orders.\nManaging and maintaining a safe and clean job site.\nAssisting employees with general construction tasks.\n\nMinimum Requirements\nAt least 8 years experience working in the construction industry.\nExperience with reading and interpreting architectural/structural drawings.\nHands-on experience with concrete forming, concrete finishing and rough framing.\nExcellent communicating skills.\nPersonal hand tools and PPE.\nValid Ontario G Class drivers license.\nFirst Aid, WHIMIS, and Working at Heights Certification.\nExcellent Math Skills\n\nA Successful Candidate Will Also Have\nExperience with ICF Construction.\nExperience leading a small construction crew (3- 6 people).\nExperience dealing with sub-trades and clients.\nSupervising various aspects of a project\nManaging jobsite health and safety.\nJob Type: Full Time\n\nSalary: $26.00 to $40 /hour", "Project Manager, Construction": "Who We Are\n\nOcado is a UK based company admitted to trading on the London Stock Exchange (Ticker OCDO). It comprises one of the world's largest dedicated online grocery retailers, operating its own grocery and general merchandise retail businesses under Ocado.com and other specialist shop banners, together with its Ocado Solutions division.\n\nThe Ocado Solutions division is responsible for providing Ocado’s innovative advanced robotics technology, known as the Ocado Smart Platform (\"OSP\"), to our major retailer clients around the world. OSP comprises access to Ocado's physical infrastructure solutions, running highly efficient warehouse operations for the single pick of products, together with the entire end-to-end proprietary software applications and advanced robotics required to operate a world-class online grocery business.\n\nOur unique, proprietary and industry-leading technology is set to transform the shopping experience of consumers around the world. We have partnered with Sobeys in Canada to help redefine the grocery customer experience through the adoption of the centralized, automated model of online retailing provided by the Ocado Smart Platform.\n\nCome join us as we build our Candian team, bringing world-class innovation and technologies to one of the most exciting global markets for e-commerce.\n\nWhat You Will Do\n\nThe Ocado New Customer Fulfillment Center Implementation Team leads the end to end delivery of our industry-leading customer fulfilment centers (CFCs) around the world. Our Implementation Project Managers play a crucial role within the team for delivering individual CFCs on time, to specification and budget.\n\nThe role involves working as part of a dynamic internal team, and side by side with our partner businesses across the globe to ensure that CFCs are delivered to plan. This is a fantastic opportunity for an experienced, driven individual with comprehensive project management skills and a natural ability to steer, influence, communicate across different levels and negotiate critical project issues. The budgets, scale, and scope of the projects are significant, but the degree of ownership, responsibility, and chance to develop make this position a career-defining role for the right candidate.\n\nDay-to-day Responsibilities Could Include\nAccountability for successfully delivering an Ocado/Sobeys CFC\nManage a circa $100m project to ensure the CFC is delivered on time, to specification and on budget\nManage client relationships with key client stakeholders\nLead and collaborate with internal and external stakeholder teams throughout the construction\nForm fantastic working relationships and build strong on-going partnerships with key teams to ensure alignment across the project and to ensure that deadlines are met\nCollaborate side by side with Implementation Manager counterparts in the UK to ensure wider program alignment, project continuity and delivery synergies\nDrive the project by responding proactively to breaking issues, non-conformances, competing priorities and key dependencies to ensure that the right decisions are taken swiftly\nInspire confidence across the CFC project with timely and professional communications to all levels of the business\nCoordination of risks and issues within the project with regular reporting and escalation to senior management when required\nDeliver status reporting, change management and associated “best in class” project management documentation and administration\nMaintain and monitor progress of the project against Ocados standard project methodology and proactively contribute to the development of best practice\n\n\nWho You Are\n\nTo qualify for this position, you should meet the following requirements:\nA minimum of 5 years’ relevant experience.\nBS/BA degree in a related discipline or advanced degree is preferred.\nExtensive experience in managing complex projects or organizational change programs; ideally this would be in the engineering, construction, logistics or e-commerce sectors\nA highly analytical and logical approach to work, with an ability to plan and prioritise workload to ensure all given deadlines are met\nAbility to understand and challenge expert opinions and show initiative and innovation\nWorld-class collaborator with experience working across complex organizations, with an ability to project a professional enthusiastic image at all times; providing leadership and motivation to the team (incl. stakeholders and suppliers); setting out clear goals parameters\nMust possess strong people skills, with the ability and experience to motivate and influence teams and deliver through others\nStrong skills as a nurturer of energetic and winning cultures within projects\nMust be a driven, self-motivated individual, able to be resilient, adaptable to quickly changing priorities and deliver under pressure\nMust have seasoned experience working with project and program leaders\nExperience managing significant ($10m+) budgets\nFluency in French is not mandatory but is highly desirable\nMust be able to travel, although the role will be predominantly based at the CFC, with a proven ability to manage projects across multiple time zones and flexibility to work remotely and with teams in other time zones.\n\nLocation:\n\nThe role will be based in Pointe-Claire, QC, with a level of travel required to visit other sites and offices internationally particularly within the onboarding phase, for an initial prolonged period.\n\nFor a sense of who we are and what we deliver we invite you to explore online to learn more about Ocado Technology and Ocado Engineering, which directly support the Ocado Solutions division, and take the next step in what will be an amazing career with us.\n\nLearn About Our Partnership With Sobeys\nOcado seals new international tie-up with Sobeys in Canada\nA sneak peek at the future of grocery automation in Canada\nCheck out this video about our advanced robotics technology\n\nOcado is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, national origin, gender, religion, age, disability, veteran’s status, or any other classification as required by applicable law.", "Junior Accountant": "The Opportunity\n\nDo you have a keen eye for detail and love working in collaborative environments? Hyper Hippo Productions is looking for a Junior Accountant to join our studio in Kelowna, BC.\nYou will assist the accountant with bi-weekly payroll, managing account payable, and providing financial data to leadership & management as needed.\n\nAccounting\n\nA Junior Accountant’s impact:\nCollects receipts from cardholders and match them against statements, track down missing receipts, enters Visa statements into Sage\nPrepares month end Bank & Visa reconciliations\nReviews and compare invoices against signed contracts, enters and code invoices into AP software, send invoices for approval, set up payments in bank\nMaintains filing of signed vendor contracts\nPosts month end journal entries\nAssists with month end financial statement reporting and ad hoc reporting as needed\n\nPayroll\nReconciles 3rd party e-commerce payments and accounting for monthly revenues\nReviews & approves timesheets, manages taxable benefits, prepares payroll for review using 3rd party platform, prepares T4 & T4A’s for review\nPrepares GST, WCB, Non Resident Tax Withholdings & EHT reports for review\nAd Hoc filing and general admin duties\n\nYour Track Record Includes\n2+ years formal training in accounting; diploma, certificate or enrolled in CPA program\n2+ years experience, accounts payable, statutory remittances, bank and other reconciliations\nKnowledge of Sage 50 accounting software\nProficient using Microsoft (Excel) & Google Suite\n\nBonus Points If You Have\nGeneral journal entries and payroll experience an asset\nExperience using 3rd party platform to process payroll an asset\n\nOur Perks\nCompetitive salary\nExtraordinary profit sharing program\nAll the other Dental, Health, Wellness Benefits\n3 weeks vacation\n10 personal days per year\nAnnual self development budget (up to $3000 per year) to attend conferences, courses, training – you name it\nReferral bonuses for finding awesome Hippos\nSocial impact \"Hippo Gift Matching\"\nSo much more to share with you!\nWhat’s it like to be a Hippo…?\n\nWell, you would get to be a part of a team that values collaboration and the creative freedom to produce and make games in a studio that oozes work ethic & creative ‘crazy’.\n\nHippo’s hang out, they understand that being a part of something that is bigger than “one” is just super rewarding … and it’s fun. Yeah, we have the ‘usual’; foosball & ping pong, but we also have the unusual in a game studio that goes beyond perks and free snacks, we actually “LIKE” and respect each other, and celebrate the uniqueness that we all rock!\n\nWe trust and value each other’s opinions and are stoked when we all succeed and share in that wild ride, because success is not easy.\n\nOur tribe is definitely unlike most and we want to keep it that way, we like it unusual, a little weird and a lot bold. Interested? …sweet, we’d love to see what you’ve been up to and where you’d like to see yourself go.\n\nVision, Mission & Our Culture\n\nWe envision a world where our global community is always excited to play our next game. We believe entrepreneurs will rally passionate teams to grow the best games.\n\nHappy Life, Happy Hippo\n\nWe care about making great games because we love games and are rewarded for our hard work in spades. Our benefits and working vibe encourage and allow you to live your dreams in Kelowna: an affordable, picturesque, and diverse city, only an hour flight from Vancouver, BC Canada.\n\nWe believe entrepreneurs will rally passionate teams to grow the best games.\nSeniority Level\nEntry level\nIndustry\nMarketing & Advertising Internet Computer Games\nEmployment Type\nFull-time\nJob Functions\nAccounting/Auditing Finance", "Junior Technologist": "Mission\n\nWe are looking for an individual who wants to be challenged and is ready to join a dynamic team that is rapidly expanding. CIMA+ is a well-established, employee-owned, multidisciplinary, Canadian engineering firm. This position is located in our Kelowna office. The mission of the Junior Technologist is to provide design specifications and drawings for outside plant infrastructure (poles, wires, conduits, and cable) in accordance with engineering principles, guidelines, policies, and safety standards.\n\nPlease note that this role can be also location in Victoria (BC).\n\nResponsibilities\nOutside Plant Engineering Design:\nDesign technical specifications and drawings for outside plant network.\nPerform fielding work to assist the design process.\nPrepare estimates for customer requests.\nEnsure adequate capacity of the distribution side of outside plant network is maintained.\nEnsure schedules and deadlines are monitored and adjusted appropriately.\nCommunication:\nLiaise with customers to determine needs and negotiate issues to resolution.\nLiaise with developers and municipal officials to provide communication infrastructure solutions.\nRespond to and/or resolve customer complaints.\nResults or Outcomes:\nNetwork is designed according to specification and meets customer requirements.\nSpecifications are accurately produced and completed in a timely manner.\nCustomer complaints are responded to and resolved in a timely manner.\nAll reports are prepared accurately.\nAll networks reflect accurate costs and billing information.\nService quality and commitment meets or exceeds customer expectations\n\n\nProfile\nHave graduated with a diploma and is a registered Technologist or Technologist in training.\nBe proficient in the use of AutoCAD.\nBe proficient in the use of all Microsoft Office applications.\nHave professional oral and written communication skills.\nSelf-motivated, works well with minimal or no direct supervision.\nAbility to work effectively in a team environment.\nDocumentation and administration/tracking of outside plant records.\nPrepare time and expense reports.\nAbility in planning and organizing to meet scheduled deadlines.\nWorking knowledge of municipal and civil policies and procedures.\nKnowledge of accepted engineering standards and practices to provision the network.\nKnowledge of fibre optic infrastructure.\nWorking knowledge of outside plant analog and digital technologies.\nAbility to effectively handle both favourable and unfavourable customer interactions.\nAbility to lift vault lids, up to 70 lbs.\nPossess a valid class 5 driver's licence.\nKnowledge of safety and environmental policies and regulations would be an asset.\n\n\nBenefits\nFlexible schedules\nSimplified Employee Pension Plan\nComprehensive Benefit Plan\nSick leave and personal leave\nPossibility of investing in a company profit-sharing plan\nAdapted computer tools\nWellness program\nSocial and environmental initiatives\nContinuous training program\nCareer planning\n\n\nWhy join CIMA+?\n\nThe key to our delivery of quality services is being able to attract and maintain satisfied and engaged people. At CIMA+, employees are given the flexibility required to ensure a balanced life and fulfilling work experience in a motivating work environment. Our staff enjoy the diversity of projects and the extensive autonomy given to interact directly with clients. Such proximity is possible because of our flat corporate structure, and it translates into relationships of trust, and effective communications between team members and clients.\n\nAt CIMA+ we are committed to creating opportunities for all our employees so that they may develop, progress, and contribute to the business regardless of differences. We fully respect the principles of employment equity and encourage women, visible minorities, indigenous people, and persons with disabilities to apply. Alternative options are available upon request to facilitate participation in the recruitment process.", "Junior Software Developer in Canada": "If you want to work with an exceptional group of people, in a great location, with numerous benefits and a terrific corporate culture—your are on the right page.\n\nAcro Media is looking for a Junior Software Developer to develop Drupal 8 and Commerce builds. Someone who can code like it’s their native tongue but still talk to our crew comfortably and sometimes even the odd client.\n\nWe consider ourselves a laid-back bunch but driven to do well for our customers. We’re looking for low egos and high skills. You can be young and inexperienced or a savvy veteran, what we’re really looking for is your ability to code, which may be finely honed skill or raw talent at this point.\n\nWe aren't looking to stick you in a corner with headphones on and call you “the IT department”. Developers own this joint; we get it. If you’re desperate to break free from that office life where you co-workers have never even heard of Minecraft, and want to come on board to build kick-ass commerce sites, corporate gems, and the occasional game, keep reading.\n\nAs the successful candidate, here are some things you’ll be responsible for:\n\nProducing high quality work adhering to Acro Media standards and following the Acro Media production process\n\nImplementing updates & revisions to web sites\n\nContributing code back to the Drupal community, testing and responding to issues, maintaining modules.\n\nWorking independently on multiple smaller tasks or larger builds with shifting priorities and tight deadlines\n\nAdhering to and providing accurate estimates for the amount of time required to repair a defect, a build, or to add additional functionality to an existing application\n\nProviding efficient solutions in a timely manner for work requests, issues, and defects\n\nCommunicating well with Account Managers, Supervisors, and Clients in regards to work requests, problems and defects\n\nActing as both a peer/mentor to other Developers as well as be comfortable asking for help from team members\n\nThe Successful Applicant Will Have\n\nAbility to find and fix problems in code, this might not be your code and your only hint might be a cryptic complaint from a client.\n\nA good mix of web development skills, you should be able to build out site template and then code all the gears and pulleys behind the scenes as well, we try not to have people who do all HTML/CSS and people who do all backend coding, we like people who can multi-class. You’re not going to work on the same thing for 8 months. If you only have experience on embedded systems or just design sexy layouts, maybe try to brush up on your weaker areas, we are open minded though so don’t let this scare you away.\n\nOur designers use Photoshop, so when you’re building out the templates, it’s good to know how to navigate around this application. Basic knowledge of how layers work, and the use of some the more important tools that are required for taking apart the design and deriving all the images for web-use is a plus.\n\nWe're Open To Good Programmers Who Know Other Languages And Technologies And Are Willingto Learn, But Below Is a List Of a Bunch Of Stuff We Normally Work With\n\nHas some coding work to send us\n\nPHP\n\nSQL\n\nCSS3/HTML5\n\nJavascript/jQuery\n\nXML\n\nBonus: C++/Objective C/C#/C\n\nIf you know other languages don’t forget to mention them. If you are a badass Lisp hacker type, mention that.\n\nComfortable working in a Linux shell to do day-to-day tasks. Hopefully, you have installed Linux on something at least once, even if it was just your Xbox, phone...or vacuum etc. (For real, though, you can get Linux installed on a Roomba)\n\nSome understanding of Linux hosting if at all possible. Have you configured your own server? Did you setup a web server for your house or friends, even if no one else really cared?\n\nPrior experience with a source control system (ex, SVN, Git, GitHub, etc.)\n\nFormal education or prior experience is NOT required, we just want to know that you can code, so you’ll have to have some work you can show us.\n\nAll offers of employment with Acro Media Inc are contingent upon the candidate having successfully completed a criminal background check.\n\nHere are some things we pride ourselves on being able to offer our staff:\n\nFlex start times & Earned days off:Do you prefer to start at 8:00? or 9:00? We'll work with you. Want every second Friday off? Well we've got a program for that too!\n\nPaid Overtime for all roles...including salary positions: What? What?! Yep you heard right. We pay for all approvedOT...not that we want everyone working so hard,but with the natural ebb and flow of our industry sometimes it's needed to blast out the OT in order to keep our heads above water. We findthis little pay chequenugget is a nice reward for the over timerz.\n\nSlappies: Tougher to explain but once a month we get together and have a little ceremony, some food, a few brews - no altars or corporate chants involved.\n\nFun day: We aim to have fun every day; however, every year for a day we cram a bunch of fun on ourselves. Weee!\n\nSPARC Events: Sometimes we have an in-house breakfast, team building events, (less corny than it sounds), competitions, or just a plain little reward for no reason. It's a little spark in our usually normal days. Warning, we make you wear costumes. Often.\n\nCulture: We're a certain type of people. We're all a little different and unique in our own way but we seem to work well together. No one’s perfect and we embrace that. We take our work seriously, but we don't take ourselves too seriously. Check out our site to get to know us!", "Junior Java Developer": "Your Role\n\nAs a Junior Java Developer at Global Relay, you’ll be using leading edge technologies to build pioneering products that are used by tens of thousands of users globally to solve real world business problems. You also get to tackle interesting and engaging problems to do with scalability and high availability in big data environments. At Global Relay we are continuously pushing the boundaries of Java technology.\n\nThis is an opportunity to work alongside some of the best developers in Vancouver and apply your craft in an environment that encourages creative thinking and autonomy. Our software is developed by small, focused agile teams of developers and QA. We encourage our developers to think beyond a single component to build complete system solutions. Challenge yourself by learning new technologies, and apply your skills across our different projects and application domains. If you are committed to code that is clean, well-tested, well-reviewed, performant and secure then you’ll fit in around here.\n\nYour Job\nWork as part of an agile development team to write Java code for enterprise services\nWrite unit and integration tests for your Java code\nDesign, in collaboration with team, the software implementations that satisfy business requirements\nCollaborate with QA in development of test cases for Java code\nDevelop deployment systems for Java based systems\nDocument code and document detail designs\nCollaborate with product owners on user story generation and refinement\nMonitor and support operation of production systems\nParticipate in knowledge sharing activities with colleagues\n\nAbout You\nPost-secondary education in Computer Science, Engineering or a related subject\n1+ year experience with Core Java through co-op placements or course work\nExperience with any of the following would be considered an asset:\nMulti-threaded programming\nAgile development methodologies\nTest driven development\nContinuous integration systems\nDependency injection containers\nNetwork protocols such as HTTP, TLS, TCP\nWeb services technology such as REST, JSON, or Thrift\nDesign patterns\n\nAbout Us\n\nGlobal Relay is the leading provider of cloud-based archiving, supervision, eDiscovery, and analytics for the global financial sector. We deliver services to 23,000 customers in 90 countries, including 22 of the top 25 global banks. Our market-leading archiving service supports email, instant messaging, Bloomberg®, Thomson Reuters, social media, mobile messaging, and more – with mobile, Outlook, and web access.\n\nOur Global Operations & Development Center is located in Vancouver, BC, Canada. In addition, we have offices in six other cities across the world, including major financial centers like New York, Chicago, and London.\nOver the years, we have won several major awards, including:\nCompany of the Year from the BC Tech Association (2016)\nCanada’s 50 Best Small and Medium Employers (2014, 2015)\nCanada’s Top Employers for Young People (2014)\nCanada’s Top 10 Most Admired Corporate Cultures (2013, 2016)\nCanada’s Best Managed Companies (2013 - present)\nTechnology Fast 50 – Leadership (2014, 2018)\nWe provide fantastic opportunities to individuals passionate about business and technology. For those with international business aspirations, we offer invaluable opportunities for doing business with some of the world’s largest, most influential firms. Our company is also perfect for those who want to create cool technology using massively scalable, big-data architecture, with a strong focus on mobile.\n\nTo learn more about our business, culture, and community involvement, visit www.globalrelay.com .\n\nTo Apply\n\nThink you're a great fit for this job? Apply today with your cover letter and resume, university transcripts, and optionally a link to your GitHub page (or equivalent resource that shows code that you have written).\n\nOptions\n\nApply for this job online Apply\n\nShare\n\nEmail this job to a friend Refer\n\nSorry the Share function is not working properly at this moment. Please refresh the page and try again later.\n\nShare on your newsfeed", "Senior Backend Developer": "Kelowna, British Columbia, Canada.\n\nNote: This is an on-location position only.\n\nSenior Backend Developer (PHP / Symfony)\n\nCheeky Monkey Media is an established web services company with a track record of delivering great looking and diverse web projects during our more than ten years of business.\n\nWe are seeking backend developers to add to our team. We specialize in PHP and MySQL based Drupal development, but previous Drupal experience is not required. A successful candidate will be comfortable with writing and using PHP/MySQL as part of our development team. If you have programming competency, Cheeky Monkey Media will provide mentorship in Drupal.\n\nWhat’s it like to work with monkeys?\n\nFlexibility: Office hours are 9-5, but as long as we meet the needs of the team and the projects we’re working on this can sometimes be a bit flexible.\n\nExtended Learning: Our monkeys are all about attending events that help broaden our developer horizons. You'll almost always find a monkey at any local networking meetups, lunch & learns, or Startup Drinks!\n\nFun: We aim to please, but we also have a great time doing it. We've been known to press pause on our production schedule to engage in Nerf battles. Oh, and there's a guy here with over 2 dozen Star Wars spaceships on his desk.\n\nTeam Building: In-house developers get to partake in some pretty kickass team meetings. Daily developer standups and monthly company-wide check-ins make sure we're always working together.\n\nSupport: We will never let you fall on your monkey-butt. Need help with anything? Ping ourSlack channel and one of themonkeys will answer. Our workflow is designed to help our developers improve and we take opportunities to mentor each other.\n\nCompetitive Pay: We value your talent and for that, you shall be rewarded. You can choose to be paid in Canadian dollars, or delicious yellow bananas. (Disclaimer: We do not actually offerbananas as payment. You must exchange your own currency for your own bananas.)\n\nSenior Backend Developer Duties Would Include\nDrupal site planning and building.\nCustom module/plugin development.\nDevelopment workflow with GIT.\nPerforming code reviews of other team members' code.\nImplementing and using automated testing.\nMaintenance and debugging.\nOffering technical solutions based on client requirements.\nProviding patches to contributed Drupal modules.\nGiving direction as a project tech lead.\nParticipating in a demonstration of completed work.\nMentoring junior developers.\nEducation And Experience Required\nBachelor's Degree in Computer Science or a related field.\nMinimum of 4 years of programming/web development experience.\nExperience with REST API development and integration.\nBONUS - Proficiency in Drupal site engineering, module development & theming.\nBONUS - Frontend experience with HTML/JS/SCSS.\nTO APPLY\nWould you like to apply? If so, please send your resume to click apply", "Clerk Produce": "Requisition ID: 29142\n\nCareer Group: Store Careers\n\nJob Category: Retail - Produce\n\nTravel Requirements\n\nCountry: Canada (CA)\n\nProvince: British Columbia (CA-BC)\n\nCity: kelowna\n\nLocation: Safeway - 4960 (Downtown Kelowna)\n\nPostal Code\n\nSafeway grocery stores provide an exceptional food shopping experience to consumers from Vancouver, British Columbia to Thunder Bay, Ontario. We are the newest member of Sobeys Inc.’s retail food offering which serves the needs of Canadians with more than 1,500 stores in over 800 communities from coast-to-coast. Whether it's your first job or you're ready for a new challenge, we have a career to fit your life. Our commitment to delivering top quality products and superior service to our customers, and for giving back to the communities we serve has earned us a reputation as an employer of choice for those looking for an exciting career in food retail.\n\nOverview\n\nThe Produce Clerk is responsible for carrying out the full range of duties of the position in a professional, responsible, accurate and timely fashion. The Clerk will deliver exceptional customer service, foster customer loyalty, fulfill customer needs and actively contribute to an environment of employee and customer engagement.\n\nJob Description\nAdhere to all Food Safety Protocols, Standard Operating Procedures, Health and Safety, corporate policies, and other programs and initiatives\nProvide customer service to meet customer needs\nKeep work area clean and presentable\nProcess customer Produce orders\nPerform program execution and merchandising of product\nHandle and prepare deli products\nIncrease store sales by actively promoting products\nParticipate in the training of junior staff\nOrder and receive stock in accordance with company inventory control procedures as required\nProcess department shrink\nMaintain a clean and safe working environment as per Company requirements\nOther duties as required\n\n\nJob Requirements\nAbility to work independently in a fast paced environment\n\n\nWhile all responses are appreciated only those being considered for interviews will be acknowledged.\n\nWe appreciate the interest from the Staffing industry however respectfully request no calls or unsolicited resumes from Agencies.", "Cloud Developer - Canada": "Cloud Developer\n\nCanada | Remote | Work from Home\n\nWhy you?\n\nAre you a Canadian based Cloud Engineer or Full Stack Software Developer who can provide consulting services to Pythian’s global clients including planning, designing and implementing new solutions using the latest Cloud and Big Data technologies? Do you want to work on large scale custom consulting projects? Do you want to work remotely to implement and help develop cutting edge solutions, create data pipelines which will migrate data from customers on-prem systems and load it into a cloud hosted Enterprise Data Platform ? If you have a passion for big data and solving complex problems then this could be the job for you!\n\nWhat will you be doing?\nWorking with our Cloud Architects to design and develop end to end Cloud based solutions with heavy focus on application and data, all with good understanding of underlying cloud infrastructure\nBe part of a team of globally dispersed Cloud Consultants, supporting other members of the team in overcoming challenges, removing roadblocks and developing options and solutions\nWorking on complex and varied Cloud Data focused projects such as migrating business-critical applications to the cloud, re-platforming or re-architecting difficult data and analytics use cases; Migrate existing data warehouses from on-premise data center or from one cloud provider to another. As an example of our migration approach, read about our Teradata to Google Cloud Platform migration service.\nHelp our customers to grow from a data warehouse into a true cloud-native data platform with full multi-source data ingestion and integration.\nBuild or move analytic workloads to the cloud for better scalability and efficiency.\nTranslating complex functional and technical requirements into detailed designs.\nWriting high-performance, reliable and maintainable code.\nAutomate, create reusable accelerators to help get the job done quicker and better\nPerform data processing requirements analysis and data flow integrations with external systems.\nSecuring components of clients’ Data platforms.\nDiagnostics and troubleshooting of operational issues. Perform Health-checks and configuration reviews.\nAssisting client developers and advising on efficient data access and manipulations.\n\nWhat do we need from you?\nWhile we realise you might not have everything on the list to be the successful candidate for the Cloud Consultant job you will likely have at least 5 years experience in similar roles. The position requires specialized knowledge and experience in performing the following:\nBe fluent in a couple of object oriented language, preferably Java and Python, familiarity with Scala and Go would be a plus.\nExperience building end to end software on Google Cloud Platform (GCP), Amazon Web Services (AWS) or Microsoft Azure.\nGood knowledge of popular database and data warehouse technologies & concepts from Google, Amazon or Microsoft (Cloud & Conventional RDBMS), such as BigQuery, Redshift, Microsoft Azure SQL Data Warehouse, Snowflake etc.\nExperience with GCP Dataflow, AWS Glue, Azure DataFactory or any equivalent would be great\nExperience in data modeling, data design and persistence (e.g. warehousing, data marts, data lakes).\nGeneral knowledge of modern data-center and cloud infrastructure including server hardware, networking and storage.\n\nWhat do you get in return?\nCompetitive total rewards package\nFlexible work environment: Why commute? Work remotely from your home, there’s no daily travel requirement to an office!\nOutstanding people: Collaborate with the industry’s top minds.\nSubstantial training allowance: Hone your skills or learn new ones; participate in professional development days, attend conferences, become certified, whatever you like!\nAmazing time off: Start with a minimum 3 weeks paid time off, 7 sick days, and 2 professional development days!\nOffice Allowance: A device of your choosing and personalise your work environment!\nFun, fun, fun: Blog during work hours ; take a day off and volunteer for your favorite charity.\n\nWhy Pythian?\n\nPythian excels at helping businesses use their data and cloud to transform how they compete and win in this ever-changing environment by delivering advanced on-prem, hybrid, cloud and multi-cloud solutions to solve the toughest data challenges faster and better than anyone else. Founded and headquartered in Ottawa, Canada in 1997, Pythian now has more than 300 employees located around the globe with over 350 clients spanning industries from SaaS; media; gaming; financial services; e-commerce and more. Pythian is known for its technology-enabled data expertise covering everything from ETL to ML. We pride ourselves on our ability to deliver innovative solutions that meet the specific data goals of each client and have built meaningful partnerships with major cloud vendors AWS, Google and Microsoft. The powerful combination of our extensive expertise in data and cloud and our ability to keep on top of the latest bleeding edge technologies make us the perfect partner to help mid and large-sized businesses transform to stay ahead in today’s rapidly changing digital economy. If you are a Cloud Consultant; live in the United States or Canada; love your data and want to love your career then join us!\n\nIntrigued to see what a job is like at Pythian or check us out @Pythian and #pythianlife . Follow @PythianJobs on Twitter and @loveyourdata on Instagram!\n\nNot the right job for you? Check out what other great jobs Pythian has open around the world! Pythian Careers\n\nDisclaimer\n\nFor this job an equivalent combination of education and experience, which results in demonstrated ability to apply skills will also be considered.\n\nPythian is an equal opportunity employer and welcomes applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\nThe successful applicant will need to fulfill the requirements necessary to obtain a background check.\n\nApplicants must be legally authorized to work in their country of residence permanently– Pythian will not relocate, sponsor, or file petitions of any kind on behalf of a foreign worker to gain a work visa, become a permanent resident based on a permanent job offer, or to otherwise obtain authorization to work.\n\nNo recruitment agencies\nSeniority Level\nEntry level\nIndustry\nInformation Technology & Services\nEmployment Type\nFull-time\nJob Functions\nOther", "Part Time CAREGiver to Seniors - Kelowna": "At Home Instead caring is our passion – and it starts with our CAREGivers .\n\nEvery day families are balancing what feels like a thousand requests, needs, and demands. Many are raising children, working stressful jobs, AND caring for a senior family member. Advances in medicine and healthier lifestyles help seniors live longer and continue to lead more productive lives. But the numbers tell a deeper story: children of seniors who need day-to-day assistance are caught between being an involved, loving parent; a dedicated employee; and a devoted caregiver to the seniors they love. These family caregivers eventually run out of hours in the day and the stress can overcome even the most giving.\n\nThat’s where you come in.\n\nAs a CAREGiver, your job will be to help the senior thrive in their home. By doing that you will also help their children to restore balance, order, and peace to their lives. Caring for seniors is a labour of love that requires a special person with just the right touch. That’s why when you provide care with our Home Instead Senior Care office, you become a CAREGiver with a capital “CARE”.\n\nBecoming a professional CAREGiver is a unique job with many joys and rewards, responsibilities and challenges – both physical and emotional. As a Home Instead CAREGiver you’ll meet wonderful people, build fulfilling relationships, and make a difference in the lives of seniors in your community.\n\nImportant Information\nNo experience or medical skills necessary, we focus on finding amazing people and developing the skill set necessary\nVariable shifts\nAvailability to 15 hrs or more per week. (days, evenings and overnight plus either a Saturday or Sunday)\nCAREGivers require their own personal vehicle and driver's license with no restrictions. We service from Penticton to Lake Country\n\n\nWhat We Offer\nCompetitive Wages\nBenefits package available\nOngoing paid training and education opportunities\nA support team in the office 24/7\nRecognition of the important work you do.\nA fun and rewarding career!", "Investment Solution Representative": "The Investment Solutions Representative supports Interior Savings’ vision of sales & service excellence by developing valuable long-term relationships with members, pro-actively determining & fulfilling their investment needs and providing them sound advice with high-quality financial solutions to match their financial goals.\nThrough personal strengths in communication, sales leadership, and initiative you achieve financial sales goals through a focus on investors seeking diverse investment solutions. You will pro-actively manage client relationships; pursue opportunities and referrals including the success of key programs at the Investment Solutions Centre, including Outbound and Inbound Calls (IBC), Proactive KYC Updates, Mutual Fund sales, Pre-Authorized Credit (PAC) increases as well as referrals to the Wealth department, branch partners and digital channels.\nWith your ability to meet and exceed goals and objectives you will identify referral opportunities to other Interior Savings partners, achieve KYC update objectives and promote digital offerings.\nYou will work as a team member with licensed branch staff to ensure that all member needs are met in a timely manner in order to pro-actively grow the business. You will also perform other duties as assigned.\n  REQUIRED QUALIFICATIONS\nEducation\nHigh School diploma/Grade 12 plus two (2) years of formal post-secondary education or equivalent and have or be willing to work towards the CFP (Certified Financial Planner designation)\nInvestment Funds in Canada course – mutual fund sales license (MFDA)\n Knowledge/Experience\n2-4 years of job related experience in a financial sales & services environment\nDemonstrated knowledge of current domestic and international investment marketplace\nDemonstrated knowledge of RRSPs, RRIFs, RESPs, mutual funds\nFinancial planning courses considered an asset\nAdditional Requirements\nThis position requires work outside of regular branch hours, including evenings and some weekends.\n Come join our team! For more information or to apply for a position please visit our website: www.interiorsavings.com and submit your application. We thank all applicants for their interest and will contact short-listed candidates only.\n  ", "Financial Advisor - Okanagan Kootenay & Area": "The Financial Advisor Opportunity\n\nWe’re looking for dedicated people with an entrepreneurial spirit and an agile and proactive mindset who want to help Canadians achieve their financial goals. Perhaps you are considering a career change or, if you are currently in the industry, you are seeking an opportunity to improve outcomes for yourself and clients. Becoming a financial advisor with IG Wealth Management requires a high degree of dedication, commitment, and effort. For the right individual, combined with our support, this will be a highly rewarding career both personally and professionally. We are committed to excellence. Today, over 1,400 of our Consultants hold the CFP or F. Pl. designation, with a goal of having 100% of Consultants certified.\n\nIt’s a Rewarding Career And We Invite You To Explore The Opportunity We Offer\n\nAt IG Wealth Management, you build your practice on your terms – working directly with clients to develop relationships, provide comprehensive financial plans, and help them achieve financial confidence with their life-long financial goals.\nProvide industry-leading training, support, and ongoing development throughout your career\nSupport you through a team of advanced financial planning experts and a network of wealth planning, mortgage, and insurance planning specialists\nOffer exceptional income potential, where your earnings are reflective of your efforts.\nEncourage independence and work-life synergy as you plan your schedule\n\n\nAbout IG Wealth Management\n\nOur goal is to be Canada’s financial partner of choice.\nFor more than 90 years, we have built meaningful, long-term relationships with our clients and their families. Our synchronized approach to financial planning looks at all aspects of a client’s financial life. We take the time to explore all the life goals, financial aspirations, and concerns clients have for themselves and their families, and then follow up with a comprehensive analysis of their overall financial well-being. We know that life is dynamic, so we assess and adjust client plans as their circumstances change. This approach enables them to take advantage of the possibilities that life brings and helps them realize their full financial potential. Today we deliver financial planning and wealth advice to more than one million Canadians coast to coast through our network of financial advisors.", "Business Systems Analyst": "The Business Systems Analyst is responsible for supporting the implementation of new systems and changes to the existing ones. To succeed in this role, resourcefulness is a necessary skill to have, and you not only enjoy variety, but thrive in a changing and fast-paced environment. You should have the patience to communicate with a variety of interdisciplinary teams and users. Your goal will be to ensure that our systems are stable, reliable, integrated and support the business to run smoothly and efficiently.\n\nResponsibilities:\nSupport the implementation and integration of new enterprise systems and technology\nDetermine ongoing information needs and translate them into functional and technical requirements\nIdentify system changes and complete the installation, configuration, initial data loading, testing and hand over to production, by working with software vendors and/or internal staff\nSupport business software. Perform troubleshooting to diagnose and resolve problems\nPerform proactive system maintenance for excellent performance and optimization\nCreate dashboards, reports, and assist users with ad-hoc requests for data extracts and analysis\nEvaluate training needs, develop training materials and provide system training to existing and new users\nCreate and maintain documentation for all aspects of business systems\nOther project work, as assigned by management\n\nQualifications:\nDiploma/degree in Computer Science, Management of Information Systems or related, plus a minimum of 4 years’ recent experience in a similar role\nExperience with business analysis in an enterprise environment, including requirements gathering, UAT, software implementation, project management methodology, change management and version control\nGood knowledge of Microsoft cloud technologies: Azure AD, O365, SharePoint, Teams\nGood knowledge of various enterprise systems, e.g. IT ticketing, quality management, manufacturing, scheduling, HRIS, etc, and reporting tools, e.g. Power BI, Tableau, Power Pivot, etc. ERP experience is an asset\nAbility to analyze business problems by looking at both process and technology\nResourcefulness and problem-solving aptitude\nClear communication and presentation skills\nAbility to deal with multiple tasks, prioritize, change quickly and work under pressure\nCuriosity, enthusiasm and a passion for technology\nClean criminal record check", "STRATEGIC INFORMATION ANALYST": "STRATEGIC INFORMATION ANALYST\nJob ID 1391448 Date posted 04/15/2020\nJob title :STRATEGIC INFORMATION ANALYST\nCommunity :KELOWNA\nFacility :KELOWNA CHSC\nStatus :PERMANENT FULL TIME\n\nPosition Summary\n\nWe are seeking a Strategic Information Analyst to join our Strategic Information Management team in Kelowna, BC.\n\nThe Strategic Information Analyst will be responsible for supporting strategic information planning, analysis, and decision support within a defined portfolio. The Analyst will be part of the Strategic Information Management Department but will work closely with the Manager or Lead of the assigned portfolio and key internal stakeholders.\n\nTypical Duties And Responsibilities\nProvides timely, relevant, reliable, and clear information with appropriate supporting data analyses and review of alternatives to inform planning and decision-making. This will include population, service utilization, and outcomes analyses and information for use by facilities planning, senior leadership, program Managers, and healthcare providers as well as for public information.\nProvides data analysis using key data sources (population, clinical, organizational, and administrative) in response to strategic and corporate services, senior executive, and program level requests for information and analysis. This work may include data linkage, descriptive information, statistical analyses, and statistical tests of significance.\nReviews planning and evaluation documents as well as plans for allocating resources and provides appropriate information and feedback. This will include health services plan and program planning documents prepared by Interior Health (IH) Health Services planning, Facilities Management, and program staff. Information and feedback will include providing assistance with population and utilization data as well as feedback on planning assumptions.\nProvides input and identifies opportunities for information support activities to the Corporate Director, Information Management. This will include providing suggestions and advice on important data development and future projects/analyses.\nDevelops a strong working relationship with program Managers, Directors, Senior Executive members, Business Support, and others who require information for planning, managing, and evaluating services. Project support may include planning project deliverables and identifying data sources and appropriate methods to support planning, data analyses, writing summary reports, and preparing presentations.\nResponds to data and information requests from staff at all levels of the organization. Provides support and technical advice to staff on the use of strategic information resources and applications.\nWorks with provincial and national representatives on strategic information projects. This may include working with the Canadian Institute for Health Information and Ministry of Health priority projects. The focus of this work will be to review key assumptions and methods, provide data, and assist with interpretation of findings.\nWorks with representatives of other Health Authorities and other data custodians to support strategic information, analysis, interpretation, and reporting initiatives.\nProvides advice, analysis, and recommendations on initiatives related to data collection, database development, and data extraction and analysis to Information Support and Research.\nWorks with Information Management/Information Technology and other IH staff to support timely, reliable, and consistent data reporting and analysis.\nPerforms other duties as assigned.\nQualifications\n\nEducation, Training, and Experience\nA post-secondary degree with completed course work in a health-related discipline, and/or an equivalent combination of education and experience. A Master’s degree is preferred.\nA minimum of two years of experience in data management, linkage, analysis, interpretation, and reporting.\nPreference will be given to a candidate with a strong health information management background including health records training.\nExperience working in a complex computerized environment.\nSkills and Abilities\nTeamwork and strong interpersonal skills due to the amount of communication required.\nCollaborative leadership in order to both work as a member of a team and provide leadership in developing partnerships amongst multiple stakeholders.\nPhysical ability to perform the duties of the position.\nInterior Health values diversity and inclusion. Our goal is to cultivate a workforce rich in culture, experience and knowledge to ensure equitable health outcomes for all of the clients we serve. We are welcoming of all populations including our Aboriginal partners throughout the Interior Health Region. We are committed to increasing our Aboriginal representative workforce to build an engaged, culturally diverse organization focused on the goal of providing high quality, sustainable healthcare through an engaged workforce and healthy workplaces. We build inclusive, trusting and respectful relationships through our partnerships. At Interior Health, Every Person Matters."}