{"0": "LINKages Mission is to foster interactions that promote friendships and understanding between youth and older adults. Intergenerational programs are mutually beneficial and is one type of mentoring program.\n\nLINKages is a charitable organization that provides support and structure for hundreds of youth and seniors resulting in an exchange of knowledge, skills and life experiences between generations. We teach the young about aging while teaching the aged about youth.\n\nNot only does LINKages provide programs for hundreds of youth and seniors in Calgary, we build the capacity of youth and senior serving organizations throughout the province of Alberta through our “train the trainer” workshops. By supporting others we can bridge the gap between knowledge, information and implementation of intergenerational programs and ensure everyone who desires these important relationships has the ability to do so.\nSeniority Level\nAssociate\nIndustry\nNon-profit Organization Management Individual & Family Services\nEmployment Type\nVolunteer\nJob Functions\nOther", "1": "Job Overview\n\nCashiers play a critical role in customer service by providing customers with fast, friendly, accurate and safe service. Cashiers process transactions, answer customer questions, and ensuring customers leave satisfied. They proactively assist customers and direct them to open cash registers and various departments.\n\nMajor Tasks And Responsibilities\nEnsure every item is scanned\nProcess Checkout and obtain payment\nMonitor and maintain the Self-Checkout area\nEnsure inventory accuracy\nFollow all Home Depot policies and procedures\nAsk customers for proof of purchase when necessary\nAchieve cashier metrics on a daily basis\nBe aware of store promotions and rebates\n\nPreferred Qualifications\nExcellent customer service skills\nPrevious cashier experience would be an asset\nExcellent decision making ability and problem solving\nAbility to work a flexible schedule including evenings and weekends\nSeniority Level\nEntry level\nIndustry\nRetail\nEmployment Type\nContract\nJob Functions\nCustomer Service", "2": "Req ID\n1416796BR\nLocation\n15 QUARRY STREET WEST, COCHRANE, AB, T4C 0W5\nTime Type\nPart Time\n\nCompany Summary\n\nWalmart Canada operates a chain of more than 400 stores nationwide serving more than 1.2 million customers each day. Walmart Canada's flagship online store, walmart.ca, is visited by 750,000 customers daily. With more than 85,000 associates, Walmart Canada is one of Canada's largest employers and is ranked one of the country's top 10 most influential brands. Walmart Canada's extensive philanthropy program is focused on supporting Canadian families in need, and since 1994 Walmart Canada has raised and donated more than $400 million to Canadian charities. Additional information can be found at walmartcanada.ca, facebook.com/walmartcanada and @walmartcanada.\n\nPosition Summary\n\nThe Merchandising Associate will provide customer service by completing all modulars and ensuring they are safely stocked. This will be accomplished by maintaining accurate modular integrity and accurately signage all in a safe and clean environment. This Associate will function as part of a team to strategically plan and execute duties based on workload and operational functions. This team will also take the lead role in executing all seasonal guide sets and Home Office bought features. Shift Requirements: A variety of shifts including evenings and weekends.\n\nPosition Responsibilities\n\nPrimary responsibilities are listed below. Other responsibilities may be assigned.\nSetting modular and merchandising non basic items\nPrinting modular, labels and reviewing the floor plan for accuracy\nEnsuring modulars are finalized in the system through aisle location attachment process and stocked\nSetting Home Office Bought Features\nEnsuring proper fixtures and supplies are used and replaced if necessary\nUsing proper signage as the modular dictates (i.e. beanies)\nCompleting hand off walks Provides excellent Customer service through:\nPracticing the 3 Meter Rule\nResponding to customer requests for information and service\nAssisting customer in locating merchandise\nProviding a clean, stocked, well zoned store Ensures that safe work habits are being followed by:\nPerforming warm-up stretches prior to shift\nBeing knowledgeable about emergency and safety procedures\nFollowing pallet jack and equipment safety procedures\nFollowing proper lifting techniques\nMaintaining a safe work area, free of excess debris and fixtures\nFollowing riser and ladder safety\nBeing knowledgeable with lockout/tag out procedures\nProperly handling all liquid and chemical spills\nMaintaining a clean accessible fixture room Ensures cleanliness through:\nDisposing of trash/boxes quickly\nKeeping a clean, hazard free work area\nMaintaining clean modulars\nZoning departments Demonstrates initiative and dependability by:\nWorking well on his/her own and requiring very littler supervision and follow-up\nExcelling in a team working environment\nBeing flexible based on the freight flow and demand\nCanada Walmart Division\nRetail Store Associates\n\nQualifications\n\nQualification Requirements To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are representative of the knowledge, skill and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Previous working experience in a Retail environment is an asset. Mathematical Skills Ability to add, subtract, multiply and divide in all units of measure, using whole numbers, common fractions and decimals. Basic Reading/Writing Skills Ability to understand to the meaning of written or printed matter and to record information by inscribing characters or symbols. Certificates, Licenses, and Registrations The associate must complete all Wal-Mart Basic and Advanced Training Modules and classes. The Associate must also be comfortable working with technology and be willing to learn new technological platforms when required. Physical Demands The physical demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions. While performing the duties of this job, the Associate is regularly required to: Spend frequent periods standing with some opportunity to move about. It is a frequent requirement to stoop or lift material, fixtures or equipment and climb a ladder. The Associate must regularly lift and/or move up to 18 kg (40 lbs.) and occasionally lift and/or move up to 36 kg (80 lbs.). Work Environment The work environment characteristics described in this section are representative of those an associate encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This job is located in a comfortable indoor area. Conditions could produce mild discomfort on occasion, e.g., dust, moderate noise. Regular need to give close attention, either hearing or seeing, to what is happening is required. There is some modest pressure from deadlines or other productivity standards. Work is somewhat repetitious.\n\nLicensing & Other Qualifications\n\nThe Associate must complete all Wal-Mart Basic and Advanced Training Modules and classes\nPhysical Demands\nPhysical Demands The physical demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential job functions. While performing the duties of this job, the Associate is regularly required to: Spend frequent periods standing with some opportunity to move about. It is a frequent requirement to stoop or lift material, fixtures or equipment and climb a ladder. The Associate must regularly lift and/or move up to 18 kg (40 lbs.) and occasionally lift and/or move up to 36 kg (80 lbs.). Work Environment The work environment characteristics described in this section are representative of those an associate encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This job is located in a comfortable indoor area. Conditions could produce mild discomfort on occasion, e.g., dust, moderate noise. Regular need to give close attention, either hearing or seeing, to what is happening is required. There is some modest pressure from deadlines or other productivity standards. Work is somewhat repetitious.\nSchedule Details\nSA: 5:00am - 2:00pm\nSU: 5:00am - 2:00pm\nMO:5:00am - 2:00pm\nTU: 5:00am - 2:00pm\nWE:5:00am - 2:00pm\nTH: 5:00am - 2:00pm\nFR: 5:00am - 2:00pm\nAccessibility\nWalmart will accommodate the disability-related needs of applicants and associates as required by law.\nSeniority Level\nEntry level\nIndustry\nRetail Consumer Goods Supermarkets\nEmployment Type\nPart-time\nJob Functions\nMarketing Sales", "3": "Are you satisfied with you current job? Do you have a warm heart and a loving spirit? If so, we would love to hear from you. Home Instead Senior Care is currently looking for HCA’s that want to make a difference in the lives of others. We offer flexible schedules, competitive wages and a great team of compassionate people to work alongside with.\n\nWhat We Offer Our Employees\nTraining to help you do your job better and support to help you grow in your skills\nReimbursement for driving for the client\nStrong support and backup from our office\nA meaningful job that will not only make a difference in your client’s life, but in your life as well\n\nAreas of assistance may include:\nCompanionship\nLight Housekeeping (cleaning, laundry and washing dishes)\nMeal Preparation\nTransportation\nAssisting with daily living activities such as grooming, dressing and bathing\nAlzheimer/Dementia care\nPalliative/End of life care\n\n\nJob Requirements\nHealth Care Aide Certificate\nHave a genuine compassion for seniors.\nAbility to treat and care for seniors and their property with dignity and respect\nComplete a clear criminal background check and provide 2 professional and 2 personal references\nPossess a valid class 5 driver’s license.\nPossess a reliable vehicle with valid auto insurance\nGood Oral and Communication Skills\nPrevious community experience an asset\nCurrently enrolled in a nursing program, having completed at least one year\nFirst aide & CPR are considered an asset\n\nNeither giving nor receiving care is easy. Home Instead Senior Care ® puts relationships first to support those giving care, to protect the dignity of those receiving care, and to enhance the quality of life for both seniors and their families in every caregiving experience.\n\nWe are looking for exceptional people who want to make a real difference in the lives of those they serve! If you are reliable and responsible with a sincere desire to work with seniors, we want to talk with you!\n\nWe thank all applicants for their interest in Home Instead Senior Care Calgary. Currently, we are only processing applications from candidates that have a valid driver’s license and reliable vehicle to transport our clients. These applicants must currently reside in Alberta & are legally entitled to work in Canada (no sponsorship).\n\nEach Home Instead franchise is independently owned and operated.\nSeniority Level\nEntry level\nIndustry\nIndividual & Family Services Consumer Services Hospital & Health Care\nEmployment Type\nFull-time\nJob Functions\nHealth Care Provider", "4": "A BETTER FUTURE\nEverything begins with passion, a legacy from the Saputo family, which offered tasty and quality cheeses to its community. Today, after more than 65 years, the company employs thousands of dedicated employees, proud of their role, who work day after day to deliver quality products to customers and consumers.\n\nEmployee Benefits\n\nEnsuring the well-being of our employees is our priority. We offer attractive working conditions and benefits to our employees and their families:\nCompetitive salaries\nAdvantageous corporate agreements\nFull range of group insurance benefits\nGroup retirement pension plan with employer contribution\nPurchase option of company stocks\nGroup RRSP\nHealth and wellness program in the workplace\nAssistance program for employees and their families\nWe support employment equity. Saputo strives to embed diversity and inclusion in its operations and invites candidates from all horizons to join its family.\n\nSummary Of Tasks\n\nThis position is responsible for the supervision of plant operations in the process area and personnel in order to produce quality milk products in an efficient, safe and cost effective manner.\n\nResponsibilities\n\n Provides leadership, direction and guidance to production personnel;\n Supervision, evaluation, motivation and training of personnel to ensure work is completed efficiently, effectively and safely;\n Ensures the efficient and effective use of manpower, equipment and material resources;\n Schedules equipment and personnel to ensure production requirements are met on a timely basis;\n Ensures that safe conditions exist at all times within the work environment; will take appropriate action to protect the health and safety of employees;\n Develops and fosters strong and effective functional and cross-functional teams that effectively change systems and procedures through the process of continuous improvement;\n Effectively uses daily production information to track costs, measure trends, and communicate results, positively re-enforce success and initiate corrective action when appropriate;\n Ensures the Company’s quality and sanitation standards are met through close liaison with Quality Services, full participation in the HACCP and Environment programs, as well as frequent review and implementation of Company and Government Policies;\n Administers environmental policies and ensures regulations are followed;\n Communicates with the Maintenance Department to maximize machine efficiencies and monitor equipment performance;\n Administers the Collective Agreement and maintains effective internal and external working relationships;\n\n Other Duties As Required.\n\nQUALIFICATIONS:\n\n Minimum of 3 years experience in Dairy or Food manufacturing environment;\n Post secondary education in Food Sciences, Dairy Technology, Microbiology or other related education/experience would be an asset;\n Thorough knowledge of dairy operations with particular emphasis on processing and sanitation;\n Working knowledge of computers (Microsoft Office, Word, Excel, etc.);\n Superior communication and interpersonal skills; demonstrated analytical organizational skills;\n Must be self-motivated, results oriented, possess high degree of initiative, work well under pressure;\n Proficiency and dependability in current position;\n Must be available to work shift work, holidays, and weekends, being on call;", "5": "Overview\n\nInteract with and serve customers, handle transactions, and provide superior customer service through efficient operation of the store.\n\nResponsibilities\nProvides prompt, efficient and courteous customer service. Uses plus selling techniques.\nMaintains interior and exterior store image standards by general store cleaning and by providing routine maintenance to all beverage and food service equipment.\nReceives vendors and ensures invoices balance with delivery in accordance with store policy and company loss prevention practices.\nCompletes shift worksheets by verifying lottery and cigarette counts and where applicable, gasoline pump readings.\nEnsures merchandise is properly rotated, faced, correctly priced and clean.\nCarries out A.I.M. procedures as assigned by the Store Manager.\nFollows all policies and procedures. (Corporate and Provincial)\nAdheres to Food Safe and sanitation requirements – corporate and provincial.\nAdheres to safety practices and security practices.\nMore in-depth knowledge and responsibilities of ordering and A.I.M.\nPerforms specialized job duties related to such positions of Gasoline Attendant, Sandwich Maker and Retail Post Office Assistant.\nCompletes and reconciles the paperwork for specialized jobs.\nBanking procedures (deposits)\nCommunication skills – policy procedures\nAssists in training of junior staff\nPerforms other duties and responsibilities as assigned by management.\n\nQualifications\n\nSome High School plus 6 – 9 months experience as a Sales Assistant or an equivalent combination of education and experience. In addition, all 7-Eleven Inc. pre-requisites under Store Team Development must be completed.\n\nOptions\n\nApply for this job online Apply\n\nShare\n\nRefer this job to a friend Refer\n\nSorry the Share function is not working properly at this moment. Please refresh the page and try again later.\n\nShare on your newsfeed\nSeniority Level\nAssociate\nIndustry\nConstruction Food & Beverages Retail\nEmployment Type\nFull-time\nJob Functions\nSales Business Development", "6": "Posted by\nKrystal Kasepchuk\nSenior Manager Talent Acquisition at Bell\nThe Source is Canada’s largest tech retailer, and every day we come into work excited to share cool tech and amazing brands with our fellow Canadians. From your local shopping centre to cool music festivals, we are where Canadians live, work and play.\n\nEvery day our Associates across the country help Canadians find the tech they want and need. The Source is a great place to work and we are committed to your development through best in class training programs that help you do your best. Behind our in-store Associates is a supporting team of professionals who curate our product assortment, ensure on-time deliveries, create engaging marketing campaigns and help keep our systems running at peak capacity.\n\nWe are passionate about what we do and look for individuals with their own passion, curiosity and genuine helpfulness to join us!\n\nWhat You’ll Do\nYou’ll be a passionate brand ambassador\nYou’ll contribute to the team’s success by achieving personal sales goals\nAs a Sales Associate, you’ll be an expert in all things tech, and you will help build easy solutions for our customers\nYou will work closely with your teammates to ensure the store is running at its peak operational performance\nYou will stay ahead of the curve by completing training regularly – and then share what you’ve learned with others\n\n\nWhat You’ll Need\nYou need to be passionate about connected technology and how it impacts people’s lives\nYou will need to have great people skills – for example: being a good listener, able to build relationships, and able to overcome objections\nA natural curiosity about technology, telecommunications, and sales\nExperience in retail or sales a definite asset\nYou’ll need to be flexible: ability to work weekdays, evenings, and weekends is a must\n\n\nWhat You’ll Get\nYou’ll be exposed to hands-on and handheld training – get ready to learn!\nOur rewards and recognition programs are vast: enjoy variable pay based on your personal sales, as well as other cool incentives like chances to win trips abroad or even seeded devices\nYou’ll enjoy a compensation package that includes a base wage plus uncapped commissions\nYou’ll get awesome discounts on nearly all of our products\nThinking about building a career with us? Explore endless internal opportunities in both retail and in corporate roles\n\nPosition Type: Retail Stores\nPosition: 2020 Funnel: Sales Associate - Rocky Mtn House- The Source\nJob Location: Canada : Alberta : Rocky Mountain House\nApplication Deadline: 12/31/2020\n\nAs Canada's neighborhood tech retailer you have the opportunity to work close to home, we're proud to offer a competitive compensation package including an extensive recognition and rewards program, career development opportunities, multi faceted training programs, competitive medical and dental benefits, charity and volunteer opportunities and of course, associate discounts!\n\nThe Source celebrates and embraces diversity as part of our culture. We strive to be an inclusive, equitable and accessible environment that supports both our internal and external customers, ensuring everyone feels valued and respected.\nSeniority Level\nEntry level\nIndustry\nMarketing & Advertising Telecommunications Retail\nEmployment Type\nFull-time\nJob Functions\nSales Business Development", "7": "Req Id: 251167\n\nAt Bell, we do more than build world-class networks, develop innovative services and create original multiplatform media content – we’re revolutionizing how Canadians communicate.\n\nIf you’re ready to bring game-changing ideas to life and join a community that values bold ideas, professional growth and employee wellness, we want you on the Bell team.\n\nThe tight-knit Bell Retail team lives and breathes the latest technology, thrives in a fast-paced environment and loves finding the perfect solution for our customers. We’re proud to offer our customers the best wireless, internet, TV, home phone products and services at Bell and The Source stores across Canada.\n\nBring your personality to the job\nYou love helping people find the products that will make their lives better\nYou’re passionate about new technology and ready to explain it to anyone, from an expert to a novice\nYou thrive in a fast-paced environment and have a flexible schedule\nAt Bell, we don’t just accept difference—we celebrate it!\n\nGet Benefits And Build a Career Path\nWe recognize your hard work through incentives, rewards, and employee discounts on services\nFull benefits package for full-time and part-time employees\nOnline and in-class training to develop your skills, along with opportunities for career growth and promotions\nCompetitive hourly wage plus commission (starting at $18-24 per hour*)\n\nBuild great customer experiences that keep customers coming back to our stores\nBe able to build a connection with customers to find the right products and services for them\nProvide a great experience and build loyalty with every customer, every day\nEnjoy the challenge of hitting sales targets\nBe excited to learn about new technology and services\nKnowing a second language is a plus! If you’re applying for a job in Quebec, you’ll need to speak French to do the job\n\nApply now >>\n* This range is not a guaranteed rate. The range presented is an approximation based on current Sales Associate’ commissions and base wages. As it is an uncapped structure, associates may make more than presented, though Sales Associates are guaranteed their base wage as outlined by their employment contract.\n\nBilingualism is an asset (English and French); adequate knowledge of French is required for positions in Quebec.\n\nAdditional Information\n\nPosition Type: Retail Stores\nJob Location: Canada : Alberta : Edmonton\nApplication Deadline: 04/23/2020\n\nPlease apply directly online to be considered for this role. Applications through email will not be accepted.\n\nAt Bell, we don’t just accept difference - we celebrate it. We’re committed to fostering an inclusive, equitable, and accessible workplace where every team member feels valued, respected, and supported, and has the opportunity to reach their full potential. We welcome and encourage applications from people with disabilities.\n\nAccommodations are available on request for candidates taking part in all aspects of the selection process. For a confidential inquiry, simply email your recruiter directly or recruitment@bell.ca to make arrangements. If you have questions regarding accessible employment at Bell please email our Diversity & Inclusion Team at inclusion@bell.ca.\n\nCreated: Canada, AB, Edmonton", "8": "About Computronix\n\nOur low turnover rate, challenging work, great client relationships, and teamwork create a high morale environment with plenty of opportunities to innovate, grow in your career, and never get bored!\n\nAs a Member Of This Team Of Technical Assassins, You Will\n\nAs a Systems Engineer at Computronix, you'll join a high-performing team of Infrastructure and Database Specialists that oversee more than 400 virtualized servers, storage systems, and networks across five data centers and the Microsoft Azure global cloud computing platform.\nConduct analysis, design, and implement solutions involving infrastructure (physical and virtual), database, and application technologies. This includes, but is not limited to:\ncustomer-facing services deployed in Azure using Terraform and ARM Templates\ninternal services like Office 365\nsupporting services like on-premises Hyper-V, SCVMM, SCCM, storage, and networks\nOptimize infrastructure, databases, and applications to improve system availability and performance\nAutomate processes and tasks to reduce effort and improve quality as well as finding and building toolsets to increase productivity (e.g. scripts, utilities)\nTroubleshoot and conduct root cause analysis to resolve complex problems across the technology stack (infrastructure, database, and application)\nPlan and implement complex changes within communicated maintenance windows\nDesign, implement, monitor, and test business continuity services to ensure SLAs and SLOs are met\nApply working knowledge of compliance and security requirements to minimize risk for Computronix and our clients\nYou are perfect for this role if you have…\n5-7 years' experience with:\nMS Azure cloud technologies and services\nMicrosoft System Center suite of products (VMM, CM, DPM)\nPowerShell\nWindows Server 2012R2 and 2016+\nIIS Web Server and web-tier components\nLinux (CentOS)\nVirtualization technology (Microsoft Hyper-V preferred)\nCore services (ADS, DNS, DHCP)\nSwitches, routers, and firewalls\nStorage technologies (SAN, DAS)\nBackup and disaster recovery technologies\nFunctional knowledge of:\nVersion Control Systems (Git)\nAutomation technologies and Pipelines (Terraform and Ansible are desired; Azure DevOps Build and Release pipelines is preferred)\nContainerization technologies\nDatabase technologies\nAssociates or Bachelor's degree in Computer Science, Information Technology or a similar degree is preferred\nMicrosoft certification is desired\nWe value…\nA team environment that is collaborative, open and honest\nAsking questions, trying new things, and continually finding ways to work smarter\nBeing part of a company who makes it their missions to respect, trust, and serve our clients and each other\nSelf-motivation and knowing what we do makes an impact in the lives of others\nYou will receive...\nA competitive pay scale commensurate with your skills and expertise\nA generous medical, dental, and vision benefits plan along with retirement plans.\nA fantastic work environment complete with a lounge with a pool table, gourmet coffee machines, sleep rooms, huge staff dining area, and state of the art facilities/work areas.\nAn opportunity to grow both personally and professionally through our CX Academy.\nWork/life balance is something we are really committed to, not something we just talk about. We believe you should love your work and your play.\nNumerous opportunities to create community through game nights, CX Giving Partnership, summer picnics, our Annual Awards banquet and lots of other great activities throughout the year.\nA commitment to corporate transparency with quarterly all-company meetings.\nIsico539x7", "9": "Financial Services Associate with 1 to 5 years post-Call experience for established firm in Calgary with experience in: Financial Services and Banking; Domestic and cross-border financing transactions; Syndicated lending; Leveraged finance; Project finance; Equipment finance; Real Estate finance; all other matters as required. Lawyers or Partners with portable books may also be considered. Member good standing Law Society of Canadian jurisdiction\nSeniority Level\nAssociate\nIndustry\nLaw Practice Legal Services Banking\nEmployment Type\nFull-time\nJob Functions\nLegal", "10": "Overview / Responsibilities\n\nWood has an immediate, permanent employment opportunity for a Wildlife Biologist in Calgary, AB.The successful candidate will join our wildlife team working on a broad range of resource development projects in western and northern Canada.\n\nThe successful candidate will work within the wildlife group under the supervision of the lead wildlife biologist. Primary responsibilities will be to provide support on a wide variety of projects as delegated by the lead wildlife biologist. This will involve the following:\n\nConducting general and species-specific wildlife surveys, including for Species at Risk\nWorking in remote locations for 1 to 2 weeks\nData entry and analysis\nWriting wildlife assessments and other technical reports\nProposal writing and budget management\n\n\nSkills / Qualifications\n\nThe position requires that the successful candidate has a solid technical and / or academic background which includes:\n\nEducation: B.Sc. in appropriate discipline and/or advanced deg ree\nStrong technical writing skills\nStrong statistical analysis skill\nStrong wildlife identification skills, especially for birds (visual and auditory )\nBe able to recognize wildlife behavior and habitats\nA good understanding of the regulatory requirements for wildlife assessments at both the provincial (Alberta) and federal level\nField experience with wildlife surveys\nWillingness to travel outside of Calgary, work flexible hours including field work under a variety of conditions, and shift work\n\nPreference will be given to candidates with the following:\n\nA person with 5-15 years of experience (however, a person with >15 years of experience would also be considered for a Senior Wildlife Biologist position)\nExperienced in the analysis of large datasets\nExperience with data analysis software (i.e., R)\nExperience setting-up, managing, and conducting querries on databases such Access\n\n\nCompany Overview\n\nWood is a global leader in the delivery of project, engineering and technical services to energy and industrial markets. We operate in more than 60 countries, employing around 60,000 people, with revenues of over $10 billion. We provide performance-driven solutions throughout the asset life cycle, from concept to decommissioning across a broad range of industrial markets, including the upstream, midstream and downstream oil & gas, power & process, environment and infrastructure, clean energy, mining, nuclear, and general industrial sectors. www.woodplc.com\n\nDiversity Statement (EEO)\n\nWe are an equal opportunity employer that recognises the value of a diverse workforce. All suitably qualified applicants will receive consideration for employment on the basis of objective criteria and without regard to the following (which is a non-exhaustive list): race, colour, age, religion, gender, national origin, disability, sexual orientation, gender identity, protected veteran status, or other characteristics in accordance with the relevant governing laws.\n\nApply Now\n\nApply Online Apply\n\nEmail this job to a friend Refer\n\nJoin the Talent Community\n\nInterested in working for Wood? Take the first step today by joining our talent community. By joining the community, your chances of matching to the right role are increased, as our recruiters search the community daily to match open positions with member profiles.\n\nIf you can’t see the perfect role advertised online, the talent community is the best way to keep up to date with job opportunities and events relevant to you.\n\nClick here to join today!", "11": "Are you a recent or impending spring of 2020 graduate? Have you considered a lucrative career in sales? Would you like to join a stable, world-class organization that offers competitive wages, benefits, work life balance and a tremendous opportunity to fast track your career?\n\nIf you answered yes to these questions, then we’d like to talk with you! At WESCO we have developed a successful Sales Development Training Program that is a one year rotational program designed to prepare an individual for a future in technical sales within our organization.  This program helps develop strong selling skills, overall business acumen, sales presence and immerses you with our technical product lines and suppliers to help you seamlessly join our sales teams after successful completion of the program. Oh, yes and we pay you while you learn! We want to invest and bet on your success.\n\nWho we are: WESCO International Inc. is a Fortune 500 leader within the electrical industry. We are a diversified organization with specialty or focus within: industrial, communications, MRO and OEM products, construction, and advanced supply chain management and logistics services. We operate approximately 500 full-service branches and 9 fully automated distribution centers, and employ about 9,100 people. This enables us to serve roughly 70,000 active customers worldwide with $7.7 Billion in Revenue.\n  But WESCO is so much more than just a leading electrical distributor… you would be joining a Fortune 500 company that values inclusion and diversity. At WESCO we believe that each employee contributes directly to WESCO’s growth and success. We are an entrepreneurial company that is customer-driven, market-focused, and solution-savvy, striving to deliver value, service, and results that exceed customer expectations.\n  Why work for us?\n  Aside from the ludicrous earning potential you can have in technical sales, as a WESCO Canada employee, you will enjoy many valued perks including Educational Assistance, Adoption Assistance, Company Sponsored Flexible Group and Health Benefits, Company-paid Pension Contributions, and many employee discount and assistance options and programs. One of our objectives is to provide a work environment that is conducive to both personal and professional growth. We know that your experience here will be challenging, enjoyable, and rewarding. Our employees stay for the long-term because we offer a rewarding and exciting career with lots of room to grow, not just a job!\n  Apply today if you’re interested in career and personal growth. The best go with WESCO!\n\nThis quick apply application is an expression of interest, not an official application. If you are a fit for the job you will be contacted by the recruiter to officially apply to the role at WESCO.com/careers.  \nSeniority Level\nMid-Senior level\nIndustry\nLogistics & Supply Chain Construction Utilities\nEmployment Type\nFull-time\nJob Functions\nSales Engineering Analyst", "12": "Are you looking to make a difference in our community? NAIT has an exciting opportunity to provide inmate education in various correctional centres across Alberta.   \n\nNAIT’s Department of Corporate & International Training is currently seeking instructors to teach specific courses in the following trades: Construction, Electrical, and Plumbing. Courses will be scheduled during regular business hours. Travel may be required in the evenings (Sunday – Friday).\n\nA successful candidate should be an energetic leader of students, enjoy interacting with adult learners, and enjoy sharing their passion for their trade. They will also need to be willing to work on contract and be able to travel.\n\nKey Responsibilities:\n·      Prepare and present classes in a combined classroom and lab setting\n·      Organize and supervise classroom and lab activities\n·      Conduct student evaluations\n·      Participate in course review, shop set up, and curriculum updates/development\n Skills and Abilities:\n·      Proficient in using learning technologies\n·      Outstanding verbal, written, and presentation skills\n·      Must be willing to travel\n·      Must be able to lift 50 lbs\n Qualifications:\n·      Related instructional and working experience\n·      Journeyman in related trade\n·      Experience working with diverse backgrounds an asset\n\nRemuneration: Negotiable\n\n For consideration, please submit your application of interest quoting the above contract number, a cover letter and resume through our applicant tracking system. Successful candidates will be required to complete a criminal record check. ", "13": "", "14": "The Leadership Development Specialist - Canada West is responsible for contributing to and driving successful sales strategies for the Western Canadian Market.\n\nThis role oversees the coordination, logistics, execution of strategies, communication and reporting functions. This position plays a role in creating revenue growth and helping drive other business metrics.\n\nThis individual works with the Leadership Development Team for Canada, is a high energy, self-motivated, results-driven sales professional; has comprehensive experience in sales and network marketing business model; thrives in competitive environments and team settings.\n\nDemonstrates the ability to acquire new business and an expert in building rapport and trust with Leaders and Members\n\nClient Details\n\nIts one of the leading brands in multi level marketing in health and beauty.\n\nDescription\n\nUnder the direct report and in collaboration with the Country Manager, the Leadership Development Specialist for Western Canada will:\n\nEstablish and maintain positive relationships with Field Leaders and Members, as well as Corporate staff\nIdentify Member goals and identify and participate in strategies and solutions to achieve objectives\nAnalyze current report data and individual Member statistics to identify opportunities for field development, retention and recognition opportunities\nIdentify and develop new and existing Leaders to consistently reach Compensation Plan Leadership levels\nImplement national sales programs as directed by the Country Manager by developing field sales action plans\nProvide a positive experience with the Members while providing training and education and respond to Member issues\nAssist with and facilitate workshops, training and corporate events, electronically and in person\nWork with the Country Manager to achieve organizational Objectives and Key Results (OKR's)\nProfile\n\nQualifications\n\nExcellent communication and relationship building skills\nDemonstrated network marketing Field metric analytical skills\nAbility to maintain positive relationships while working closely with counterparts and Field Members\nResults driven while consistently achieving and surpassing KPIs and OKR's\nProven track record of successful execution of incentives\nExtreme attention to detail and multitasking capabilities\nStrong presentation skills\nOutstanding problem-solving skills\nAbility to work under pressure\nMaintain a positive and can-do attitude\nDemonstrate expertise with Microsoft products and other applicable software or applications\nPreference will be given to those candidates who have ability to speak and read Mandarin\n\n\nEducation and Experience\n\nBachelor's degree from a 4-year college or university; or 5+ years of related experience and/or training; or equivalent combination of education and experience\nBusiness plan skills and experience including report analysis, SWOT analysis, value proposition, forecasting, etc.\nMLM experience, preferably in sales or marketing\nExperience working directly with executives and market leaders\nProficiency in Microsoft Office, especially Excel and PowerPoint\nJob Offer\n\nExcellent remuneration and perks", "15": "Locations: Calgary, Edmonton, Fort McMurray, Red Deer, Lethbridge, Medicine Hat, and Grande Prairie\n\nThe Canadian Red Cross Society, a non-profit, humanitarian organization dedicated to helping Canadians, as well as the most vulnerable throughout the world, is seeking Reception and Administrative Support Volunteers. This position will report to Assistant Coordinator or Receptionists in varying sites in Alberta. The Volunteer is responsible to assist in the management of the reception area in which the primary focus is to provide switchboard and reception customer service. It is a first point of contact to The Canadian Red Cross office for staff, volunteers, deliveries and members of the public. This position will also assist in other administrative duties as required.\n\nKey Responsibilities\n\nReception and Administrative Support Activities:\nResponds to general inquiries; provides information and directs the incoming calls to appropriate departments, programs or other agencies\nGreets and directs customers, clients, deliveries to appropriate department or program as first point of reception within the Canadian Red Cross\nGraciously accepts donations to the Society in person, and issues general non-tax receipts\nReceives packages, letters, parcels etc. and signs for deliveries when necessary\nProvide programmatic support to the One Red Cross Office and programs\nIntegrates volunteer resources within the scope of responsibilities, as required\nContributes to a healthy and safe working environment\nEnter data into developed databases; Photocopy, scan and file documents\nAssist with deposits and accounts receivable functions, code and process donations, call Suppliers and/or Donors as required\nAssist with varied administrative tasks as needed\n\n\nSwitchboard Activities\nOperates a multi-line telephone switchboard console; answers all incoming telephone calls and routes to appropriate person or department; responds to inquiries; provides information and/or refers caller to other Red Cross offices or agencies as required\nRepresents the Society in a professional manner by providing efficient management of all incoming telephone calls and client services to a local office\nPerforms other administrative or reception duties as may be required by the other onsite programs\n\n\nQualifications\nStrong communication skills in English required\nExcellent interpersonal skills with demonstrated ability to deal with staff, public and clients required\nProficiency in computer skills/Microsoft Office an asset\nDatabase management experience an asset\nExcellent telephone manner and skills required; experience operating a multi-line switchboard an asset\nExperience working with a diverse population an asset\nValid Standard or emergency first aid certificate is required. Or, must be willing to achieve this standard\n\n\nThis position requires a satisfactory Vulnerable Sector Criminal Record reference check.\n\nTime Commitment\nCommit for a minimum of six months\n1 or more shifts (1/2 or full day shifts) per week during the regular office hours from 8:30 AM to 4:30 PM\n\n\nWorking Conditions: Work is performed in an office environment. Extended evening and week hours may be required during times of emergency response.\n\nBenefits: This position provides excellent opportunity for anyone who is interested in gaining non-profit experience. Anyone who is interested in acquiring data entry and administration experience should apply.\n\nInterested applicants please https://trr.tbe.taleo.net/trr01/ats/careers/requisition.jsp?org=CRCS&cws=56&rid=5591&_ga=2.33185598.1251085355.1575937832-1835038444.1506459257\n\nThe Canadian Red Cross is committed to gender equality and social inclusion in our workplace. All qualified applications will receive consideration without regard to sex, gender identity, gender expression, sexual orientation, race, ethnic origin, color, religion, nationality, disability, age, or any other characteristic protected by applicable law. We encourage all qualified persons to apply, particularly Indigenous peoples, persons with disabilities, ethnic minorities, visible minorities, and others who share our values and contribute to fostering an inclusive and diverse workplace.", "16": "Ensuring best practices are employed in the development, enhancement, updating and delivery of programming;\nSupporting formative evaluation efforts of Deans and Departments;\nDeveloping, implementing and maintaining a Program Review process;\nCreating and implementing a Master Academic Plan;\nProviding leadership of academic policy development and final approval at Academic Council;\nMaintaining regular contact with Deans and Academic Directors and support efforts to deliver quality instruction; and\nEngaging with the Senior Leadership Team, Deans and Chairs’ Councils, Academic Council and other academic committees as relevant.\nAn abundance of forest reserves to responsibly meet the needs of a sustainable forest products industry.\nWorld-class agriculture production supported by exceptional farmland.\nAn abundance of land suitable for both industrial and residential development.\nAn abundance of clean air and water.\nUnmatched scenery and culturally diverse communities with limitless opportunities for leisure and recreation.\nRegional strength created from policies such as no provincial sales tax and low municipal tax.\nA thriving and diverse arts community\nAn exceptional quality of life with access to the best amenities, health services and community programs making the Grande Prairie Region an ideal place to raise a family.", "17": "TRS Staffing is a leading global technical recruitment company providing professional contract and permanent staff to a diverse world-wide client base.  Our client, a large EPC, is currently seeking Document Control for a contract role based in Calgary, Alberta.\n\nRequirements:\nAccurate and timely receipt and tracking of electronic technical documentation for supplier data into Electronic Document Management System\nUpload and Routing of Squad Check reviews\nQuality check all Supplier documentation received and issued on the project\nReview, compile, attribute, validate and bulk load data into an Electronic Document Management System\nAbility to read and understand engineering standards and specifications as they relate to document/data control.\nSupport users on how to use Electronic Document Management System on the project\nInteract and work with other office locations for work share execution\nSupplier Master Document Register uploads in the Electronic Document Management System\nAssist in supplier kick-off meetings\n\nQualifications:\nRequires a minimum of 2 total years of project related experience in the EPC industry\nRequires a minimum of 1 year processing of supplier/vendor documents\nAbility to work under pressure, managing multiple tasks, and priorities is a plus\nRequires strong computer skills and must have great working knowledge of desktop software such as\nMicrosoft Office Suite and Adobe Acrobat. Advance MS Excel skills is a plus.\nExcellent interpersonal and communication skills, both written and verbal\nSeniority Level\nMid-Senior level\nIndustry\nOil & Energy\nEmployment Type\nFull-time\nJob Functions\nEngineering", "18": "Has your paper napkin business plan turned into a billion-dollar reality? Ours has, and our employees have helped us get to where we are today; and as we continue to scale towards being the incomparable leader in our industry, we are looking for a Business Analyst to help write the next chapter with us.\n\nWhat started as a sketch on a napkin is now our world-class software platform that combines cutting-edge technology with outstanding client service and premier wealth management capabilities. Shareworks by Morgan Stanley is designed to simplify the complexities of equity plan management, while helping employees realize the full potential of their benefits.\n\nLocated in Calgary, Alberta and reporting to the Director, Revenue Marketing Operations, you will support business unit reporting, business process improvement, root cause analysis and Salesforce customization. Success in this role requires exceptional initiative, a drive to seek out new information and ideas, and an ability to bring structure to abstract problems. In return, you will get to work with a small, dynamic team and drive improvement across many parts of the business. Along the way you will also learn valuable insights into how the business runs. Strong performing individuals will be supported in further professional development and will gain a great platform for future advancement.\n\nResponsibilities\n\nPlanning of resources, tools, timelines and revenue dimensions to support sales and marketing team activities, territories and channels.\n\nBe a resident Salesforce expert and administrator for the business.\n\nReview benchmarks and value drivers across multiple business units; backup findings with data evidence.\n\nObserve actual work processes and ask good questions to identify key measures of success.\n\nUse prescriptive analysis to construct predictions about future outcomes such as the life-time value of clients; make recommendations to processes to improve sales velocity and lead conversion rate.\n\nBuild deterministic and stochastic models, utilizing data analytics tools, to optimize sales processes.\n\nTrain stakeholders across business units on best practices and recommended processes.\n\nAdvanced degree in a quantitative field such as computer science, mathematics, engineering or business\n\nExperience in a project-based or consulting role demonstrating the ability to change focus and quickly add value.\n\nWork experience as a Salesforce administrator; process automation within Salesforce preferred.\n\nExperience Working In The B2B SaaS Industry Preferred.\n\nNaturally curious and a very logical mind.\n\nTeam oriented, pragmatic, motivated, and goal oriented.\n\nA good understanding of process design and mapping and a willingness to dig into the details to understand issues.\n\nAdaptable, able to quickly move into new situations and build relationships.\n\nWhile we thank all applicants for their interest, please note that only those individuals selected for an interview will be contacted.\n\nPosting Date\n\nMar 25, 2020\n\nPrimary Location\n\nAmericas-Canada-Alberta-Calgary\n\nJob\n\nWealth Management\n\nEmployment Type\n\nFull Time\n\nJob Level\n\nProfessional", "19": "Kelly Services is looking for experienced  Payroll Specialist in Calgary.   \n  Duties & Responsibilities:\n\nReview submitted time and attendance records\nAdminister garnishments, pay adjustments, taxable fringe benefits and benefit deductions\nAdminister the company’s retirement plan, including reconciliation of employer and employee payroll contributions\nPrepare monthly and annual reconciliations and remittances, including tax liabilities\nUpdate employee records information relating to payroll, processing new hires, terminations, transfers and promotions\nMaintain the accuracy of our HRIS\n\nSkill Requirements:\n 2+ years of progressive payroll experience\nADP Workday software payroll knowledge or similar software\nPCP certification or working towards it\nProficiency with MS Office (Excel, Outlook & Word)\nProven ability to work with confidential information and ensure integrity, confidentiality and discretion\nExcellent verbal and written communication skills\n\nEducation:\nDegree or Diploma/Certificate in Payroll\nSeniority Level\nMid-Senior level\nIndustry\nAccounting\nEmployment Type\nFull-time\nJob Functions\nAnalyst Accounting/Auditing Finance", "20": "", "21": "", "22": "", "23": "Champion Petfoods is expanding! We are excited to announce that we are looking for Product Development Technicians to join our rapidly growing company. With thirty years of growth in the global pet food sector, our ORIJEN and ACANA brands define our vision of being trusted by pet lovers worldwide. If you are passionate about personal and professional growth and see yourself as a key player contributing to our continued success by working in our award-winning company – we would like to hear from you.\n\nReports To\n\nLead, Product Development and Innovation\n\nSummary\n\nThe Product Development Technician works with the Manager, Product Development and Innovation and the Lead, Product Development and Innovation to ensure the goals of the department are met. This position has accountability to the support of efficient and timely launches of new products, development of products that meet or exceed product performance goals and development and validation of scientifically proven diets for dogs and cats. The Product Development Technician participates in all areas of product development including test runs, application, as well as nutritional and performance studies. This includes test runs for both Product Development and Research based projects. The Product Development Technician works out of our Morinville Administration Building and Research Lab until we transition to the NorthStar Kitchen in Acheson.\n\nResponsibilities\n\nEffective day to day coordination of studies and activities aimed at process improvements or performance including report writing.\nMaintain high levels of understanding of the pet food industry, including attending forums or seminars related to the development of new trends or technologies within the pet food realm.\nDemonstrate a strong understanding of pilot scale equipment and machinery, including the ability to operate independently and train and cross-training with others.\nHelp prepare ingredient and kibble test runs in the pilot plant for third party testing.\nEfficiently organize and receive records, test results, and third-party data, which may include data entry as required.\nParticipate in product development projects, which includes researching and developing ideas that are in alignment with the Company’s mission and values.\nParticipate in all activities related to product development and innovation, including formula test runs, product testing for innovation projects and performance testing for Product Development and Research projects.\nDemonstrate a strong understanding of kibble cooking techniques and the function of production equipment and machinery.\nAssist other divisional teams in testing new ideas using pilot scale equipment as required\nAid in the development of departmental standards, practices, and procedures that comply with all relevant regulatory requirements and with corporate policies, practices, and procedures.\nAccurately and securely maintain and store all records of test results, projects, and other intellectual property.\nDemonstrate strong knowledge of the Company’s policies and practices regarding health, safety and the environment, including commitment to personal compliance with same.\nPerform other tasks as assigned.\n\nRequirements\n\nMinimum of a 2-year college diploma in a related field (Science, Engineering, etc.). Newly graduated candidates with minimal experience are encouraged to apply.\nA fundamental understanding of mathematics and the ability to perform unit conversions and calculations.\nExperience interacting with others and working within a team, demonstrating diplomacy and professionalism at all times.\nDetail-oriented, with a good ability to review documentation for accuracy, completeness, and compliance to Standard Operating Procedures (SOPs) and Good Manufacturing Practices (GMPs).\nExcellent written and verbal communication skills.\nFluent in English, both written and spoken.\nExcellent organizational and planning skills with the ability to multi-task and set priorities.\nUses discretion and judgment in handling confidential, proprietary or sensitive information.\nAble to work effectively independently or within a group.\nPassion to learn, develop, and implement new technologies and methods.\nComputer proficiency with MS Office programs.\nAbility to lift to safely lift up to 25kgs overhead, repeatedly.\nAbility to work shifts at cold temperatures (<4°C)\nPersonal Protection Equipment may be required for some work site locations\nSeniority Level\nMid-Senior level\nIndustry\nFood Production Consumer Goods Veterinary\nEmployment Type\nFull-time\nJob Functions\nManufacturing Science Research"}