{"Cloud Developer - Canada": "Cloud Developer\n\nCanada | Remote | Work from Home\n\nWhy you?\n\nAre you a Canadian based Cloud Engineer or Full Stack Software Developer who can provide consulting services to Pythian’s global clients including planning, designing and implementing new solutions using the latest Cloud and Big Data technologies? Do you want to work on large scale custom consulting projects? Do you want to work remotely to implement and help develop cutting edge solutions, create data pipelines which will migrate data from customers on-prem systems and load it into a cloud hosted Enterprise Data Platform ? If you have a passion for big data and solving complex problems then this could be the job for you!\n\nWhat will you be doing?\nWorking with our Cloud Architects to design and develop end to end Cloud based solutions with heavy focus on application and data, all with good understanding of underlying cloud infrastructure\nBe part of a team of globally dispersed Cloud Consultants, supporting other members of the team in overcoming challenges, removing roadblocks and developing options and solutions\nWorking on complex and varied Cloud Data focused projects such as migrating business-critical applications to the cloud, re-platforming or re-architecting difficult data and analytics use cases; Migrate existing data warehouses from on-premise data center or from one cloud provider to another. As an example of our migration approach, read about our Teradata to Google Cloud Platform migration service.\nHelp our customers to grow from a data warehouse into a true cloud-native data platform with full multi-source data ingestion and integration.\nBuild or move analytic workloads to the cloud for better scalability and efficiency.\nTranslating complex functional and technical requirements into detailed designs.\nWriting high-performance, reliable and maintainable code.\nAutomate, create reusable accelerators to help get the job done quicker and better\nPerform data processing requirements analysis and data flow integrations with external systems.\nSecuring components of clients’ Data platforms.\nDiagnostics and troubleshooting of operational issues. Perform Health-checks and configuration reviews.\nAssisting client developers and advising on efficient data access and manipulations.\n\nWhat do we need from you?\nWhile we realise you might not have everything on the list to be the successful candidate for the Cloud Consultant job you will likely have at least 5 years experience in similar roles. The position requires specialized knowledge and experience in performing the following:\nBe fluent in a couple of object oriented language, preferably Java and Python, familiarity with Scala and Go would be a plus.\nExperience building end to end software on Google Cloud Platform (GCP), Amazon Web Services (AWS) or Microsoft Azure.\nGood knowledge of popular database and data warehouse technologies & concepts from Google, Amazon or Microsoft (Cloud & Conventional RDBMS), such as BigQuery, Redshift, Microsoft Azure SQL Data Warehouse, Snowflake etc.\nExperience with GCP Dataflow, AWS Glue, Azure DataFactory or any equivalent would be great\nExperience in data modeling, data design and persistence (e.g. warehousing, data marts, data lakes).\nGeneral knowledge of modern data-center and cloud infrastructure including server hardware, networking and storage.\n\nWhat do you get in return?\nCompetitive total rewards package\nFlexible work environment: Why commute? Work remotely from your home, there’s no daily travel requirement to an office!\nOutstanding people: Collaborate with the industry’s top minds.\nSubstantial training allowance: Hone your skills or learn new ones; participate in professional development days, attend conferences, become certified, whatever you like!\nAmazing time off: Start with a minimum 3 weeks paid time off, 7 sick days, and 2 professional development days!\nOffice Allowance: A device of your choosing and personalise your work environment!\nFun, fun, fun: Blog during work hours ; take a day off and volunteer for your favorite charity.\n\nWhy Pythian?\n\nPythian excels at helping businesses use their data and cloud to transform how they compete and win in this ever-changing environment by delivering advanced on-prem, hybrid, cloud and multi-cloud solutions to solve the toughest data challenges faster and better than anyone else. Founded and headquartered in Ottawa, Canada in 1997, Pythian now has more than 300 employees located around the globe with over 350 clients spanning industries from SaaS; media; gaming; financial services; e-commerce and more. Pythian is known for its technology-enabled data expertise covering everything from ETL to ML. We pride ourselves on our ability to deliver innovative solutions that meet the specific data goals of each client and have built meaningful partnerships with major cloud vendors AWS, Google and Microsoft. The powerful combination of our extensive expertise in data and cloud and our ability to keep on top of the latest bleeding edge technologies make us the perfect partner to help mid and large-sized businesses transform to stay ahead in today’s rapidly changing digital economy. If you are a Cloud Consultant; live in the United States or Canada; love your data and want to love your career then join us!\n\nIntrigued to see what a job is like at Pythian or check us out @Pythian and #pythianlife . Follow @PythianJobs on Twitter and @loveyourdata on Instagram!\n\nNot the right job for you? Check out what other great jobs Pythian has open around the world! Pythian Careers\n\nDisclaimer\n\nFor this job an equivalent combination of education and experience, which results in demonstrated ability to apply skills will also be considered.\n\nPythian is an equal opportunity employer and welcomes applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process.\n\nThe successful applicant will need to fulfill the requirements necessary to obtain a background check.\n\nApplicants must be legally authorized to work in their country of residence permanently– Pythian will not relocate, sponsor, or file petitions of any kind on behalf of a foreign worker to gain a work visa, become a permanent resident based on a permanent job offer, or to otherwise obtain authorization to work.\n\nNo recruitment agencies\nSeniority Level\nEntry level\nIndustry\nInformation Technology & Services\nEmployment Type\nFull-time\nJob Functions\nOther", "Part Time CAREGiver to Seniors - Kelowna": "At Home Instead caring is our passion – and it starts with our CAREGivers .\n\nEvery day families are balancing what feels like a thousand requests, needs, and demands. Many are raising children, working stressful jobs, AND caring for a senior family member. Advances in medicine and healthier lifestyles help seniors live longer and continue to lead more productive lives. But the numbers tell a deeper story: children of seniors who need day-to-day assistance are caught between being an involved, loving parent; a dedicated employee; and a devoted caregiver to the seniors they love. These family caregivers eventually run out of hours in the day and the stress can overcome even the most giving.\n\nThat’s where you come in.\n\nAs a CAREGiver, your job will be to help the senior thrive in their home. By doing that you will also help their children to restore balance, order, and peace to their lives. Caring for seniors is a labour of love that requires a special person with just the right touch. That’s why when you provide care with our Home Instead Senior Care office, you become a CAREGiver with a capital “CARE”.\n\nBecoming a professional CAREGiver is a unique job with many joys and rewards, responsibilities and challenges – both physical and emotional. As a Home Instead CAREGiver you’ll meet wonderful people, build fulfilling relationships, and make a difference in the lives of seniors in your community.\n\nImportant Information\nNo experience or medical skills necessary, we focus on finding amazing people and developing the skill set necessary\nVariable shifts\nAvailability to 15 hrs or more per week. (days, evenings and overnight plus either a Saturday or Sunday)\nCAREGivers require their own personal vehicle and driver's license with no restrictions. We service from Penticton to Lake Country\n\n\nWhat We Offer\nCompetitive Wages\nBenefits package available\nOngoing paid training and education opportunities\nA support team in the office 24/7\nRecognition of the important work you do.\nA fun and rewarding career!", "Investment Solution Representative": "The Investment Solutions Representative supports Interior Savings’ vision of sales & service excellence by developing valuable long-term relationships with members, pro-actively determining & fulfilling their investment needs and providing them sound advice with high-quality financial solutions to match their financial goals.\nThrough personal strengths in communication, sales leadership, and initiative you achieve financial sales goals through a focus on investors seeking diverse investment solutions. You will pro-actively manage client relationships; pursue opportunities and referrals including the success of key programs at the Investment Solutions Centre, including Outbound and Inbound Calls (IBC), Proactive KYC Updates, Mutual Fund sales, Pre-Authorized Credit (PAC) increases as well as referrals to the Wealth department, branch partners and digital channels.\nWith your ability to meet and exceed goals and objectives you will identify referral opportunities to other Interior Savings partners, achieve KYC update objectives and promote digital offerings.\nYou will work as a team member with licensed branch staff to ensure that all member needs are met in a timely manner in order to pro-actively grow the business. You will also perform other duties as assigned.\n  REQUIRED QUALIFICATIONS\nEducation\nHigh School diploma/Grade 12 plus two (2) years of formal post-secondary education or equivalent and have or be willing to work towards the CFP (Certified Financial Planner designation)\nInvestment Funds in Canada course – mutual fund sales license (MFDA)\n Knowledge/Experience\n2-4 years of job related experience in a financial sales & services environment\nDemonstrated knowledge of current domestic and international investment marketplace\nDemonstrated knowledge of RRSPs, RRIFs, RESPs, mutual funds\nFinancial planning courses considered an asset\nAdditional Requirements\nThis position requires work outside of regular branch hours, including evenings and some weekends.\n Come join our team! For more information or to apply for a position please visit our website: www.interiorsavings.com and submit your application. We thank all applicants for their interest and will contact short-listed candidates only.\n  ", "Financial Advisor - Okanagan Kootenay & Area": "The Financial Advisor Opportunity\n\nWe’re looking for dedicated people with an entrepreneurial spirit and an agile and proactive mindset who want to help Canadians achieve their financial goals. Perhaps you are considering a career change or, if you are currently in the industry, you are seeking an opportunity to improve outcomes for yourself and clients. Becoming a financial advisor with IG Wealth Management requires a high degree of dedication, commitment, and effort. For the right individual, combined with our support, this will be a highly rewarding career both personally and professionally. We are committed to excellence. Today, over 1,400 of our Consultants hold the CFP or F. Pl. designation, with a goal of having 100% of Consultants certified.\n\nIt’s a Rewarding Career And We Invite You To Explore The Opportunity We Offer\n\nAt IG Wealth Management, you build your practice on your terms – working directly with clients to develop relationships, provide comprehensive financial plans, and help them achieve financial confidence with their life-long financial goals.\nProvide industry-leading training, support, and ongoing development throughout your career\nSupport you through a team of advanced financial planning experts and a network of wealth planning, mortgage, and insurance planning specialists\nOffer exceptional income potential, where your earnings are reflective of your efforts.\nEncourage independence and work-life synergy as you plan your schedule\n\n\nAbout IG Wealth Management\n\nOur goal is to be Canada’s financial partner of choice.\nFor more than 90 years, we have built meaningful, long-term relationships with our clients and their families. Our synchronized approach to financial planning looks at all aspects of a client’s financial life. We take the time to explore all the life goals, financial aspirations, and concerns clients have for themselves and their families, and then follow up with a comprehensive analysis of their overall financial well-being. We know that life is dynamic, so we assess and adjust client plans as their circumstances change. This approach enables them to take advantage of the possibilities that life brings and helps them realize their full financial potential. Today we deliver financial planning and wealth advice to more than one million Canadians coast to coast through our network of financial advisors.", "Business Systems Analyst": "The Business Systems Analyst is responsible for supporting the implementation of new systems and changes to the existing ones. To succeed in this role, resourcefulness is a necessary skill to have, and you not only enjoy variety, but thrive in a changing and fast-paced environment. You should have the patience to communicate with a variety of interdisciplinary teams and users. Your goal will be to ensure that our systems are stable, reliable, integrated and support the business to run smoothly and efficiently.\n\nResponsibilities:\nSupport the implementation and integration of new enterprise systems and technology\nDetermine ongoing information needs and translate them into functional and technical requirements\nIdentify system changes and complete the installation, configuration, initial data loading, testing and hand over to production, by working with software vendors and/or internal staff\nSupport business software. Perform troubleshooting to diagnose and resolve problems\nPerform proactive system maintenance for excellent performance and optimization\nCreate dashboards, reports, and assist users with ad-hoc requests for data extracts and analysis\nEvaluate training needs, develop training materials and provide system training to existing and new users\nCreate and maintain documentation for all aspects of business systems\nOther project work, as assigned by management\n\nQualifications:\nDiploma/degree in Computer Science, Management of Information Systems or related, plus a minimum of 4 years’ recent experience in a similar role\nExperience with business analysis in an enterprise environment, including requirements gathering, UAT, software implementation, project management methodology, change management and version control\nGood knowledge of Microsoft cloud technologies: Azure AD, O365, SharePoint, Teams\nGood knowledge of various enterprise systems, e.g. IT ticketing, quality management, manufacturing, scheduling, HRIS, etc, and reporting tools, e.g. Power BI, Tableau, Power Pivot, etc. ERP experience is an asset\nAbility to analyze business problems by looking at both process and technology\nResourcefulness and problem-solving aptitude\nClear communication and presentation skills\nAbility to deal with multiple tasks, prioritize, change quickly and work under pressure\nCuriosity, enthusiasm and a passion for technology\nClean criminal record check", "STRATEGIC INFORMATION ANALYST": "STRATEGIC INFORMATION ANALYST\nJob ID 1391448 Date posted 04/15/2020\nJob title :STRATEGIC INFORMATION ANALYST\nCommunity :KELOWNA\nFacility :KELOWNA CHSC\nStatus :PERMANENT FULL TIME\n\nPosition Summary\n\nWe are seeking a Strategic Information Analyst to join our Strategic Information Management team in Kelowna, BC.\n\nThe Strategic Information Analyst will be responsible for supporting strategic information planning, analysis, and decision support within a defined portfolio. The Analyst will be part of the Strategic Information Management Department but will work closely with the Manager or Lead of the assigned portfolio and key internal stakeholders.\n\nTypical Duties And Responsibilities\nProvides timely, relevant, reliable, and clear information with appropriate supporting data analyses and review of alternatives to inform planning and decision-making. This will include population, service utilization, and outcomes analyses and information for use by facilities planning, senior leadership, program Managers, and healthcare providers as well as for public information.\nProvides data analysis using key data sources (population, clinical, organizational, and administrative) in response to strategic and corporate services, senior executive, and program level requests for information and analysis. This work may include data linkage, descriptive information, statistical analyses, and statistical tests of significance.\nReviews planning and evaluation documents as well as plans for allocating resources and provides appropriate information and feedback. This will include health services plan and program planning documents prepared by Interior Health (IH) Health Services planning, Facilities Management, and program staff. Information and feedback will include providing assistance with population and utilization data as well as feedback on planning assumptions.\nProvides input and identifies opportunities for information support activities to the Corporate Director, Information Management. This will include providing suggestions and advice on important data development and future projects/analyses.\nDevelops a strong working relationship with program Managers, Directors, Senior Executive members, Business Support, and others who require information for planning, managing, and evaluating services. Project support may include planning project deliverables and identifying data sources and appropriate methods to support planning, data analyses, writing summary reports, and preparing presentations.\nResponds to data and information requests from staff at all levels of the organization. Provides support and technical advice to staff on the use of strategic information resources and applications.\nWorks with provincial and national representatives on strategic information projects. This may include working with the Canadian Institute for Health Information and Ministry of Health priority projects. The focus of this work will be to review key assumptions and methods, provide data, and assist with interpretation of findings.\nWorks with representatives of other Health Authorities and other data custodians to support strategic information, analysis, interpretation, and reporting initiatives.\nProvides advice, analysis, and recommendations on initiatives related to data collection, database development, and data extraction and analysis to Information Support and Research.\nWorks with Information Management/Information Technology and other IH staff to support timely, reliable, and consistent data reporting and analysis.\nPerforms other duties as assigned.\nQualifications\n\nEducation, Training, and Experience\nA post-secondary degree with completed course work in a health-related discipline, and/or an equivalent combination of education and experience. A Master’s degree is preferred.\nA minimum of two years of experience in data management, linkage, analysis, interpretation, and reporting.\nPreference will be given to a candidate with a strong health information management background including health records training.\nExperience working in a complex computerized environment.\nSkills and Abilities\nTeamwork and strong interpersonal skills due to the amount of communication required.\nCollaborative leadership in order to both work as a member of a team and provide leadership in developing partnerships amongst multiple stakeholders.\nPhysical ability to perform the duties of the position.\nInterior Health values diversity and inclusion. Our goal is to cultivate a workforce rich in culture, experience and knowledge to ensure equitable health outcomes for all of the clients we serve. We are welcoming of all populations including our Aboriginal partners throughout the Interior Health Region. We are committed to increasing our Aboriginal representative workforce to build an engaged, culturally diverse organization focused on the goal of providing high quality, sustainable healthcare through an engaged workforce and healthy workplaces. We build inclusive, trusting and respectful relationships through our partnerships. At Interior Health, Every Person Matters."}